#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Attach011

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Attach011.ABP_Attach011_C.ExecuteUbergraph_ABP_Attach011
// 0x0008 (0x0008 - 0x0000)
struct ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011) == 0x000004, "Wrong alignment on ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011");
static_assert(sizeof(ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011) == 0x000008, "Wrong size on ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011");
static_assert(offsetof(ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011, EntryPoint) == 0x000000, "Member 'ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'ABP_Attach011_C_ExecuteUbergraph_ABP_Attach011::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function ABP_Attach011.ABP_Attach011_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Attach011_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Attach011_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Attach011_C_AnimGraph");
static_assert(sizeof(ABP_Attach011_C_AnimGraph) == 0x000010, "Wrong size on ABP_Attach011_C_AnimGraph");
static_assert(offsetof(ABP_Attach011_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Attach011_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

