#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoSaveCaution_P

#include "Basic.hpp"


namespace SDK::Params
{

// Function AutoSaveCaution_P.AutoSaveCaution_P_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AutoSaveCaution_P_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AutoSaveCaution_P_C_ReceiveTick) == 0x000004, "Wrong alignment on AutoSaveCaution_P_C_ReceiveTick");
static_assert(sizeof(AutoSaveCaution_P_C_ReceiveTick) == 0x000004, "Wrong size on AutoSaveCaution_P_C_ReceiveTick");
static_assert(offsetof(AutoSaveCaution_P_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AutoSaveCaution_P_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function AutoSaveCaution_P.AutoSaveCaution_P_C.ExecuteUbergraph_AutoSaveCaution_P
// 0x0048 (0x0048 - 0x0000)
struct AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARCGameModeBase*                        K2Node_DynamicCast_AsRCGame_Mode_Base;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARCGameModeBase*                        K2Node_DynamicCast_AsRCGame_Mode_Base_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkip_ReturnValue;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHyoukaban_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Title_StartUp_AutoSave_C*          CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingFinishAnimation_ReturnValue;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P) == 0x000008, "Wrong alignment on AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P");
static_assert(sizeof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P) == 0x000048, "Wrong size on AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, EntryPoint) == 0x000000, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::EntryPoint' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, K2Node_DynamicCast_AsRCGame_Mode_Base) == 0x000010, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::K2Node_DynamicCast_AsRCGame_Mode_Base' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, CallFunc_GetGameMode_ReturnValue_1) == 0x000020, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, K2Node_DynamicCast_AsRCGame_Mode_Base_1) == 0x000028, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::K2Node_DynamicCast_AsRCGame_Mode_Base_1' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, CallFunc_IsSkip_ReturnValue) == 0x000031, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::CallFunc_IsSkip_ReturnValue' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, CallFunc_IsHyoukaban_ReturnValue) == 0x000032, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::CallFunc_IsHyoukaban_ReturnValue' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, CallFunc_Create_ReturnValue) == 0x000038, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P, CallFunc_IsPlayingFinishAnimation_ReturnValue) == 0x000040, "Member 'AutoSaveCaution_P_C_ExecuteUbergraph_AutoSaveCaution_P::CallFunc_IsPlayingFinishAnimation_ReturnValue' has a wrong offset!");

}

