#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoSaveCaution_P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AutoSaveCaution_P.AutoSaveCaution_P_C
// 0x0020 (0x03C0 - 0x03A0)
class AAutoSaveCaution_P_C final : public ARCBgLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URCStartupAutoSave*                     AutoSaveWidget;                                    // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         skippableTime;                                     // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTime;                                          // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFinish;                                          // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTick;                                            // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_AutoSaveCaution_P(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AutoSaveCaution_P_C">();
	}
	static class AAutoSaveCaution_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAutoSaveCaution_P_C>();
	}
};
static_assert(alignof(AAutoSaveCaution_P_C) == 0x000008, "Wrong alignment on AAutoSaveCaution_P_C");
static_assert(sizeof(AAutoSaveCaution_P_C) == 0x0003C0, "Wrong size on AAutoSaveCaution_P_C");
static_assert(offsetof(AAutoSaveCaution_P_C, UberGraphFrame) == 0x0003A0, "Member 'AAutoSaveCaution_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAutoSaveCaution_P_C, AutoSaveWidget) == 0x0003A8, "Member 'AAutoSaveCaution_P_C::AutoSaveWidget' has a wrong offset!");
static_assert(offsetof(AAutoSaveCaution_P_C, skippableTime) == 0x0003B0, "Member 'AAutoSaveCaution_P_C::skippableTime' has a wrong offset!");
static_assert(offsetof(AAutoSaveCaution_P_C, FadeTime) == 0x0003B4, "Member 'AAutoSaveCaution_P_C::FadeTime' has a wrong offset!");
static_assert(offsetof(AAutoSaveCaution_P_C, isFinish) == 0x0003B8, "Member 'AAutoSaveCaution_P_C::isFinish' has a wrong offset!");
static_assert(offsetof(AAutoSaveCaution_P_C, IsTick) == 0x0003B9, "Member 'AAutoSaveCaution_P_C::IsTick' has a wrong offset!");

}

