#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Attach199

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Attach199.BP_Attach199_C
// 0x0018 (0x02B0 - 0x0298)
class ABP_Attach199_C final : public ARCAttachmentActor
{
public:
	class URCAttachmentAnimCtrl*                  RCAttachmentAnimCtrl;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Attach199;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Attach199_C">();
	}
	static class ABP_Attach199_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Attach199_C>();
	}
};
static_assert(alignof(ABP_Attach199_C) == 0x000008, "Wrong alignment on ABP_Attach199_C");
static_assert(sizeof(ABP_Attach199_C) == 0x0002B0, "Wrong size on ABP_Attach199_C");
static_assert(offsetof(ABP_Attach199_C, RCAttachmentAnimCtrl) == 0x000298, "Member 'ABP_Attach199_C::RCAttachmentAnimCtrl' has a wrong offset!");
static_assert(offsetof(ABP_Attach199_C, SK_Attach199) == 0x0002A0, "Member 'ABP_Attach199_C::SK_Attach199' has a wrong offset!");
static_assert(offsetof(ABP_Attach199_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_Attach199_C::DefaultSceneRoot' has a wrong offset!");

}

