#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BG_StopShaderTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BG_StopShaderTime.BP_BG_StopShaderTime_C
// 0x0020 (0x0240 - 0x0220)
class ABP_BG_StopShaderTime_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   MPCParamName;                                      // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BGPauseFlag;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BGPauseTime;                                       // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_BG_StopShaderTime(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BG_StopShaderTime_C">();
	}
	static class ABP_BG_StopShaderTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BG_StopShaderTime_C>();
	}
};
static_assert(alignof(ABP_BG_StopShaderTime_C) == 0x000008, "Wrong alignment on ABP_BG_StopShaderTime_C");
static_assert(sizeof(ABP_BG_StopShaderTime_C) == 0x000240, "Wrong size on ABP_BG_StopShaderTime_C");
static_assert(offsetof(ABP_BG_StopShaderTime_C, UberGraphFrame) == 0x000220, "Member 'ABP_BG_StopShaderTime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BG_StopShaderTime_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_BG_StopShaderTime_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BG_StopShaderTime_C, MPCParamName) == 0x000230, "Member 'ABP_BG_StopShaderTime_C::MPCParamName' has a wrong offset!");
static_assert(offsetof(ABP_BG_StopShaderTime_C, BGPauseFlag) == 0x000238, "Member 'ABP_BG_StopShaderTime_C::BGPauseFlag' has a wrong offset!");
static_assert(offsetof(ABP_BG_StopShaderTime_C, BGPauseTime) == 0x00023C, "Member 'ABP_BG_StopShaderTime_C::BGPauseTime' has a wrong offset!");

}

