#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BG_EmissiveLightSetSync

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BG_EmissiveLightSetSync.BP_BG_EmissiveLightSetSync_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_BG_EmissiveLightSetSync_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BG_EmissiveLightSetSync_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_BG_EmissiveLightSetSync_C_UserConstructionScript");
static_assert(sizeof(BP_BG_EmissiveLightSetSync_C_UserConstructionScript) == 0x000010, "Wrong size on BP_BG_EmissiveLightSetSync_C_UserConstructionScript");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_BG_EmissiveLightSetSync_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_BG_EmissiveLightSetSync_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_BG_EmissiveLightSetSync.BP_BG_EmissiveLightSetSync_C.ExecuteUbergraph_BP_BG_EmissiveLightSetSync
// 0x0100 (0x0100 - 0x0000)
struct BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASpotLight*>                     CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0050(0x0010)(ReferenceParm)
	TArray<class APointLight*>                    CallFunc_GetAllActorsOfClassWithTag_OutActors_1;   // 0x0060(0x0010)(ReferenceParm)
	class ALight*                                 CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BG_StopShaderTime_C*                CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Identical_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BG_StopShaderTime_C*>        CallFunc_GetAllActorsOfClassWithTag_OutActors_2;   // 0x00E0(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync) == 0x000008, "Wrong alignment on BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync");
static_assert(sizeof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync) == 0x000100, "Wrong size on BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, EntryPoint) == 0x000000, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_R) == 0x00000C, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_G) == 0x000010, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_B) == 0x000014, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_A) == 0x000018, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Lerp_ReturnValue) == 0x00001C, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_MakeColor_ReturnValue) == 0x000020, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_IsValid_ReturnValue_3) == 0x000045, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000050, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_GetAllActorsOfClassWithTag_OutActors_1) == 0x000060, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_GetAllActorsOfClassWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000088, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_Add_ReturnValue_1) == 0x00008C, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000094, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_R_1) == 0x0000A4, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_G_1) == 0x0000A8, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_B_1) == 0x0000AC, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_BreakColor_A_1) == 0x0000B0, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_BreakColor_A_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000B4, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Array_Identical_ReturnValue) == 0x0000B8, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Array_Identical_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000CC, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_GetAllActorsOfClassWithTag_OutActors_2) == 0x0000E0, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_GetAllActorsOfClassWithTag_OutActors_2' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000F0, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000F4, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BP_BG_EmissiveLightSetSync_C_ExecuteUbergraph_BP_BG_EmissiveLightSetSync::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

