#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BG_AnimRotation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BG_AnimRotation.BP_BG_AnimRotation_C.ExecuteUbergraph_BP_BG_AnimRotation
// 0x04D8 (0x04D8 - 0x0000)
struct BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   CallFunc_GetEventName_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default;                             // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult_1; // 0x014C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult_2; // 0x01E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult_3; // 0x0268(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult_4; // 0x02F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult_5; // 0x037C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_5;                      // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_5;                     // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_5;                       // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_8;             // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default_1;                           // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_2;                      // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult_6; // 0x044C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation) == 0x000008, "Wrong alignment on BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation");
static_assert(sizeof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation) == 0x0004D8, "Wrong size on BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, EntryPoint) == 0x000000, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, Temp_bool_Variable) == 0x000004, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, Temp_bool_Variable_1) == 0x000005, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x000018, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_GetEventName_ReturnValue) == 0x0000A0, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_GetEventName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Conv_NameToString_ReturnValue) == 0x0000A8, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, K2Node_SwitchName_CmpSuccess) == 0x0000B8, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000D0, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, K2Node_Select_Default) == 0x0000D4, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Roll) == 0x0000E0, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Pitch) == 0x0000E4, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Yaw) == 0x0000E8, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Roll_1) == 0x0000EC, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Pitch_1) == 0x0000F0, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Yaw_1) == 0x0000F4, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Roll_2) == 0x0000F8, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Pitch_2) == 0x0000FC, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Yaw_2) == 0x000100, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000104, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000108, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00010C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_MakeRotator_ReturnValue) == 0x000110, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Roll_3) == 0x00011C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Pitch_3) == 0x000120, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Yaw_3) == 0x000124, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000128, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x00012C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000130, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_MakeRotator_ReturnValue_1) == 0x000134, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_RLerp_ReturnValue) == 0x000140, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult_1) == 0x00014C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_RLerp_ReturnValue_1) == 0x0001D4, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_RLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult_2) == 0x0001E0, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult_3) == 0x000268, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult_4) == 0x0002F0, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000378, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult_5) == 0x00037C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Roll_4) == 0x000404, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Roll_4' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Pitch_4) == 0x000408, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Pitch_4' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Yaw_4) == 0x00040C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Yaw_4' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Roll_5) == 0x000410, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Roll_5' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Pitch_5) == 0x000414, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Pitch_5' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_BreakRotator_Yaw_5) == 0x000418, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_BreakRotator_Yaw_5' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x00041C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x000420, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_Add_FloatFloat_ReturnValue_8) == 0x000424, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_Add_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_MakeRotator_ReturnValue_2) == 0x000428, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, K2Node_Select_Default_1) == 0x000434, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_RLerp_ReturnValue_2) == 0x000440, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_RLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation, CallFunc_K2_SetActorRelativeRotation_SweepHitResult_6) == 0x00044C, "Member 'BP_BG_AnimRotation_C_ExecuteUbergraph_BP_BG_AnimRotation::CallFunc_K2_SetActorRelativeRotation_SweepHitResult_6' has a wrong offset!");

// Function BP_BG_AnimRotation.BP_BG_AnimRotation_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct BP_BG_AnimRotation_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BG_AnimRotation_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_BG_AnimRotation_C_UserConstructionScript");
static_assert(sizeof(BP_BG_AnimRotation_C_UserConstructionScript) == 0x000060, "Wrong size on BP_BG_AnimRotation_C_UserConstructionScript");
static_assert(offsetof(BP_BG_AnimRotation_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue) == 0x000000, "Member 'BP_BG_AnimRotation_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000030, "Member 'BP_BG_AnimRotation_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x00003C, "Member 'BP_BG_AnimRotation_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BG_AnimRotation_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'BP_BG_AnimRotation_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");

}

