#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CmnEventRoot

#include "Basic.hpp"

#include "CmnEventData_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CmnEventRoot.BP_CmnEventRoot_C
// 0x01A8 (0x0430 - 0x0288)
class ABP_CmnEventRoot_C final : public ARCActor
{
public:
	class UArrowComponent*                        Arrow;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FCMNEventData                          CMNEventData;                                      // 0x02A0(0x0188)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CMN_____________________;                          // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CmnEventRoot_C">();
	}
	static class ABP_CmnEventRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CmnEventRoot_C>();
	}
};
static_assert(alignof(ABP_CmnEventRoot_C) == 0x000008, "Wrong alignment on ABP_CmnEventRoot_C");
static_assert(sizeof(ABP_CmnEventRoot_C) == 0x000430, "Wrong size on ABP_CmnEventRoot_C");
static_assert(offsetof(ABP_CmnEventRoot_C, Arrow) == 0x000288, "Member 'ABP_CmnEventRoot_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_CmnEventRoot_C, TextRender) == 0x000290, "Member 'ABP_CmnEventRoot_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_CmnEventRoot_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_CmnEventRoot_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CmnEventRoot_C, CMNEventData) == 0x0002A0, "Member 'ABP_CmnEventRoot_C::CMNEventData' has a wrong offset!");
static_assert(offsetof(ABP_CmnEventRoot_C, CMN_____________________) == 0x000428, "Member 'ABP_CmnEventRoot_C::CMN_____________________' has a wrong offset!");

}

