#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chr00001

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Chr00001.BP_Chr00001_C.ExecuteUbergraph_BP_Chr00001
// 0x0018 (0x0018 - 0x0000)
struct BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Construction;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ToonScene_C*                        K2Node_Event_Scane;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001) == 0x000008, "Wrong alignment on BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001");
static_assert(sizeof(BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001) == 0x000018, "Wrong size on BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001");
static_assert(offsetof(BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001, EntryPoint) == 0x000000, "Member 'BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001, K2Node_Event_Construction) == 0x000004, "Member 'BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001::K2Node_Event_Construction' has a wrong offset!");
static_assert(offsetof(BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001, K2Node_Event_Scane) == 0x000008, "Member 'BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001::K2Node_Event_Scane' has a wrong offset!");
static_assert(offsetof(BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_Chr00001_C_ExecuteUbergraph_BP_Chr00001::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_Chr00001.BP_Chr00001_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Chr00001_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chr00001_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Chr00001_C_ReceiveTick");
static_assert(sizeof(BP_Chr00001_C_ReceiveTick) == 0x000004, "Wrong size on BP_Chr00001_C_ReceiveTick");
static_assert(offsetof(BP_Chr00001_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Chr00001_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Chr00001.BP_Chr00001_C.IToonShading
// 0x0010 (0x0010 - 0x0000)
struct BP_Chr00001_C_IToonShading final
{
public:
	bool                                          Construction;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ToonScene_C*                        Scane;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chr00001_C_IToonShading) == 0x000008, "Wrong alignment on BP_Chr00001_C_IToonShading");
static_assert(sizeof(BP_Chr00001_C_IToonShading) == 0x000010, "Wrong size on BP_Chr00001_C_IToonShading");
static_assert(offsetof(BP_Chr00001_C_IToonShading, Construction) == 0x000000, "Member 'BP_Chr00001_C_IToonShading::Construction' has a wrong offset!");
static_assert(offsetof(BP_Chr00001_C_IToonShading, Scane) == 0x000008, "Member 'BP_Chr00001_C_IToonShading::Scane' has a wrong offset!");

// Function BP_Chr00001.BP_Chr00001_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_Chr00001_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chr00001_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Chr00001_C_UserConstructionScript");
static_assert(sizeof(BP_Chr00001_C_UserConstructionScript) == 0x000010, "Wrong size on BP_Chr00001_C_UserConstructionScript");
static_assert(offsetof(BP_Chr00001_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Chr00001_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chr00001_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_Chr00001_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

