#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mob91

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mob91.BP_Mob91_C.ExecuteUbergraph_BP_Mob91
// 0x0060 (0x0060 - 0x0000)
struct BP_Mob91_C_ExecuteUbergraph_BP_Mob91 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetKakiwariMotionIndex_ReturnValue;       // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91) == 0x000010, "Wrong alignment on BP_Mob91_C_ExecuteUbergraph_BP_Mob91");
static_assert(sizeof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91) == 0x000060, "Wrong size on BP_Mob91_C_ExecuteUbergraph_BP_Mob91");
static_assert(offsetof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91, EntryPoint) == 0x000000, "Member 'BP_Mob91_C_ExecuteUbergraph_BP_Mob91::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Mob91_C_ExecuteUbergraph_BP_Mob91::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91, CallFunc_GetKakiwariMotionIndex_ReturnValue) == 0x000008, "Member 'BP_Mob91_C_ExecuteUbergraph_BP_Mob91::CallFunc_GetKakiwariMotionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'BP_Mob91_C_ExecuteUbergraph_BP_Mob91::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_Mob91_C_ExecuteUbergraph_BP_Mob91::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mob91_C_ExecuteUbergraph_BP_Mob91, CallFunc_UpdateInstanceTransform_ReturnValue) == 0x000050, "Member 'BP_Mob91_C_ExecuteUbergraph_BP_Mob91::CallFunc_UpdateInstanceTransform_ReturnValue' has a wrong offset!");

// Function BP_Mob91.BP_Mob91_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mob91_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mob91_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mob91_C_ReceiveTick");
static_assert(sizeof(BP_Mob91_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mob91_C_ReceiveTick");
static_assert(offsetof(BP_Mob91_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mob91_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

