#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mob91

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mob91.BP_Mob91_C
// 0x0018 (0x02F8 - 0x02E0)
class ABP_Mob91_C final : public ARCKakiwariRender
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mob91(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mob91_C">();
	}
	static class ABP_Mob91_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mob91_C>();
	}
};
static_assert(alignof(ABP_Mob91_C) == 0x000008, "Wrong alignment on ABP_Mob91_C");
static_assert(sizeof(ABP_Mob91_C) == 0x0002F8, "Wrong size on ABP_Mob91_C");
static_assert(offsetof(ABP_Mob91_C, UberGraphFrame) == 0x0002E0, "Member 'ABP_Mob91_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mob91_C, InstancedStaticMesh) == 0x0002E8, "Member 'ABP_Mob91_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mob91_C, DefaultSceneRoot) == 0x0002F0, "Member 'ABP_Mob91_C::DefaultSceneRoot' has a wrong offset!");

}

