#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mob01_00

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Mob01_00.BP_Mob01_00_C.ExecuteUbergraph_BP_Mob01_00
// 0x0010 (0x0010 - 0x0000)
struct BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Construction;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ToonScene_C*                        K2Node_Event_Scane;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00) == 0x000008, "Wrong alignment on BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00");
static_assert(sizeof(BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00) == 0x000010, "Wrong size on BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00");
static_assert(offsetof(BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00, EntryPoint) == 0x000000, "Member 'BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00, K2Node_Event_Construction) == 0x000004, "Member 'BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00::K2Node_Event_Construction' has a wrong offset!");
static_assert(offsetof(BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00, K2Node_Event_Scane) == 0x000008, "Member 'BP_Mob01_00_C_ExecuteUbergraph_BP_Mob01_00::K2Node_Event_Scane' has a wrong offset!");

// Function BP_Mob01_00.BP_Mob01_00_C.IToonShading
// 0x0010 (0x0010 - 0x0000)
struct BP_Mob01_00_C_IToonShading final
{
public:
	bool                                          Construction;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ToonScene_C*                        Scane;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mob01_00_C_IToonShading) == 0x000008, "Wrong alignment on BP_Mob01_00_C_IToonShading");
static_assert(sizeof(BP_Mob01_00_C_IToonShading) == 0x000010, "Wrong size on BP_Mob01_00_C_IToonShading");
static_assert(offsetof(BP_Mob01_00_C_IToonShading, Construction) == 0x000000, "Member 'BP_Mob01_00_C_IToonShading::Construction' has a wrong offset!");
static_assert(offsetof(BP_Mob01_00_C_IToonShading, Scane) == 0x000008, "Member 'BP_Mob01_00_C_IToonShading::Scane' has a wrong offset!");

}

