#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RCcinecamera

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RCcinecamera.BP_RCcinecamera_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_RCcinecamera_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0018)()
};
static_assert(alignof(BP_RCcinecamera_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_RCcinecamera_C_UserConstructionScript");
static_assert(sizeof(BP_RCcinecamera_C_UserConstructionScript) == 0x000050, "Wrong size on BP_RCcinecamera_C_UserConstructionScript");
static_assert(offsetof(BP_RCcinecamera_C_UserConstructionScript, CallFunc_Conv_IntToString_ReturnValue) == 0x000000, "Member 'BP_RCcinecamera_C_UserConstructionScript::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'BP_RCcinecamera_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_RCcinecamera_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_C_UserConstructionScript, CallFunc_MakeLiteralText_ReturnValue) == 0x000038, "Member 'BP_RCcinecamera_C_UserConstructionScript::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

}

