#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RCcinecamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RCcinecamera.BP_RCcinecamera_C
// 0x0010 (0x0830 - 0x0820)
class ABP_RCcinecamera_C : public ARCCineCameraActor
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 TextColor;                                         // 0x0828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number;                                            // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RCcinecamera_C">();
	}
	static class ABP_RCcinecamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RCcinecamera_C>();
	}
};
static_assert(alignof(ABP_RCcinecamera_C) == 0x000010, "Wrong alignment on ABP_RCcinecamera_C");
static_assert(sizeof(ABP_RCcinecamera_C) == 0x000830, "Wrong size on ABP_RCcinecamera_C");
static_assert(offsetof(ABP_RCcinecamera_C, TextRender) == 0x000820, "Member 'ABP_RCcinecamera_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_RCcinecamera_C, TextColor) == 0x000828, "Member 'ABP_RCcinecamera_C::TextColor' has a wrong offset!");
static_assert(offsetof(ABP_RCcinecamera_C, Number) == 0x00082C, "Member 'ABP_RCcinecamera_C::Number' has a wrong offset!");

}

