#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RCcinecamera_portrait

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RCcinecamera_portrait.BP_RCcinecamera_portrait_C.ExecuteUbergraph_BP_RCcinecamera_portrait
// 0x00C0 (0x00C0 - 0x0000)
struct BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	bool                                          CallFunc_CheckInitialized_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLoadComplete_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARCPlayerController*                    K2Node_DynamicCast_AsRCPlayer_Controller;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReady_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0090(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00A8(0x0018)()
};
static_assert(alignof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait) == 0x000008, "Wrong alignment on BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait");
static_assert(sizeof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait) == 0x0000C0, "Wrong size on BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, EntryPoint) == 0x000000, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_CheckInitialized_ReturnValue) == 0x000038, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_CheckInitialized_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_IsLoadComplete_ReturnValue) == 0x000039, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_IsLoadComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, K2Node_DynamicCast_AsRCPlayer_Controller) == 0x000048, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::K2Node_DynamicCast_AsRCPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_IsReady_ReturnValue) == 0x000051, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_IsReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, K2Node_Event_OtherActor) == 0x000058, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, K2Node_CustomEvent_Visible) == 0x000060, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000062, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_GetText_ReturnValue_1) == 0x000068, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_MakeLiteralText_ReturnValue) == 0x000090, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000A8, "Member 'BP_RCcinecamera_portrait_C_ExecuteUbergraph_BP_RCcinecamera_portrait::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");

// Function BP_RCcinecamera_portrait.BP_RCcinecamera_portrait_C.名前の表示切り替え
// 0x0001 (0x0001 - 0x0000)
struct BP_RCcinecamera_portrait_C_m__________________________ final
{
public:
	bool                                          visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RCcinecamera_portrait_C_m__________________________) == 0x000001, "Wrong alignment on BP_RCcinecamera_portrait_C_m__________________________");
static_assert(sizeof(BP_RCcinecamera_portrait_C_m__________________________) == 0x000001, "Wrong size on BP_RCcinecamera_portrait_C_m__________________________");
static_assert(offsetof(BP_RCcinecamera_portrait_C_m__________________________, visible) == 0x000000, "Member 'BP_RCcinecamera_portrait_C_m__________________________::visible' has a wrong offset!");

// Function BP_RCcinecamera_portrait.BP_RCcinecamera_portrait_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_RCcinecamera_portrait_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RCcinecamera_portrait_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_RCcinecamera_portrait_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_RCcinecamera_portrait_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_RCcinecamera_portrait_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_RCcinecamera_portrait_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_RCcinecamera_portrait_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

