#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToonComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ToonComponent.BP_ToonComponent_C.ApplyShading
// 0x0070 (0x0070 - 0x0000)
struct BP_ToonComponent_C_ApplyShading final
{
public:
	bool                                          Construction;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ToonScene_C*                        ActorScene;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToonComponent_C_ApplyShading) == 0x000008, "Wrong alignment on BP_ToonComponent_C_ApplyShading");
static_assert(sizeof(BP_ToonComponent_C_ApplyShading) == 0x000070, "Wrong size on BP_ToonComponent_C_ApplyShading");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, Construction) == 0x000000, "Member 'BP_ToonComponent_C_ApplyShading::Construction' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, Mesh) == 0x000008, "Member 'BP_ToonComponent_C_ApplyShading::Mesh' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, ActorScene) == 0x000010, "Member 'BP_ToonComponent_C_ApplyShading::ActorScene' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_IsValid_ReturnValue_1) == 0x000025, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_GetComponentBounds_Origin) == 0x000028, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_GetComponentBounds_BoxExtent) == 0x000034, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_GetComponentBounds_SphereRadius) == 0x000040, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000044, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'BP_ToonComponent_C_ApplyShading::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_ApplyShading, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_ToonComponent_C_ApplyShading::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_ToonComponent.BP_ToonComponent_C.CreateMaterials
// 0x0020 (0x0020 - 0x0000)
struct BP_ToonComponent_C_CreateMaterials final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ToonComponent_C_CreateMaterials) == 0x000008, "Wrong alignment on BP_ToonComponent_C_CreateMaterials");
static_assert(sizeof(BP_ToonComponent_C_CreateMaterials) == 0x000020, "Wrong size on BP_ToonComponent_C_CreateMaterials");
static_assert(offsetof(BP_ToonComponent_C_CreateMaterials, Mesh) == 0x000000, "Member 'BP_ToonComponent_C_CreateMaterials::Mesh' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_CreateMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_ToonComponent_C_CreateMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_CreateMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x000010, "Member 'BP_ToonComponent_C_CreateMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_CreateMaterials, Temp_int_Variable) == 0x000014, "Member 'BP_ToonComponent_C_CreateMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_CreateMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ToonComponent_C_CreateMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_CreateMaterials, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ToonComponent_C_CreateMaterials::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ToonComponent.BP_ToonComponent_C.InitStaticShell
// 0x0058 (0x0058 - 0x0000)
struct BP_ToonComponent_C_InitStaticShell final
{
public:
	class UStaticMeshComponent*                   Shell;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ToonComponent_C_InitStaticShell) == 0x000008, "Wrong alignment on BP_ToonComponent_C_InitStaticShell");
static_assert(sizeof(BP_ToonComponent_C_InitStaticShell) == 0x000058, "Wrong size on BP_ToonComponent_C_InitStaticShell");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, Shell) == 0x000000, "Member 'BP_ToonComponent_C_InitStaticShell::Shell' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, Color) == 0x000008, "Member 'BP_ToonComponent_C_InitStaticShell::Color' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000018, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_GetNumMaterials_ReturnValue) == 0x000028, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, Temp_int_Variable) == 0x000030, "Member 'BP_ToonComponent_C_InitStaticShell::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_Map_Find_Value) == 0x000038, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitStaticShell, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_ToonComponent_C_InitStaticShell::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ToonComponent.BP_ToonComponent_C.InitSkeletalShell
// 0x0078 (0x0078 - 0x0000)
struct BP_ToonComponent_C_InitSkeletalShell final
{
public:
	class USkeletalMeshComponent*                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Shell;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              CallFunc_Map_Find_Value;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ToonComponent_C_InitSkeletalShell) == 0x000008, "Wrong alignment on BP_ToonComponent_C_InitSkeletalShell");
static_assert(sizeof(BP_ToonComponent_C_InitSkeletalShell) == 0x000078, "Wrong size on BP_ToonComponent_C_InitSkeletalShell");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, Source) == 0x000000, "Member 'BP_ToonComponent_C_InitSkeletalShell::Source' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, Shell) == 0x000008, "Member 'BP_ToonComponent_C_InitSkeletalShell::Shell' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, Color) == 0x000010, "Member 'BP_ToonComponent_C_InitSkeletalShell::Color' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000020, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_GetNumMaterials_ReturnValue) == 0x000034, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, Temp_int_Variable) == 0x00003C, "Member 'BP_ToonComponent_C_InitSkeletalShell::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Conv_NameToString_ReturnValue) == 0x000050, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Contains_ReturnValue) == 0x000061, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Map_Find_Value) == 0x000068, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_InitSkeletalShell, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'BP_ToonComponent_C_InitSkeletalShell::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_ToonComponent.BP_ToonComponent_C.SetShellColor
// 0x0028 (0x0028 - 0x0000)
struct BP_ToonComponent_C_SetShellColor final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShellColor;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToonComponent_C_SetShellColor) == 0x000008, "Wrong alignment on BP_ToonComponent_C_SetShellColor");
static_assert(sizeof(BP_ToonComponent_C_SetShellColor) == 0x000028, "Wrong size on BP_ToonComponent_C_SetShellColor");
static_assert(offsetof(BP_ToonComponent_C_SetShellColor, Mesh) == 0x000000, "Member 'BP_ToonComponent_C_SetShellColor::Mesh' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_SetShellColor, ShellColor) == 0x000008, "Member 'BP_ToonComponent_C_SetShellColor::ShellColor' has a wrong offset!");
static_assert(offsetof(BP_ToonComponent_C_SetShellColor, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000018, "Member 'BP_ToonComponent_C_SetShellColor::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

}

