#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToonShadingLightDirection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ToonShadingLightDirection.BP_ToonShadingLightDirection_C
// 0x0018 (0x0238 - 0x0220)
class ABP_ToonShadingLightDirection_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Light_Source_Actor;                                // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_ToonShadingLightDirection(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ToonShadingLightDirection_C">();
	}
	static class ABP_ToonShadingLightDirection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ToonShadingLightDirection_C>();
	}
};
static_assert(alignof(ABP_ToonShadingLightDirection_C) == 0x000008, "Wrong alignment on ABP_ToonShadingLightDirection_C");
static_assert(sizeof(ABP_ToonShadingLightDirection_C) == 0x000238, "Wrong size on ABP_ToonShadingLightDirection_C");
static_assert(offsetof(ABP_ToonShadingLightDirection_C, UberGraphFrame) == 0x000220, "Member 'ABP_ToonShadingLightDirection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ToonShadingLightDirection_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_ToonShadingLightDirection_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ToonShadingLightDirection_C, Light_Source_Actor) == 0x000230, "Member 'ABP_ToonShadingLightDirection_C::Light_Source_Actor' has a wrong offset!");

}

