#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToonPointLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ToonPointLight.BP_ToonPointLight_C
// 0x0050 (0x0270 - 0x0220)
class ABP_ToonPointLight_C final : public AActor
{
public:
	class UStaticMeshComponent*                   BillboardMesh;                                     // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_ToonScene_C*                        Scene;                                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor;                                        // 0x0244(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShadowColor;                                       // 0x0254(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseLightWeight;                                   // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseShadwWeight;                                   // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ChangeScene(class ABP_ToonScene_C* NewScene);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ToonPointLight_C">();
	}
	static class ABP_ToonPointLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ToonPointLight_C>();
	}
};
static_assert(alignof(ABP_ToonPointLight_C) == 0x000008, "Wrong alignment on ABP_ToonPointLight_C");
static_assert(sizeof(ABP_ToonPointLight_C) == 0x000270, "Wrong size on ABP_ToonPointLight_C");
static_assert(offsetof(ABP_ToonPointLight_C, BillboardMesh) == 0x000220, "Member 'ABP_ToonPointLight_C::BillboardMesh' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, Billboard) == 0x000228, "Member 'ABP_ToonPointLight_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_ToonPointLight_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, Scene) == 0x000238, "Member 'ABP_ToonPointLight_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, Intensity) == 0x000240, "Member 'ABP_ToonPointLight_C::Intensity' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, LightColor) == 0x000244, "Member 'ABP_ToonPointLight_C::LightColor' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, ShadowColor) == 0x000254, "Member 'ABP_ToonPointLight_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, BaseLightWeight) == 0x000264, "Member 'ABP_ToonPointLight_C::BaseLightWeight' has a wrong offset!");
static_assert(offsetof(ABP_ToonPointLight_C, BaseShadwWeight) == 0x000268, "Member 'ABP_ToonPointLight_C::BaseShadwWeight' has a wrong offset!");

}

