#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToonShadingLightDirection

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ToonShadingLightDirection.BP_ToonShadingLightDirection_C.UserConstructionScript
// 0x001C (0x001C - 0x0000)
struct BP_ToonShadingLightDirection_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToonShadingLightDirection_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_ToonShadingLightDirection_C_UserConstructionScript");
static_assert(sizeof(BP_ToonShadingLightDirection_C_UserConstructionScript) == 0x00001C, "Wrong size on BP_ToonShadingLightDirection_C_UserConstructionScript");
static_assert(offsetof(BP_ToonShadingLightDirection_C_UserConstructionScript, CallFunc_GetActorForwardVector_ReturnValue) == 0x000000, "Member 'BP_ToonShadingLightDirection_C_UserConstructionScript::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonShadingLightDirection_C_UserConstructionScript, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_ToonShadingLightDirection_C_UserConstructionScript::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_ToonShadingLightDirection.BP_ToonShadingLightDirection_C.ExecuteUbergraph_BP_ToonShadingLightDirection
// 0x0020 (0x0020 - 0x0000)
struct BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection) == 0x000004, "Wrong alignment on BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection");
static_assert(sizeof(BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection) == 0x000020, "Wrong size on BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection");
static_assert(offsetof(BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection, EntryPoint) == 0x000000, "Member 'BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection, CallFunc_GetActorForwardVector_ReturnValue) == 0x000004, "Member 'BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000010, "Member 'BP_ToonShadingLightDirection_C_ExecuteUbergraph_BP_ToonShadingLightDirection::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

}

