#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TargetPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TargetPoint.BP_TargetPoint_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BP_TargetPoint_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(BP_TargetPoint_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_TargetPoint_C_UserConstructionScript");
static_assert(sizeof(BP_TargetPoint_C_UserConstructionScript) == 0x000030, "Wrong size on BP_TargetPoint_C_UserConstructionScript");
static_assert(offsetof(BP_TargetPoint_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_TargetPoint_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetPoint_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_TargetPoint_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetPoint_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_TargetPoint_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

