#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Caution_P

#include "Basic.hpp"

#include "RC_structs.hpp"


namespace SDK::Params
{

// Function Caution_P.Caution_P_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Caution_P_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Caution_P_C_ReceiveTick) == 0x000004, "Wrong alignment on Caution_P_C_ReceiveTick");
static_assert(sizeof(Caution_P_C_ReceiveTick) == 0x000004, "Wrong size on Caution_P_C_ReceiveTick");
static_assert(offsetof(Caution_P_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Caution_P_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Caution_P.Caution_P_C.ゲーム終了を知らせる汎用ウインドウが閉じたときのイベント
// 0x0001 (0x0001 - 0x0000)
struct Caution_P_C_m___________________________________________________________________________________ final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Caution_P_C_m___________________________________________________________________________________) == 0x000001, "Wrong alignment on Caution_P_C_m___________________________________________________________________________________");
static_assert(sizeof(Caution_P_C_m___________________________________________________________________________________) == 0x000001, "Wrong size on Caution_P_C_m___________________________________________________________________________________");
static_assert(offsetof(Caution_P_C_m___________________________________________________________________________________, bResult) == 0x000000, "Member 'Caution_P_C_m___________________________________________________________________________________::bResult' has a wrong offset!");

// Function Caution_P.Caution_P_C.ExecuteUbergraph_Caution_P
// 0x0098 (0x0098 - 0x0000)
struct Caution_P_C_ExecuteUbergraph_Caution_P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkip_ReturnValue;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARCGameModeBase*                        K2Node_DynamicCast_AsRCGame_Mode_Base;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingFinishAnimation_ReturnValue;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdjustWindow_000_C*                CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResult;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URCGameInstance*                        K2Node_DynamicCast_AsRCGame_Instance;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRCPlatformUserInterface> CallFunc_GetPlatformUser_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	ERCLoginStatus                                CallFunc_GetLoginStatus_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToPlayerScreen_ReturnValue;            // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Title_StartUp_Caution_C*           CallFunc_Create_ReturnValue_1;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Caution_P_C_ExecuteUbergraph_Caution_P) == 0x000008, "Wrong alignment on Caution_P_C_ExecuteUbergraph_Caution_P");
static_assert(sizeof(Caution_P_C_ExecuteUbergraph_Caution_P) == 0x000098, "Wrong size on Caution_P_C_ExecuteUbergraph_Caution_P");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, EntryPoint) == 0x000000, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::EntryPoint' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_IsSkip_ReturnValue) == 0x000010, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_IsSkip_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_DynamicCast_AsRCGame_Mode_Base) == 0x000018, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_DynamicCast_AsRCGame_Mode_Base' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_IsPlayingFinishAnimation_ReturnValue) == 0x000021, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_IsPlayingFinishAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_Create_ReturnValue) == 0x000028, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_CustomEvent_bResult) == 0x000030, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_CustomEvent_bResult' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_GetPlatformName_ReturnValue) == 0x000038, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000050, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_DynamicCast_AsRCGame_Instance) == 0x000058, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_DynamicCast_AsRCGame_Instance' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_GetPlatformUser_ReturnValue) == 0x000068, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_GetPlatformUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_GetLoginStatus_ReturnValue) == 0x000078, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_GetLoginStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_SwitchEnum_CmpSuccess) == 0x000079, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_AddToPlayerScreen_ReturnValue) == 0x00007A, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_AddToPlayerScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Caution_P_C_ExecuteUbergraph_Caution_P, CallFunc_Create_ReturnValue_1) == 0x000090, "Member 'Caution_P_C_ExecuteUbergraph_Caution_P::CallFunc_Create_ReturnValue_1' has a wrong offset!");

}

