#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Caution_P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Caution_P.Caution_P_C
// 0x0038 (0x02B8 - 0x0280)
class ACaution_P_C final : public ARCLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URCStartupCaution*                      CautionWidget;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         skippableTime;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTime;                                          // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFinish;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTick;                                            // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           m______________________________________TextID;     // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class URCUiGenericWindow*                     GenericWindow;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void m___________________________________________________________________________________(bool bResult);
	void ExecuteUbergraph_Caution_P(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Caution_P_C">();
	}
	static class ACaution_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaution_P_C>();
	}
};
static_assert(alignof(ACaution_P_C) == 0x000008, "Wrong alignment on ACaution_P_C");
static_assert(sizeof(ACaution_P_C) == 0x0002B8, "Wrong size on ACaution_P_C");
static_assert(offsetof(ACaution_P_C, UberGraphFrame) == 0x000280, "Member 'ACaution_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACaution_P_C, CautionWidget) == 0x000288, "Member 'ACaution_P_C::CautionWidget' has a wrong offset!");
static_assert(offsetof(ACaution_P_C, skippableTime) == 0x000290, "Member 'ACaution_P_C::skippableTime' has a wrong offset!");
static_assert(offsetof(ACaution_P_C, FadeTime) == 0x000294, "Member 'ACaution_P_C::FadeTime' has a wrong offset!");
static_assert(offsetof(ACaution_P_C, isFinish) == 0x000298, "Member 'ACaution_P_C::isFinish' has a wrong offset!");
static_assert(offsetof(ACaution_P_C, IsTick) == 0x000299, "Member 'ACaution_P_C::IsTick' has a wrong offset!");
static_assert(offsetof(ACaution_P_C, m______________________________________TextID) == 0x0002A0, "Member 'ACaution_P_C::m______________________________________TextID' has a wrong offset!");
static_assert(offsetof(ACaution_P_C, GenericWindow) == 0x0002B0, "Member 'ACaution_P_C::GenericWindow' has a wrong offset!");

}

