#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CmnEventData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct CmnEventData.CMNEventData
// 0x0188 (0x0188 - 0x0000)
struct FCMNEventData final
{
public:
	bool                                          DebugInfo_45_0FF5B7A94C166A12192920AE025E73B8;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             TalkDataTable_11_A4C348D04A6CB7CDC90211A07C8C2B5E; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipTalk_98_6F98262E40FDD73895292CBD88E5CD65;      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           TalkIDList_15_80AE438C4C5378AC292E5F847F4BA20C;    // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class ABP_RCcinecamera_C*>             CamList_52_9C56696A49FFA3482A6A50B3BBACE80B;       // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class FName, class FName>                CharaList_40_2CCF36104012997057FDF393D5CD5672;     // 0x0038(0x0050)(Edit, BlueprintVisible)
	TArray<class FName>                           LookCharaList_43_795C0D354FD45C5AD6B55D8933E0EE20; // 0x0088(0x0010)(Edit, BlueprintVisible)
	TArray<class ABP_WalkSpline_C*>               SplineList_60_670E94B441BE682CD79C75AEB3D3F38B;    // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_LookTarget_C*>               LookList_63_CAD1F0D94D6A777BB9EEF69A58369936;      // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class FName, class FName>                AttachObjList_77_2C5D00B84AF6EC4B4F2E5B824B972ABE; // 0x00B8(0x0050)(Edit, BlueprintVisible)
	TArray<class AActor*>                         ActorPositionList_85_30796A8B4FB02D429C8DF98BC0C62D30; // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ALight*>                         EventLightList_125_E5A226E14F1BA0E0FA53D8898AAEEF2B; // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Rain_28_4166920F4BD063B80D4E38882E36E913;          // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          VisibleCompanion_121_B46495FB4A14C9694832BD89DF845321; // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AutoStart_68_0AD2A00343386F8D9BF3709F7D85CD7A;     // 0x012A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SceneChange_70_53C99E79436A42FE38F493B96F8303D1;   // 0x012B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TestMode_2_0A22D5194B03EF3023E762A16307B0C2;       // 0x012C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EndFadeColor_48_C9945A84454C4E14CB408B9A65943108;  // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartFade_91_420B92FF4753E505E839239809C1E515;     // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndFade_93_CD2646324E9DA9849556658CD818D073;       // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndWhiteFade_127_D457BB6F49E3AF0530EF64B4999BFC90; // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ChapterVar_96_BD4ABE2F44A83D4236D52F8E03E3E09B;    // 0x014C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EventStartBgmStop_109_ECEEE8634FE5E8062CA2C9A2B30B8630; // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EventStartBgmID_110_6F2D68A5488068C569DE2E80A265283F; // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          EventStartBgmLoop_111_283CC6CA4E2A5A227E7201A97FD0F1DF; // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EventStartEnvStop_112_157697F5479CDFECEACC1BAA94A73F8C; // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EventStartEnvID_113_721E90C44B9FCFDA1BD94D8E45A40749; // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          EventStartEnvLoop_114_80511FEF40DA563C75A566BB8E51ADD2; // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EventEndBgmStop_117_3BF18A7A46467FEE664618A2EE63AF77; // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EventEndEnvStop_118_52C428B84C36637AFA705FBD7BB9C101; // 0x0182(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FCMNEventData) == 0x000008, "Wrong alignment on FCMNEventData");
static_assert(sizeof(FCMNEventData) == 0x000188, "Wrong size on FCMNEventData");
static_assert(offsetof(FCMNEventData, DebugInfo_45_0FF5B7A94C166A12192920AE025E73B8) == 0x000000, "Member 'FCMNEventData::DebugInfo_45_0FF5B7A94C166A12192920AE025E73B8' has a wrong offset!");
static_assert(offsetof(FCMNEventData, TalkDataTable_11_A4C348D04A6CB7CDC90211A07C8C2B5E) == 0x000008, "Member 'FCMNEventData::TalkDataTable_11_A4C348D04A6CB7CDC90211A07C8C2B5E' has a wrong offset!");
static_assert(offsetof(FCMNEventData, SkipTalk_98_6F98262E40FDD73895292CBD88E5CD65) == 0x000010, "Member 'FCMNEventData::SkipTalk_98_6F98262E40FDD73895292CBD88E5CD65' has a wrong offset!");
static_assert(offsetof(FCMNEventData, TalkIDList_15_80AE438C4C5378AC292E5F847F4BA20C) == 0x000018, "Member 'FCMNEventData::TalkIDList_15_80AE438C4C5378AC292E5F847F4BA20C' has a wrong offset!");
static_assert(offsetof(FCMNEventData, CamList_52_9C56696A49FFA3482A6A50B3BBACE80B) == 0x000028, "Member 'FCMNEventData::CamList_52_9C56696A49FFA3482A6A50B3BBACE80B' has a wrong offset!");
static_assert(offsetof(FCMNEventData, CharaList_40_2CCF36104012997057FDF393D5CD5672) == 0x000038, "Member 'FCMNEventData::CharaList_40_2CCF36104012997057FDF393D5CD5672' has a wrong offset!");
static_assert(offsetof(FCMNEventData, LookCharaList_43_795C0D354FD45C5AD6B55D8933E0EE20) == 0x000088, "Member 'FCMNEventData::LookCharaList_43_795C0D354FD45C5AD6B55D8933E0EE20' has a wrong offset!");
static_assert(offsetof(FCMNEventData, SplineList_60_670E94B441BE682CD79C75AEB3D3F38B) == 0x000098, "Member 'FCMNEventData::SplineList_60_670E94B441BE682CD79C75AEB3D3F38B' has a wrong offset!");
static_assert(offsetof(FCMNEventData, LookList_63_CAD1F0D94D6A777BB9EEF69A58369936) == 0x0000A8, "Member 'FCMNEventData::LookList_63_CAD1F0D94D6A777BB9EEF69A58369936' has a wrong offset!");
static_assert(offsetof(FCMNEventData, AttachObjList_77_2C5D00B84AF6EC4B4F2E5B824B972ABE) == 0x0000B8, "Member 'FCMNEventData::AttachObjList_77_2C5D00B84AF6EC4B4F2E5B824B972ABE' has a wrong offset!");
static_assert(offsetof(FCMNEventData, ActorPositionList_85_30796A8B4FB02D429C8DF98BC0C62D30) == 0x000108, "Member 'FCMNEventData::ActorPositionList_85_30796A8B4FB02D429C8DF98BC0C62D30' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventLightList_125_E5A226E14F1BA0E0FA53D8898AAEEF2B) == 0x000118, "Member 'FCMNEventData::EventLightList_125_E5A226E14F1BA0E0FA53D8898AAEEF2B' has a wrong offset!");
static_assert(offsetof(FCMNEventData, Rain_28_4166920F4BD063B80D4E38882E36E913) == 0x000128, "Member 'FCMNEventData::Rain_28_4166920F4BD063B80D4E38882E36E913' has a wrong offset!");
static_assert(offsetof(FCMNEventData, VisibleCompanion_121_B46495FB4A14C9694832BD89DF845321) == 0x000129, "Member 'FCMNEventData::VisibleCompanion_121_B46495FB4A14C9694832BD89DF845321' has a wrong offset!");
static_assert(offsetof(FCMNEventData, AutoStart_68_0AD2A00343386F8D9BF3709F7D85CD7A) == 0x00012A, "Member 'FCMNEventData::AutoStart_68_0AD2A00343386F8D9BF3709F7D85CD7A' has a wrong offset!");
static_assert(offsetof(FCMNEventData, SceneChange_70_53C99E79436A42FE38F493B96F8303D1) == 0x00012B, "Member 'FCMNEventData::SceneChange_70_53C99E79436A42FE38F493B96F8303D1' has a wrong offset!");
static_assert(offsetof(FCMNEventData, TestMode_2_0A22D5194B03EF3023E762A16307B0C2) == 0x00012C, "Member 'FCMNEventData::TestMode_2_0A22D5194B03EF3023E762A16307B0C2' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EndFadeColor_48_C9945A84454C4E14CB408B9A65943108) == 0x000130, "Member 'FCMNEventData::EndFadeColor_48_C9945A84454C4E14CB408B9A65943108' has a wrong offset!");
static_assert(offsetof(FCMNEventData, StartFade_91_420B92FF4753E505E839239809C1E515) == 0x000140, "Member 'FCMNEventData::StartFade_91_420B92FF4753E505E839239809C1E515' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EndFade_93_CD2646324E9DA9849556658CD818D073) == 0x000144, "Member 'FCMNEventData::EndFade_93_CD2646324E9DA9849556658CD818D073' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EndWhiteFade_127_D457BB6F49E3AF0530EF64B4999BFC90) == 0x000148, "Member 'FCMNEventData::EndWhiteFade_127_D457BB6F49E3AF0530EF64B4999BFC90' has a wrong offset!");
static_assert(offsetof(FCMNEventData, ChapterVar_96_BD4ABE2F44A83D4236D52F8E03E3E09B) == 0x00014C, "Member 'FCMNEventData::ChapterVar_96_BD4ABE2F44A83D4236D52F8E03E3E09B' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventStartBgmStop_109_ECEEE8634FE5E8062CA2C9A2B30B8630) == 0x000154, "Member 'FCMNEventData::EventStartBgmStop_109_ECEEE8634FE5E8062CA2C9A2B30B8630' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventStartBgmID_110_6F2D68A5488068C569DE2E80A265283F) == 0x000158, "Member 'FCMNEventData::EventStartBgmID_110_6F2D68A5488068C569DE2E80A265283F' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventStartBgmLoop_111_283CC6CA4E2A5A227E7201A97FD0F1DF) == 0x000168, "Member 'FCMNEventData::EventStartBgmLoop_111_283CC6CA4E2A5A227E7201A97FD0F1DF' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventStartEnvStop_112_157697F5479CDFECEACC1BAA94A73F8C) == 0x000169, "Member 'FCMNEventData::EventStartEnvStop_112_157697F5479CDFECEACC1BAA94A73F8C' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventStartEnvID_113_721E90C44B9FCFDA1BD94D8E45A40749) == 0x000170, "Member 'FCMNEventData::EventStartEnvID_113_721E90C44B9FCFDA1BD94D8E45A40749' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventStartEnvLoop_114_80511FEF40DA563C75A566BB8E51ADD2) == 0x000180, "Member 'FCMNEventData::EventStartEnvLoop_114_80511FEF40DA563C75A566BB8E51ADD2' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventEndBgmStop_117_3BF18A7A46467FEE664618A2EE63AF77) == 0x000181, "Member 'FCMNEventData::EventEndBgmStop_117_3BF18A7A46467FEE664618A2EE63AF77' has a wrong offset!");
static_assert(offsetof(FCMNEventData, EventEndEnvStop_118_52C428B84C36637AFA705FBD7BB9C101) == 0x000182, "Member 'FCMNEventData::EventEndEnvStop_118_52C428B84C36637AFA705FBD7BB9C101' has a wrong offset!");

}

