#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRILogo_P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CRILogo_P.CRILogo_P_C
// 0x0020 (0x0248 - 0x0228)
class ACRILogo_P_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URCStartupWidget*                       CRILogoWidget;                                     // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         skippableTime;                                     // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTime;                                          // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFinish;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTick;                                            // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_CRILogo_P(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CRILogo_P_C">();
	}
	static class ACRILogo_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACRILogo_P_C>();
	}
};
static_assert(alignof(ACRILogo_P_C) == 0x000008, "Wrong alignment on ACRILogo_P_C");
static_assert(sizeof(ACRILogo_P_C) == 0x000248, "Wrong size on ACRILogo_P_C");
static_assert(offsetof(ACRILogo_P_C, UberGraphFrame) == 0x000228, "Member 'ACRILogo_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACRILogo_P_C, CRILogoWidget) == 0x000230, "Member 'ACRILogo_P_C::CRILogoWidget' has a wrong offset!");
static_assert(offsetof(ACRILogo_P_C, skippableTime) == 0x000238, "Member 'ACRILogo_P_C::skippableTime' has a wrong offset!");
static_assert(offsetof(ACRILogo_P_C, FadeTime) == 0x00023C, "Member 'ACRILogo_P_C::FadeTime' has a wrong offset!");
static_assert(offsetof(ACRILogo_P_C, isFinish) == 0x000240, "Member 'ACRILogo_P_C::isFinish' has a wrong offset!");
static_assert(offsetof(ACRILogo_P_C, IsTick) == 0x000241, "Member 'ACRILogo_P_C::IsTick' has a wrong offset!");

}

