#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACTIVE_FoliageComp_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InstanceStatus_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RC_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C
// 0x0170 (0x0920 - 0x07B0)
class UINTERACTIVE_FoliageComp_BP_C : public URCInteractiveFoliageComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Trample_BendAngle_WEIGHT;                          // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Trample_Z_Scale_WEIGHT;                            // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Trample_BendDuration_MULTIPLIER;                   // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BendAway_Angle_WEIGHT;                             // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BendAway__Z_Scale_WEIGHT;                          // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BendAway_Duration_MULTIPLIER;                      // 0x07CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BendAway_Yaw_MULTIPLIER;                           // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnDeform_Duration;                                 // 0x07D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnDeform_DurationWhenTrampled;                     // 0x07D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnDeform_UPS;                                      // 0x07DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EInstanceStatus>                       statusToRemoveAfterUnTransform;                    // 0x07E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	int32                                         backToOrigIndex;                                   // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BG_InteractiveGrassManager_C*       manager;                                           // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FTransform                             targetTransformToBackTo;                           // 0x0800(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	int32                                         UnDeform_UPS_WhenTrampled;                         // 0x0830(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          wantsToUnTrample;                                  // 0x0834(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_835[0x3];                                      // 0x0835(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              UnloadedViaStreaming;                              // 0x0838(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         chunkSize_;                                        // 0x0848(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          okToChunk;                                         // 0x084C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84D[0x3];                                      // 0x084D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                upperLeftBBoxCorner;                               // 0x0850(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         upperLeftCorner_X;                                 // 0x085C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         upperLeftCorner_Y;                                 // 0x0860(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         upperLeftCorner_Z;                                 // 0x0864(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         X;                                                 // 0x0868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         chunkAmount_X;                                     // 0x086C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         chunkAmount_Y;                                     // 0x0870(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         I;                                                 // 0x0874(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         J;                                                 // 0x0878(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UINTERACTIVE_FoliageComp_BP_C*>  ChunkedComponents;                                 // 0x0880(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         quarterOfInstances;                                // 0x0890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         chunkNrX;                                          // 0x0894(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         chunkNrY;                                          // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x08A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TMap<int32, struct FRCGrassTransformParameter> instancesToBackToOriginal;                         // 0x08D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_INTERACTIVE_FoliageComp_BP(int32 EntryPoint);
	void BackToOriginalTransform(const TArray<int32>& instancesIndexes);
	void DestroyAfterDelay();
	void DivideIntoChunks_InfLoopWorkaround(float ChunkSize);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void RemoveAnyActiveStatuses(int32 InstanceIndex);
	void Copy_SetFoliageParameters(class UINTERACTIVE_FoliageComp_BP_C* CopyFrom);
	void Copy_SetFoliageParameters_FromClass(class UClass* CopyFrom, class UStaticMesh* meshToSet);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACTIVE_FoliageComp_BP_C">();
	}
	static class UINTERACTIVE_FoliageComp_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTERACTIVE_FoliageComp_BP_C>();
	}
};
static_assert(alignof(UINTERACTIVE_FoliageComp_BP_C) == 0x000010, "Wrong alignment on UINTERACTIVE_FoliageComp_BP_C");
static_assert(sizeof(UINTERACTIVE_FoliageComp_BP_C) == 0x000920, "Wrong size on UINTERACTIVE_FoliageComp_BP_C");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, UberGraphFrame) == 0x0007B0, "Member 'UINTERACTIVE_FoliageComp_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, Trample_BendAngle_WEIGHT) == 0x0007B8, "Member 'UINTERACTIVE_FoliageComp_BP_C::Trample_BendAngle_WEIGHT' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, Trample_Z_Scale_WEIGHT) == 0x0007BC, "Member 'UINTERACTIVE_FoliageComp_BP_C::Trample_Z_Scale_WEIGHT' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, Trample_BendDuration_MULTIPLIER) == 0x0007C0, "Member 'UINTERACTIVE_FoliageComp_BP_C::Trample_BendDuration_MULTIPLIER' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, BendAway_Angle_WEIGHT) == 0x0007C4, "Member 'UINTERACTIVE_FoliageComp_BP_C::BendAway_Angle_WEIGHT' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, BendAway__Z_Scale_WEIGHT) == 0x0007C8, "Member 'UINTERACTIVE_FoliageComp_BP_C::BendAway__Z_Scale_WEIGHT' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, BendAway_Duration_MULTIPLIER) == 0x0007CC, "Member 'UINTERACTIVE_FoliageComp_BP_C::BendAway_Duration_MULTIPLIER' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, BendAway_Yaw_MULTIPLIER) == 0x0007D0, "Member 'UINTERACTIVE_FoliageComp_BP_C::BendAway_Yaw_MULTIPLIER' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, UnDeform_Duration) == 0x0007D4, "Member 'UINTERACTIVE_FoliageComp_BP_C::UnDeform_Duration' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, UnDeform_DurationWhenTrampled) == 0x0007D8, "Member 'UINTERACTIVE_FoliageComp_BP_C::UnDeform_DurationWhenTrampled' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, UnDeform_UPS) == 0x0007DC, "Member 'UINTERACTIVE_FoliageComp_BP_C::UnDeform_UPS' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, statusToRemoveAfterUnTransform) == 0x0007E0, "Member 'UINTERACTIVE_FoliageComp_BP_C::statusToRemoveAfterUnTransform' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, backToOrigIndex) == 0x0007F0, "Member 'UINTERACTIVE_FoliageComp_BP_C::backToOrigIndex' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, manager) == 0x0007F8, "Member 'UINTERACTIVE_FoliageComp_BP_C::manager' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, targetTransformToBackTo) == 0x000800, "Member 'UINTERACTIVE_FoliageComp_BP_C::targetTransformToBackTo' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, UnDeform_UPS_WhenTrampled) == 0x000830, "Member 'UINTERACTIVE_FoliageComp_BP_C::UnDeform_UPS_WhenTrampled' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, wantsToUnTrample) == 0x000834, "Member 'UINTERACTIVE_FoliageComp_BP_C::wantsToUnTrample' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, UnloadedViaStreaming) == 0x000838, "Member 'UINTERACTIVE_FoliageComp_BP_C::UnloadedViaStreaming' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, chunkSize_) == 0x000848, "Member 'UINTERACTIVE_FoliageComp_BP_C::chunkSize_' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, okToChunk) == 0x00084C, "Member 'UINTERACTIVE_FoliageComp_BP_C::okToChunk' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, upperLeftBBoxCorner) == 0x000850, "Member 'UINTERACTIVE_FoliageComp_BP_C::upperLeftBBoxCorner' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, upperLeftCorner_X) == 0x00085C, "Member 'UINTERACTIVE_FoliageComp_BP_C::upperLeftCorner_X' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, upperLeftCorner_Y) == 0x000860, "Member 'UINTERACTIVE_FoliageComp_BP_C::upperLeftCorner_Y' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, upperLeftCorner_Z) == 0x000864, "Member 'UINTERACTIVE_FoliageComp_BP_C::upperLeftCorner_Z' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, X) == 0x000868, "Member 'UINTERACTIVE_FoliageComp_BP_C::X' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, chunkAmount_X) == 0x00086C, "Member 'UINTERACTIVE_FoliageComp_BP_C::chunkAmount_X' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, chunkAmount_Y) == 0x000870, "Member 'UINTERACTIVE_FoliageComp_BP_C::chunkAmount_Y' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, I) == 0x000874, "Member 'UINTERACTIVE_FoliageComp_BP_C::I' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, J) == 0x000878, "Member 'UINTERACTIVE_FoliageComp_BP_C::J' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, ChunkedComponents) == 0x000880, "Member 'UINTERACTIVE_FoliageComp_BP_C::ChunkedComponents' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, quarterOfInstances) == 0x000890, "Member 'UINTERACTIVE_FoliageComp_BP_C::quarterOfInstances' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, chunkNrX) == 0x000894, "Member 'UINTERACTIVE_FoliageComp_BP_C::chunkNrX' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, chunkNrY) == 0x000898, "Member 'UINTERACTIVE_FoliageComp_BP_C::chunkNrY' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, Transform) == 0x0008A0, "Member 'UINTERACTIVE_FoliageComp_BP_C::Transform' has a wrong offset!");
static_assert(offsetof(UINTERACTIVE_FoliageComp_BP_C, instancesToBackToOriginal) == 0x0008D0, "Member 'UINTERACTIVE_FoliageComp_BP_C::instancesToBackToOriginal' has a wrong offset!");

}

