#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACTIVE_FoliageComp_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InstanceStatus_structs.hpp"
#include "RC_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C.ExecuteUbergraph_INTERACTIVE_FoliageComp_BP
// 0x0370 (0x0370 - 0x0000)
struct INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInstanceStatus                               Temp_byte_Variable;                                // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInstanceStatus                               Temp_byte_Variable_1;                              // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInstanceStatus                               Temp_byte_Variable_2;                              // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInstanceStatus                               Temp_byte_Variable_3;                              // 0x0007(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BG_InteractiveGrassManager_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BG_InteractiveGrassManager_C*       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_chunkSize;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRCGrassTransformParameter             K2Node_MakeStruct_RCGrassTransformParameter;       // 0x0080(0x00B0)(NoDestructor)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInteractiveFoliageChunk_BP_C*          CallFunc_AddFoliageChunkActor_addedChunk;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInstanceCount_ReturnValue_1;           // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInteractiveFoliageChunk_BP_C*          CallFunc_AddFoliageChunkActor_addedChunk_1;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0xC];                                      // 0x0224(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform_1; // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue_1;       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERCGrassStatus>                        K2Node_MakeArray_Array;                            // 0x0278(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform_2; // 0x0290(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue_2;       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrassDeformed_ReturnValue;              // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RCInstanceTransform_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrassTrampled_ReturnValue;              // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_instancesIndexes;               // 0x02F0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0xC];                                      // 0x0334(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_2;                         // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP) == 0x000010, "Wrong alignment on INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP");
static_assert(sizeof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP) == 0x000370, "Wrong size on INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, EntryPoint) == 0x000000, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_byte_Variable) == 0x000004, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_byte_Variable_1) == 0x000005, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_byte_Variable_2) == 0x000006, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_byte_Variable_3) == 0x000007, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceCount_ReturnValue) == 0x000008, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00000C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000011, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Get_Item) == 0x000030, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, K2Node_Event_EndPlayReason) == 0x000039, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceTransform_OutInstanceTransform) == 0x000040, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceTransform_OutInstanceTransform' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceTransform_ReturnValue) == 0x000070, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, K2Node_CustomEvent_chunkSize) == 0x000074, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::K2Node_CustomEvent_chunkSize' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, K2Node_MakeStruct_RCGrassTransformParameter) == 0x000080, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::K2Node_MakeStruct_RCGrassTransformParameter' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetComponentBounds_Origin) == 0x000130, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetComponentBounds_BoxExtent) == 0x00013C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetComponentBounds_SphereRadius) == 0x000148, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00014C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_X) == 0x000150, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Y) == 0x000154, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Z) == 0x000158, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_X_1) == 0x00015C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Y_1) == 0x000160, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Z_1) == 0x000164, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000168, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x00016C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000170, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000174, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_FCeil_ReturnValue) == 0x000178, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00017C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_MakeVector_ReturnValue) == 0x000180, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00018C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000190, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_FCeil_ReturnValue_1) == 0x000194, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x000198, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00019C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_X_2) == 0x0001A0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Y_2) == 0x0001A4, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Z_2) == 0x0001A8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001AC, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0001B0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0001B4, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0001B8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0001BC, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0001C0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_X_3) == 0x0001C4, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Y_3) == 0x0001C8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BreakVector_Z_3) == 0x0001CC, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0001D0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0001D4, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x0001D8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_MakeVector_ReturnValue_1) == 0x0001DC, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_AddFoliageChunkActor_addedChunk) == 0x0001E8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_AddFoliageChunkActor_addedChunk' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Add_ReturnValue) == 0x0001F0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceCount_ReturnValue_1) == 0x0001F4, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0001F8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetComponentBounds_Origin_1) == 0x0001FC, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetComponentBounds_BoxExtent_1) == 0x000208, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetComponentBounds_SphereRadius_1) == 0x000214, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_AddFoliageChunkActor_addedChunk_1) == 0x000218, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_AddFoliageChunkActor_addedChunk_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_int_Variable) == 0x000220, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceTransform_OutInstanceTransform_1) == 0x000230, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceTransform_OutInstanceTransform_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceTransform_ReturnValue_1) == 0x000260, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000261, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000264, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Add_ReturnValue_1) == 0x000268, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Add_ReturnValue_2) == 0x00026C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Add_ReturnValue_3) == 0x000270, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, K2Node_MakeArray_Array) == 0x000278, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Add_ReturnValue_4) == 0x000288, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceTransform_OutInstanceTransform_2) == 0x000290, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceTransform_OutInstanceTransform_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_GetInstanceTransform_ReturnValue_2) == 0x0002C0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_GetInstanceTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002C8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_IsGrassDeformed_ReturnValue) == 0x0002D0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_IsGrassDeformed_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002D8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_IsGrassTrampled_ReturnValue) == 0x0002E0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_IsGrassTrampled_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_SelectInt_ReturnValue) == 0x0002E4, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_SelectFloat_ReturnValue) == 0x0002E8, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, K2Node_CustomEvent_instancesIndexes) == 0x0002F0, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::K2Node_CustomEvent_instancesIndexes' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Length_ReturnValue) == 0x000300, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_int_Variable_1) == 0x000304, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000308, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00030C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_int_Array_Index_Variable) == 0x000310, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Get_Item_1) == 0x000314, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_int_Variable_2) == 0x000318, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, Temp_int_Loop_Counter_Variable) == 0x00031C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000320, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000324, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000328, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x00032C, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Add_ReturnValue_5) == 0x000330, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP, CallFunc_Array_Get_Item_2) == 0x000340, "Member 'INTERACTIVE_FoliageComp_BP_C_ExecuteUbergraph_INTERACTIVE_FoliageComp_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C.BackToOriginalTransform
// 0x0010 (0x0010 - 0x0000)
struct INTERACTIVE_FoliageComp_BP_C_BackToOriginalTransform final
{
public:
	TArray<int32>                                 instancesIndexes;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(INTERACTIVE_FoliageComp_BP_C_BackToOriginalTransform) == 0x000008, "Wrong alignment on INTERACTIVE_FoliageComp_BP_C_BackToOriginalTransform");
static_assert(sizeof(INTERACTIVE_FoliageComp_BP_C_BackToOriginalTransform) == 0x000010, "Wrong size on INTERACTIVE_FoliageComp_BP_C_BackToOriginalTransform");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_BackToOriginalTransform, instancesIndexes) == 0x000000, "Member 'INTERACTIVE_FoliageComp_BP_C_BackToOriginalTransform::instancesIndexes' has a wrong offset!");

// Function INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C.DivideIntoChunks_InfLoopWorkaround
// 0x0004 (0x0004 - 0x0000)
struct INTERACTIVE_FoliageComp_BP_C_DivideIntoChunks_InfLoopWorkaround final
{
public:
	float                                         ChunkSize;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACTIVE_FoliageComp_BP_C_DivideIntoChunks_InfLoopWorkaround) == 0x000004, "Wrong alignment on INTERACTIVE_FoliageComp_BP_C_DivideIntoChunks_InfLoopWorkaround");
static_assert(sizeof(INTERACTIVE_FoliageComp_BP_C_DivideIntoChunks_InfLoopWorkaround) == 0x000004, "Wrong size on INTERACTIVE_FoliageComp_BP_C_DivideIntoChunks_InfLoopWorkaround");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_DivideIntoChunks_InfLoopWorkaround, ChunkSize) == 0x000000, "Member 'INTERACTIVE_FoliageComp_BP_C_DivideIntoChunks_InfLoopWorkaround::ChunkSize' has a wrong offset!");

// Function INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct INTERACTIVE_FoliageComp_BP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACTIVE_FoliageComp_BP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on INTERACTIVE_FoliageComp_BP_C_ReceiveEndPlay");
static_assert(sizeof(INTERACTIVE_FoliageComp_BP_C_ReceiveEndPlay) == 0x000001, "Wrong size on INTERACTIVE_FoliageComp_BP_C_ReceiveEndPlay");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'INTERACTIVE_FoliageComp_BP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C.RemoveAnyActiveStatuses
// 0x0020 (0x0020 - 0x0000)
struct INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses final
{
public:
	int32                                         InstanceIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrassUnDeforming_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARCGrassTransformer*                    CallFunc_GetGrassTransformer_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrassUnTrampling_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGrassDeformed_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGrassTrampled_ReturnValue;              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGrassChangingTransform_ReturnValue;     // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses) == 0x000008, "Wrong alignment on INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses");
static_assert(sizeof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses) == 0x000020, "Wrong size on INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, InstanceIndex) == 0x000000, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::InstanceIndex' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, Index_0) == 0x000004, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::Index_0' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, CallFunc_IsGrassUnDeforming_ReturnValue) == 0x000008, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::CallFunc_IsGrassUnDeforming_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, CallFunc_GetGrassTransformer_ReturnValue) == 0x000010, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::CallFunc_GetGrassTransformer_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, CallFunc_IsGrassUnTrampling_ReturnValue) == 0x000018, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::CallFunc_IsGrassUnTrampling_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, CallFunc_IsGrassDeformed_ReturnValue) == 0x000019, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::CallFunc_IsGrassDeformed_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, CallFunc_IsGrassTrampled_ReturnValue) == 0x00001A, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::CallFunc_IsGrassTrampled_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses, CallFunc_IsGrassChangingTransform_ReturnValue) == 0x00001B, "Member 'INTERACTIVE_FoliageComp_BP_C_RemoveAnyActiveStatuses::CallFunc_IsGrassChangingTransform_ReturnValue' has a wrong offset!");

// Function INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C.Copy&SetFoliageParameters
// 0x0010 (0x0010 - 0x0000)
struct INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters final
{
public:
	class UINTERACTIVE_FoliageComp_BP_C*          CopyFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters) == 0x000008, "Wrong alignment on INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters");
static_assert(sizeof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters) == 0x000010, "Wrong size on INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters, CopyFrom) == 0x000000, "Member 'INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters::CopyFrom' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters, CallFunc_SetStaticMesh_ReturnValue) == 0x000008, "Member 'INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C.Copy&SetFoliageParameters_FromClass
// 0x0018 (0x0018 - 0x0000)
struct INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass final
{
public:
	class UClass*                                 CopyFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            meshToSet;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass) == 0x000008, "Wrong alignment on INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass");
static_assert(sizeof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass) == 0x000018, "Wrong size on INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass, CopyFrom) == 0x000000, "Member 'INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass::CopyFrom' has a wrong offset!");
static_assert(offsetof(INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass, meshToSet) == 0x000008, "Member 'INTERACTIVE_FoliageComp_BP_C_Copy_SetFoliageParameters_FromClass::meshToSet' has a wrong offset!");
