#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieBP

#include "Basic.hpp"

#include "CriWareRuntime_structs.hpp"
#include "RC_structs.hpp"


namespace SDK::Params
{

// Function MovieBP.MovieBP_C.ExecuteUbergraph_MovieBP
// 0x01E8 (0x01E8 - 0x0000)
struct MovieBP_C_ExecuteUbergraph_MovieBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_______Variable;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int__________Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsScreenFade_ReturnValue;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UmovieUMG_C*                            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int___________Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMovieTime_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovieEnd_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARCMovieManager*                        CallFunc_GetMovieManager_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovieCansel_ReturnValue;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsLoop_ReturnValue;                    // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsScreenFade_ReturnValue_1;               // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc__________IsFinish;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00D0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRCParamSequencerSoundTemplateTableRow CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F0(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0150(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRCParamSequencerSoundTemplateTableRow CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0170(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x1];                                      // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARCMovieManager*                        CallFunc_GetMovieManager_ReturnValue_1;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMovieIndex_ReturnValue;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieBP_C_ExecuteUbergraph_MovieBP) == 0x000008, "Wrong alignment on MovieBP_C_ExecuteUbergraph_MovieBP");
static_assert(sizeof(MovieBP_C_ExecuteUbergraph_MovieBP) == 0x0001E8, "Wrong size on MovieBP_C_ExecuteUbergraph_MovieBP");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, EntryPoint) == 0x000000, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_bool_______Variable) == 0x000004, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_bool_______Variable' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_bool_Variable) == 0x000006, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_int__________Variable) == 0x000008, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_int__________Variable' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_IsScreenFade_ReturnValue) == 0x00000D, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_IsScreenFade_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Create_ReturnValue) == 0x000010, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_int___________Variable) == 0x000018, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_int___________Variable' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_bool_Variable_1) == 0x00001C, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001D, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetMovieTime_ReturnValue) == 0x000020, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetMovieTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_IsMovieEnd_ReturnValue) == 0x000024, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_IsMovieEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x00002C, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_bool_IsClosed_Variable) == 0x00002D, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_bool_Has_Been_Initd_Variable) == 0x000040, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetMovieManager_ReturnValue) == 0x000048, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetMovieManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_int_Variable) == 0x000050, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_IsMovieCansel_ReturnValue) == 0x000054, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_IsMovieCansel_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Get_Item) == 0x000070, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00008C, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00008D, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000094, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x000095, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetIsLoop_ReturnValue) == 0x000096, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetIsLoop_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_IsScreenFade_ReturnValue_1) == 0x000097, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_IsScreenFade_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Length_ReturnValue_2) == 0x000098, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, Temp_int_Variable_1) == 0x00009C, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Length_ReturnValue_3) == 0x0000B8, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000BC, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc__________IsFinish) == 0x0000C8, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc__________IsFinish' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000D0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Get_Item_3) == 0x0000E0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_LastIndex_ReturnValue) == 0x0000E8, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000140, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000141, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_LastIndex_ReturnValue_1) == 0x000144, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000148, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000149, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_BooleanAND_ReturnValue) == 0x00014A, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000150, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Get_Item_4) == 0x000160, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_LastIndex_ReturnValue_2) == 0x000168, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000170, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0001C0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001C1, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_BooleanAND_ReturnValue_1) == 0x0001C2, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Conv_StringToName_ReturnValue) == 0x0001C4, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Greater_IntInt_ReturnValue) == 0x0001CC, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetMovieManager_ReturnValue_1) == 0x0001D0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetMovieManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_GetMovieIndex_ReturnValue) == 0x0001D8, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_GetMovieIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0001DC, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Array_Length_ReturnValue_4) == 0x0001E0, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MovieBP_C_ExecuteUbergraph_MovieBP, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'MovieBP_C_ExecuteUbergraph_MovieBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MovieBP.MovieBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MovieBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieBP_C_ReceiveTick) == 0x000004, "Wrong alignment on MovieBP_C_ReceiveTick");
static_assert(sizeof(MovieBP_C_ReceiveTick) == 0x000004, "Wrong size on MovieBP_C_ReceiveTick");
static_assert(offsetof(MovieBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MovieBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MovieBP.MovieBP_C.動画読み込み処理
// 0x0028 (0x0028 - 0x0000)
struct MovieBP_C_m________________________0 final
{
public:
	class FString                                 MovieID_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class URCManaComponent*>               K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URCManaComponent*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieBP_C_m________________________0) == 0x000008, "Wrong alignment on MovieBP_C_m________________________0");
static_assert(sizeof(MovieBP_C_m________________________0) == 0x000028, "Wrong size on MovieBP_C_m________________________0");
static_assert(offsetof(MovieBP_C_m________________________0, MovieID_0) == 0x000000, "Member 'MovieBP_C_m________________________0::MovieID_0' has a wrong offset!");
static_assert(offsetof(MovieBP_C_m________________________0, K2Node_MakeArray_Array) == 0x000010, "Member 'MovieBP_C_m________________________0::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MovieBP_C_m________________________0, CallFunc_Array_Get_Item) == 0x000020, "Member 'MovieBP_C_m________________________0::CallFunc_Array_Get_Item' has a wrong offset!");

// Function MovieBP.MovieBP_C.動画再生処理
// 0x0020 (0x0020 - 0x0000)
struct MovieBP_C_m_________________ final
{
public:
	class FName                                   SubTitleID_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ReadyMovieMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieBP_C_m_________________) == 0x000008, "Wrong alignment on MovieBP_C_m_________________");
static_assert(sizeof(MovieBP_C_m_________________) == 0x000020, "Wrong size on MovieBP_C_m_________________");
static_assert(offsetof(MovieBP_C_m_________________, SubTitleID_0) == 0x000000, "Member 'MovieBP_C_m_________________::SubTitleID_0' has a wrong offset!");
static_assert(offsetof(MovieBP_C_m_________________, CallFunc_ReadyMovieMaterial_ReturnValue) == 0x000008, "Member 'MovieBP_C_m_________________::CallFunc_ReadyMovieMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieBP_C_m_________________, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'MovieBP_C_m_________________::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function MovieBP.MovieBP_C.動画が終了したか
// 0x0038 (0x0038 - 0x0000)
struct MovieBP_C_m_______________________ final
{
public:
	int32                                         MovieIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFinish;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetLoading_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URCManaComponent*>               K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URCManaComponent*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue;                    // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieBP_C_m_______________________) == 0x000008, "Wrong alignment on MovieBP_C_m_______________________");
static_assert(sizeof(MovieBP_C_m_______________________) == 0x000038, "Wrong size on MovieBP_C_m_______________________");
static_assert(offsetof(MovieBP_C_m_______________________, MovieIndex) == 0x000000, "Member 'MovieBP_C_m_______________________::MovieIndex' has a wrong offset!");
static_assert(offsetof(MovieBP_C_m_______________________, isFinish) == 0x000004, "Member 'MovieBP_C_m_______________________::isFinish' has a wrong offset!");
static_assert(offsetof(MovieBP_C_m_______________________, CallFunc_IsAssetLoading_ReturnValue) == 0x000005, "Member 'MovieBP_C_m_______________________::CallFunc_IsAssetLoading_ReturnValue' has a wrong offset!");
