#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"
#include "RC_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SpRuntime_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "Foliage_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CriWareRuntime_classes.hpp"
#include "Text3D_classes.hpp"


namespace SDK
{

// Class RC.RCUserWidget
// 0x0000 (0x0270 - 0x0270)
class URCUserWidget : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCUserWidget">();
	}
	static class URCUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCUserWidget>();
	}
};
static_assert(alignof(URCUserWidget) == 0x000008, "Wrong alignment on URCUserWidget");
static_assert(sizeof(URCUserWidget) == 0x000270, "Wrong size on URCUserWidget");

// Class RC.RCUiWidget
// 0x0028 (0x0298 - 0x0270)
class URCUiWidget : public URCUserWidget
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               WidgetAnimation;                                   // 0x0278(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<bool>                                  IsWidgetAnimationLoop;                             // 0x0288(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnHideFinished();
	void OnHideStarted();
	void OnScreenHide();
	void OnScreenShow();
	void OnShowFinished();
	void OnShowStarted();
	void PlayWidgetAnimation(class UWidgetAnimation* InOneShotAnimation, class UWidgetAnimation* InLoopAnimation, const TArray<class UWidgetAnimation*>& InOneShotAnimationArray, const TArray<class UWidgetAnimation*>& InLoopAnimationArray);
	void StopWidgetAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCUiWidget">();
	}
	static class URCUiWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCUiWidget>();
	}
};
static_assert(alignof(URCUiWidget) == 0x000008, "Wrong alignment on URCUiWidget");
static_assert(sizeof(URCUiWidget) == 0x000298, "Wrong size on URCUiWidget");
static_assert(offsetof(URCUiWidget, WidgetAnimation) == 0x000278, "Member 'URCUiWidget::WidgetAnimation' has a wrong offset!");
static_assert(offsetof(URCUiWidget, IsWidgetAnimationLoop) == 0x000288, "Member 'URCUiWidget::IsWidgetAnimationLoop' has a wrong offset!");

// Class RC.RCUiWidgetBase
// 0x0040 (0x02D8 - 0x0298)
class URCUiWidgetBase : public URCUiWidget
{
public:
	uint8                                         Pad_298[0x18];                                     // 0x0298(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnablePause;                                      // 0x02B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPause;                                          // 0x02B1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B2[0xE];                                      // 0x02B2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MPCPath;                                           // 0x02C0(0x0010)(Edit, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseTimeOfMaterial;                                // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsWidgetPause();
	bool LoadCheck();
	void MoveToCenter();
	void RegistTutorial();
	void ReleaseWidget();
	void SetPosition(const struct FVector2D& In2DPosition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCUiWidgetBase">();
	}
	static class URCUiWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCUiWidgetBase>();
	}
};
static_assert(alignof(URCUiWidgetBase) == 0x000008, "Wrong alignment on URCUiWidgetBase");
static_assert(sizeof(URCUiWidgetBase) == 0x0002D8, "Wrong size on URCUiWidgetBase");
static_assert(offsetof(URCUiWidgetBase, bEnablePause) == 0x0002B0, "Member 'URCUiWidgetBase::bEnablePause' has a wrong offset!");
static_assert(offsetof(URCUiWidgetBase, bIsPause) == 0x0002B1, "Member 'URCUiWidgetBase::bIsPause' has a wrong offset!");
static_assert(offsetof(URCUiWidgetBase, MPCPath) == 0x0002C0, "Member 'URCUiWidgetBase::MPCPath' has a wrong offset!");
static_assert(offsetof(URCUiWidgetBase, bUseTimeOfMaterial) == 0x0002D0, "Member 'URCUiWidgetBase::bUseTimeOfMaterial' has a wrong offset!");

// Class RC.RCNzUiFinalePGLayoutWidget
// 0x0050 (0x0328 - 0x02D8)
class URCNzUiFinalePGLayoutWidget final : public URCUiWidgetBase
{
public:
	TArray<class URCNzUiFinalePageGuideWidget*>   PageGuideList;                                     // 0x02D8(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrentPageIdx;                                    // 0x02E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              pgOverlaySize;                                     // 0x02EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              pgOverlayLocation;                                 // 0x02F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URCUiButtonGuideParts*                  BtnGuidePartsL;                                    // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URCUiButtonGuideParts*                  BtnGuidePartsR;                                    // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x18];                                     // 0x0310(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetPGLayoutLocationAndSize(struct FVector2D* Location, struct FVector2D* Size);
	bool InitializeButtonGuide(ERCInputKeyType keyL, ERCInputKeyType keyR);
	void InitializePGLayoutWidget(const TArray<EPageGuideType>& PageList);
	void MovePage(const int32 targetIdx);
	void OnButtonGuideClick(ERCInputKeyType KeyType);
	void UpdatePageGuide(const TArray<EPageGuideType>& PageList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCNzUiFinalePGLayoutWidget">();
	}
	static class URCNzUiFinalePGLayoutWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCNzUiFinalePGLayoutWidget>();
	}
};
static_assert(alignof(URCNzUiFinalePGLayoutWidget) == 0x000008, "Wrong alignment on URCNzUiFinalePGLayoutWidget");
static_assert(sizeof(URCNzUiFinalePGLayoutWidget) == 0x000328, "Wrong size on URCNzUiFinalePGLayoutWidget");
static_assert(offsetof(URCNzUiFinalePGLayoutWidget, PageGuideList) == 0x0002D8, "Member 'URCNzUiFinalePGLayoutWidget::PageGuideList' has a wrong offset!");
static_assert(offsetof(URCNzUiFinalePGLayoutWidget, CurrentPageIdx) == 0x0002E8, "Member 'URCNzUiFinalePGLayoutWidget::CurrentPageIdx' has a wrong offset!");
static_assert(offsetof(URCNzUiFinalePGLayoutWidget, pgOverlaySize) == 0x0002EC, "Member 'URCNzUiFinalePGLayoutWidget::pgOverlaySize' has a wrong offset!");
static_assert(offsetof(URCNzUiFinalePGLayoutWidget, pgOverlayLocation) == 0x0002F4, "Member 'URCNzUiFinalePGLayoutWidget::pgOverlayLocation' has a wrong offset!");
static_assert(offsetof(URCNzUiFinalePGLayoutWidget, BtnGuidePartsL) == 0x000300, "Member 'URCNzUiFinalePGLayoutWidget::BtnGuidePartsL' has a wrong offset!");
static_assert(offsetof(URCNzUiFinalePGLayoutWidget, BtnGuidePartsR) == 0x000308, "Member 'URCNzUiFinalePGLayoutWidget::BtnGuidePartsR' has a wrong offset!");

// Class RC.RCActor
// 0x0068 (0x0288 - 0x0220)
class ARCActor : public AActor
{
public:
	class FName                                   ActorName;                                         // 0x0220(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInitialize;                                       // 0x0228(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bVisible;                                          // 0x0229(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bVisibleActor;                                     // 0x022A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPause;                                            // 0x022B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPauseCancel;                                      // 0x022C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRCActorCollisionPrisetInfo>    CollisonPrisetList;                                // 0x0230(0x0010)(Edit, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnLevelLoadEnd;                                    // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLevelUnLoadEnd;                                  // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0x28];                                     // 0x0260(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetActorName();
	bool IsPause();
	bool IsPauseCancelFlag();
	bool IsVisibility();
	void SetPause(bool bInPause, bool bDirect);
	void SetPauseCancelFlag(bool bInPauseCancel);
	void SetVisibility(bool bInVisible, bool bDirect);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCActor">();
	}
	static class ARCActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCActor>();
	}
};
static_assert(alignof(ARCActor) == 0x000008, "Wrong alignment on ARCActor");
static_assert(sizeof(ARCActor) == 0x000288, "Wrong size on ARCActor");
static_assert(offsetof(ARCActor, ActorName) == 0x000220, "Member 'ARCActor::ActorName' has a wrong offset!");
static_assert(offsetof(ARCActor, bInitialize) == 0x000228, "Member 'ARCActor::bInitialize' has a wrong offset!");
static_assert(offsetof(ARCActor, bVisible) == 0x000229, "Member 'ARCActor::bVisible' has a wrong offset!");
static_assert(offsetof(ARCActor, bVisibleActor) == 0x00022A, "Member 'ARCActor::bVisibleActor' has a wrong offset!");
static_assert(offsetof(ARCActor, bPause) == 0x00022B, "Member 'ARCActor::bPause' has a wrong offset!");
static_assert(offsetof(ARCActor, bPauseCancel) == 0x00022C, "Member 'ARCActor::bPauseCancel' has a wrong offset!");
static_assert(offsetof(ARCActor, CollisonPrisetList) == 0x000230, "Member 'ARCActor::CollisonPrisetList' has a wrong offset!");
static_assert(offsetof(ARCActor, OnLevelLoadEnd) == 0x000240, "Member 'ARCActor::OnLevelLoadEnd' has a wrong offset!");
static_assert(offsetof(ARCActor, OnLevelUnLoadEnd) == 0x000250, "Member 'ARCActor::OnLevelUnLoadEnd' has a wrong offset!");

// Class RC.RCSpiritMiniGameManager
// 0x0038 (0x02C0 - 0x0288)
class ARCSpiritMiniGameManager final : public ARCActor
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpiritNiagaraActor;                                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSpiritNiagaraActorFollowCamera;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERCSpiritMiniGameCheckPointType               CurrentCheckPoint;                                 // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARCSpiritMiniGameCheckPoint*>    CheckPointArray;                                   // 0x02A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bHitWanderingSpirit;                               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRCWanderingSpiritHitData              HitData;                                           // 0x02B4(0x000C)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCSpiritMiniGameManager">();
	}
	static class ARCSpiritMiniGameManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCSpiritMiniGameManager>();
	}
};
static_assert(alignof(ARCSpiritMiniGameManager) == 0x000008, "Wrong alignment on ARCSpiritMiniGameManager");
static_assert(sizeof(ARCSpiritMiniGameManager) == 0x0002C0, "Wrong size on ARCSpiritMiniGameManager");
static_assert(offsetof(ARCSpiritMiniGameManager, SpiritNiagaraActor) == 0x000290, "Member 'ARCSpiritMiniGameManager::SpiritNiagaraActor' has a wrong offset!");
static_assert(offsetof(ARCSpiritMiniGameManager, bSpiritNiagaraActorFollowCamera) == 0x000298, "Member 'ARCSpiritMiniGameManager::bSpiritNiagaraActorFollowCamera' has a wrong offset!");
static_assert(offsetof(ARCSpiritMiniGameManager, CurrentCheckPoint) == 0x000299, "Member 'ARCSpiritMiniGameManager::CurrentCheckPoint' has a wrong offset!");
static_assert(offsetof(ARCSpiritMiniGameManager, CheckPointArray) == 0x0002A0, "Member 'ARCSpiritMiniGameManager::CheckPointArray' has a wrong offset!");
static_assert(offsetof(ARCSpiritMiniGameManager, bHitWanderingSpirit) == 0x0002B0, "Member 'ARCSpiritMiniGameManager::bHitWanderingSpirit' has a wrong offset!");
static_assert(offsetof(ARCSpiritMiniGameManager, HitData) == 0x0002B4, "Member 'ARCSpiritMiniGameManager::HitData' has a wrong offset!");

// Class RC.RC3DWidgetComponent
// 0x0000 (0x05B0 - 0x05B0)
class URC3DWidgetComponent final : public UWidgetComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RC3DWidgetComponent">();
	}
	static class URC3DWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URC3DWidgetComponent>();
	}
};
static_assert(alignof(URC3DWidgetComponent) == 0x000010, "Wrong alignment on URC3DWidgetComponent");
static_assert(sizeof(URC3DWidgetComponent) == 0x0005B0, "Wrong size on URC3DWidgetComponent");

// Class RC.RCLevelSequenceActor
// 0x0030 (0x02D8 - 0x02A8)
class ARCLevelSequenceActor : public ALevelSequenceActor
{
public:
	class FName                                   SrquencerName;                                     // 0x02A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B0[0xC];                                      // 0x02B0(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopStartRate;                                     // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LoopEndRate;                                       // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C4[0x14];                                     // 0x02C4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishedEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCLevelSequenceActor">();
	}
	static class ARCLevelSequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCLevelSequenceActor>();
	}
};
static_assert(alignof(ARCLevelSequenceActor) == 0x000008, "Wrong alignment on ARCLevelSequenceActor");
static_assert(sizeof(ARCLevelSequenceActor) == 0x0002D8, "Wrong size on ARCLevelSequenceActor");
static_assert(offsetof(ARCLevelSequenceActor, SrquencerName) == 0x0002A8, "Member 'ARCLevelSequenceActor::SrquencerName' has a wrong offset!");
static_assert(offsetof(ARCLevelSequenceActor, LoopStartRate) == 0x0002BC, "Member 'ARCLevelSequenceActor::LoopStartRate' has a wrong offset!");
static_assert(offsetof(ARCLevelSequenceActor, LoopEndRate) == 0x0002C0, "Member 'ARCLevelSequenceActor::LoopEndRate' has a wrong offset!");

// Class RC.RCShinigamiLevelSequenceActor
// 0x0058 (0x0330 - 0x02D8)
class ARCShinigamiLevelSequenceActor final : public ARCLevelSequenceActor
{
public:
	bool                                          bSpawn;                                            // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERCSequenceShinigamiTransformTypeLSA          TransformType;                                     // 0x02D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x02E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x02F0(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	ERCSequenceShinigamiFollowType                FollowType;                                        // 0x0320(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERCSequenceShinigamiFollowTarget              FollowTarget;                                      // 0x0321(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 FollowTargetActor;                                 // 0x0328(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCShinigamiLevelSequenceActor">();
	}
	static class ARCShinigamiLevelSequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCShinigamiLevelSequenceActor>();
	}
};
static_assert(alignof(ARCShinigamiLevelSequenceActor) == 0x000010, "Wrong alignment on ARCShinigamiLevelSequenceActor");
static_assert(sizeof(ARCShinigamiLevelSequenceActor) == 0x000330, "Wrong size on ARCShinigamiLevelSequenceActor");
static_assert(offsetof(ARCShinigamiLevelSequenceActor, bSpawn) == 0x0002D8, "Member 'ARCShinigamiLevelSequenceActor::bSpawn' has a wrong offset!");
static_assert(offsetof(ARCShinigamiLevelSequenceActor, TransformType) == 0x0002D9, "Member 'ARCShinigamiLevelSequenceActor::TransformType' has a wrong offset!");
static_assert(offsetof(ARCShinigamiLevelSequenceActor, Actor) == 0x0002E0, "Member 'ARCShinigamiLevelSequenceActor::Actor' has a wrong offset!");
static_assert(offsetof(ARCShinigamiLevelSequenceActor, Transform) == 0x0002F0, "Member 'ARCShinigamiLevelSequenceActor::Transform' has a wrong offset!");
static_assert(offsetof(ARCShinigamiLevelSequenceActor, FollowType) == 0x000320, "Member 'ARCShinigamiLevelSequenceActor::FollowType' has a wrong offset!");
static_assert(offsetof(ARCShinigamiLevelSequenceActor, FollowTarget) == 0x000321, "Member 'ARCShinigamiLevelSequenceActor::FollowTarget' has a wrong offset!");
static_assert(offsetof(ARCShinigamiLevelSequenceActor, FollowTargetActor) == 0x000328, "Member 'ARCShinigamiLevelSequenceActor::FollowTargetActor' has a wrong offset!");

// Class RC.RCAutoPlay
// 0x00B8 (0x00E8 - 0x0030)
class URCAutoPlay final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x98];                                      // 0x0030(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FVector& InitPosition, const struct FRotator& InitRotate, float Alpha, const struct FVector& DistPosition, float RotAlpha, const struct FRotator& DistRotate, float HeadingAlpha, const struct FRotator& Heading)> Tick;                                              // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector& InitPosition, const struct FRotator& InitRotate, float Alpha, const struct FVector& DistPosition, float RotAlpha, const struct FRotator& DistRotate, float HeadingAlpha, const struct FRotator& Heading)> Completed;                                         // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class URCAutoPlay* AutoPlay(const class UObject* WorldContextObject, class AActor* Target, class AActor* Dist, float Duration, bool IgnoreZ, ERCAutoPlayCompletionPred Completion);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCAutoPlay">();
	}
	static class URCAutoPlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCAutoPlay>();
	}
};
static_assert(alignof(URCAutoPlay) == 0x000008, "Wrong alignment on URCAutoPlay");
static_assert(sizeof(URCAutoPlay) == 0x0000E8, "Wrong size on URCAutoPlay");
static_assert(offsetof(URCAutoPlay, Tick) == 0x0000C8, "Member 'URCAutoPlay::Tick' has a wrong offset!");
static_assert(offsetof(URCAutoPlay, Completed) == 0x0000D8, "Member 'URCAutoPlay::Completed' has a wrong offset!");

// Class RC.RCNzUiFinaleIndexClearWidget
// 0x0038 (0x0310 - 0x02D8)
class URCNzUiFinaleIndexClearWidget final : public URCUiWidgetBase
{
public:
	class UWidgetAnimation*                       AN_Start;                                          // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           TimerHandle;                                       // 0x02E0(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         showTime;                                          // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              HiddenFinishDelegate;                              // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              IndexClearPlaySEDelegate;                          // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	void PlayIndexClearShowAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCNzUiFinaleIndexClearWidget">();
	}
	static class URCNzUiFinaleIndexClearWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCNzUiFinaleIndexClearWidget>();
	}
};
static_assert(alignof(URCNzUiFinaleIndexClearWidget) == 0x000008, "Wrong alignment on URCNzUiFinaleIndexClearWidget");
static_assert(sizeof(URCNzUiFinaleIndexClearWidget) == 0x000310, "Wrong size on URCNzUiFinaleIndexClearWidget");
static_assert(offsetof(URCNzUiFinaleIndexClearWidget, AN_Start) == 0x0002D8, "Member 'URCNzUiFinaleIndexClearWidget::AN_Start' has a wrong offset!");
static_assert(offsetof(URCNzUiFinaleIndexClearWidget, TimerHandle) == 0x0002E0, "Member 'URCNzUiFinaleIndexClearWidget::TimerHandle' has a wrong offset!");
static_assert(offsetof(URCNzUiFinaleIndexClearWidget, showTime) == 0x0002E8, "Member 'URCNzUiFinaleIndexClearWidget::showTime' has a wrong offset!");
static_assert(offsetof(URCNzUiFinaleIndexClearWidget, HiddenFinishDelegate) == 0x0002F0, "Member 'URCNzUiFinaleIndexClearWidget::HiddenFinishDelegate' has a wrong offset!");
static_assert(offsetof(URCNzUiFinaleIndexClearWidget, IndexClearPlaySEDelegate) == 0x000300, "Member 'URCNzUiFinaleIndexClearWidget::IndexClearPlaySEDelegate' has a wrong offset!");

// Class RC.AttbAsset
// 0x0020 (0x0048 - 0x0028)
class UAttbAsset final : public UObject
{
public:
	TArray<int32>                                 presetValue;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         ObjectValue;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttbAsset">();
	}
	static class UAttbAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttbAsset>();
	}
};
static_assert(alignof(UAttbAsset) == 0x000008, "Wrong alignment on UAttbAsset");
static_assert(sizeof(UAttbAsset) == 0x000048, "Wrong size on UAttbAsset");
static_assert(offsetof(UAttbAsset, presetValue) == 0x000028, "Member 'UAttbAsset::presetValue' has a wrong offset!");
static_assert(offsetof(UAttbAsset, ObjectValue) == 0x000038, "Member 'UAttbAsset::ObjectValue' has a wrong offset!");

// Class RC.RCAutoPlayActor
// 0x0120 (0x0340 - 0x0220)
class ARCAutoPlayActor final : public AActor
{
public:
	uint8                                         Pad_220[0x80];                                     // 0x0220(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FVector& InitPosition, const struct FRotator& InitRotate, float Alpha, const struct FVector& DistPosition, float RotAlpha, const struct FRotator& DistRotate, float HeadingAlpha, const struct FRotator& Heading)> TickPin;                                           // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector& InitPosition, const struct FRotator& InitRotate, float Alpha, const struct FVector& DistPosition, float RotAlpha, const struct FRotator& DistRotate, float HeadingAlpha, const struct FRotator& Heading)> CompletedPin;                                      // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x80];                                     // 0x02C0(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ARCAutoPlayActor* AutoPlayActor(const class UObject* WorldContextObject, class AActor* Target, class AActor* Dist, float Duration, bool IgnoreZ, ERCAutoPlayCompletionPred Completion);
	static class ARCAutoPlayActor* AutoPlayActor2(const class UObject* WorldContextObject, class AActor* Target, const struct FVector& InDistPos, const struct FRotator& InDistRot, float Duration, bool IgnoreZ, ERCAutoPlayCompletionPred Completion);

	void Abort();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCAutoPlayActor">();
	}
	static class ARCAutoPlayActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCAutoPlayActor>();
	}
};
static_assert(alignof(ARCAutoPlayActor) == 0x000008, "Wrong alignment on ARCAutoPlayActor");
static_assert(sizeof(ARCAutoPlayActor) == 0x000340, "Wrong size on ARCAutoPlayActor");
static_assert(offsetof(ARCAutoPlayActor, TickPin) == 0x0002A0, "Member 'ARCAutoPlayActor::TickPin' has a wrong offset!");
static_assert(offsetof(ARCAutoPlayActor, CompletedPin) == 0x0002B0, "Member 'ARCAutoPlayActor::CompletedPin' has a wrong offset!");

// Class RC.RCGrassTransformer
// 0x0060 (0x0280 - 0x0220)
class ARCGrassTransformer : public AActor
{
public:
	class URCInteractiveFoliageComponent*         Component;                                         // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FRCGrassTransformParameter> TransformParameters;                               // 0x0228(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bRemoveGrassFreshlyDeformedWhenStopUpdateInstance; // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartUpdate();
	void StartUpdateManagement();
	void StopUpdateInstance(int32 InstanceIndex);
	void StopUpdateManagement();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCGrassTransformer">();
	}
	static class ARCGrassTransformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCGrassTransformer>();
	}
};
static_assert(alignof(ARCGrassTransformer) == 0x000008, "Wrong alignment on ARCGrassTransformer");
static_assert(sizeof(ARCGrassTransformer) == 0x000280, "Wrong size on ARCGrassTransformer");
static_assert(offsetof(ARCGrassTransformer, Component) == 0x000220, "Member 'ARCGrassTransformer::Component' has a wrong offset!");
static_assert(offsetof(ARCGrassTransformer, TransformParameters) == 0x000228, "Member 'ARCGrassTransformer::TransformParameters' has a wrong offset!");
static_assert(offsetof(ARCGrassTransformer, bRemoveGrassFreshlyDeformedWhenStopUpdateInstance) == 0x000278, "Member 'ARCGrassTransformer::bRemoveGrassFreshlyDeformedWhenStopUpdateInstance' has a wrong offset!");

// Class RC.RCGrassRippleDeformer
// 0x0050 (0x02D0 - 0x0280)
class ARCGrassRippleDeformer final : public ARCGrassTransformer
{
public:
	float                                         Radius;                                            // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RippleSpeed;                                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RippleInterval;                                    // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            Waveform;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            Attenuation;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            SpeedScale;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            DeformCurve;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 RippleRadius;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	float                                         RippleGenerateTimer;                               // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateInterval;                                    // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DeformTimer;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateGrassTransform();
	void UpdateRippleRadius();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCGrassRippleDeformer">();
	}
	static class ARCGrassRippleDeformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCGrassRippleDeformer>();
	}
};
static_assert(alignof(ARCGrassRippleDeformer) == 0x000008, "Wrong alignment on ARCGrassRippleDeformer");
static_assert(sizeof(ARCGrassRippleDeformer) == 0x0002D0, "Wrong size on ARCGrassRippleDeformer");
static_assert(offsetof(ARCGrassRippleDeformer, Radius) == 0x000280, "Member 'ARCGrassRippleDeformer::Radius' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, Thickness) == 0x000284, "Member 'ARCGrassRippleDeformer::Thickness' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, RippleSpeed) == 0x000288, "Member 'ARCGrassRippleDeformer::RippleSpeed' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, RippleInterval) == 0x00028C, "Member 'ARCGrassRippleDeformer::RippleInterval' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, Waveform) == 0x000290, "Member 'ARCGrassRippleDeformer::Waveform' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, Attenuation) == 0x000298, "Member 'ARCGrassRippleDeformer::Attenuation' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, SpeedScale) == 0x0002A0, "Member 'ARCGrassRippleDeformer::SpeedScale' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, DeformCurve) == 0x0002A8, "Member 'ARCGrassRippleDeformer::DeformCurve' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, RippleRadius) == 0x0002B0, "Member 'ARCGrassRippleDeformer::RippleRadius' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, RippleGenerateTimer) == 0x0002C0, "Member 'ARCGrassRippleDeformer::RippleGenerateTimer' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, UpdateInterval) == 0x0002C4, "Member 'ARCGrassRippleDeformer::UpdateInterval' has a wrong offset!");
static_assert(offsetof(ARCGrassRippleDeformer, DeformTimer) == 0x0002C8, "Member 'ARCGrassRippleDeformer::DeformTimer' has a wrong offset!");

// Class RC.RCCSVData
// 0x0008 (0x0030 - 0x0028)
class URCCSVData : public UObject
{
public:
	class UDataTable*                             DataTablePtr;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetDataTable(class UDataTable* pDataTable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCCSVData">();
	}
	static class URCCSVData* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCCSVData>();
	}
};
static_assert(alignof(URCCSVData) == 0x000008, "Wrong alignment on URCCSVData");
static_assert(sizeof(URCCSVData) == 0x000030, "Wrong size on URCCSVData");
static_assert(offsetof(URCCSVData, DataTablePtr) == 0x000028, "Member 'URCCSVData::DataTablePtr' has a wrong offset!");

// Class RC.RCText3DActorBFL
// 0x0000 (0x0028 - 0x0028)
class URCText3DActorBFL final : public UBlueprintFunctionLibrary
{
public:
	static class FText GetText(class FName InActorName);
	static class ARCText3DActor* GetText3DActor(class FName InActorName);
	static class FName GetTextID(class FName InActorName);
	static bool IsVisibility(class FName InActorName);
	static void SetTextID(class FName InActorName, class FName InTextID);
	static void SetVisibility(class FName InActorName, bool bInVisible, bool bDirect);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCText3DActorBFL">();
	}
	static class URCText3DActorBFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<URCText3DActorBFL>();
	}
};
static_assert(alignof(URCText3DActorBFL) == 0x000008, "Wrong alignment on URCText3DActorBFL");
static_assert(sizeof(URCText3DActorBFL) == 0x000028, "Wrong size on URCText3DActorBFL");

// Class RC.RCBackDropActor
// 0x00A0 (0x02C0 - 0x0220)
class ARCBackDropActor final : public AActor
{
public:
	uint8                                         Pad_220[0xA0];                                     // 0x0220(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddPoint(const struct FVector& Pos, float W, float H, int32 Xbrock, int32 Ybrock);
	void Bake(int32 brockSize);
	void MakeScanMap(const struct FVector& Pos, int32 startX, int32 startY, int32 endX, int32 endY, int32 BrockSizeX, int32 BrockSizeY);
	bool NeedScap();
	void Reflesh();
	float RGBA2Hight(const struct FVector4& col);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCBackDropActor">();
	}
	static class ARCBackDropActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCBackDropActor>();
	}
};
static_assert(alignof(ARCBackDropActor) == 0x000008, "Wrong alignment on ARCBackDropActor");
static_assert(sizeof(ARCBackDropActor) == 0x0002C0, "Wrong size on ARCBackDropActor");

// Class RC.CascadeRainDataData
// 0x0050 (0x0080 - 0x0030)
class UCascadeRainDataData final : public URCCSVData
{
public:
	TMap<class FName, struct FCascadeRainDataTableRow> Data;                                              // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void Import();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CascadeRainDataData">();
	}
	static class UCascadeRainDataData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCascadeRainDataData>();
	}
};
static_assert(alignof(UCascadeRainDataData) == 0x000008, "Wrong alignment on UCascadeRainDataData");
static_assert(sizeof(UCascadeRainDataData) == 0x000080, "Wrong size on UCascadeRainDataData");
static_assert(offsetof(UCascadeRainDataData, Data) == 0x000030, "Member 'UCascadeRainDataData::Data' has a wrong offset!");

// Class RC.RCCharacter
// 0x0060 (0x0520 - 0x04C0)
class ARCCharacter : public ACharacter
{
public:
	class FName                                   CharacterName;                                     // 0x04B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInitialize;                                       // 0x04C0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bVisible;                                          // 0x04C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bVisibleCharacter;                                 // 0x04C2(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bVisibleIsCollision;                               // 0x04C3(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPause;                                            // 0x04C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPauseCancel;                                      // 0x04C5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSimulatePhysics;                                  // 0x04C6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C7[0x1];                                      // 0x04C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CollisonPrisetName;                                // 0x04C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int8>                                  CastShadowDefaultValues;                           // 0x04D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TArray<class FName>                           MeshComponentNames;                                // 0x04E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F0[0x30];                                     // 0x04F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsPause();
	bool IsPauseCancelFlag();
	bool IsSimulatePhysicsFlag();
	bool IsVisibility();
	void SetPause(bool bPauseFlag, bool bDirectFlag);
	void SetPauseCancelFlag(bool bInPauseCancel);
	void SetSimulatePhysicsFlag(bool bInSimulatePhysics, bool bInDirect);
	void SetVisibility(bool bVisibleFlag, bool bDirectFlag, bool bIsCollision);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RCCharacter">();
	}
	static class ARCCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARCCharacter>();
	}
};
static_assert(alignof(ARCCharacter) == 0x000010, "Wrong alignment on ARCCharacter");
static_assert(sizeof(ARCCharacter) == 0x000520, "Wrong size on ARCCharacter");
static_assert(offsetof(ARCCharacter, CharacterName) == 0x0004B8, "Member 'ARCCharacter::CharacterName' has a wrong offset!");
static_assert(offsetof(ARCCharacter, bInitialize) == 0x0004C0, "Member 'ARCCharacter::bInitialize' has a wrong offset!");
static_assert(offsetof(ARCCharacter, bVisible) == 0x0004C1, "Member 'ARCCharacter::bVisible' has a wrong offset!");
static_assert(offsetof(ARCCharacter, bVisibleCharacter) == 0x0004C2, "Member 'ARCCharacter::bVisibleCharacter' has a wrong offset!");
static_assert(offsetof(ARCCharacter, bVisibleIsCollision) == 0x0004C3, "Member 'ARCCharacter::bVisibleIsCollision' has a wrong offset!");
static_assert(offsetof(ARCCharacter, bPause) == 0x0004C4, "Member 'ARCCharacter::bPause' has a wrong offset!");
static_assert(offsetof(ARCCharacter, bPauseCancel) == 0x0004C5, "Member 'ARCCharacter::bPauseCancel' has a wrong offset!");
static_assert(offsetof(ARCCharacter, bSimulatePhysics) == 0x0004C6, "Member 'ARCCharacter::bSimulatePhysics' has a wrong offset!");
static_assert(offsetof(ARCCharacter, CollisonPrisetName) == 0x0004C8, "Member 'ARCCharacter::CollisonPrisetName' has a wrong offset!");
static_assert(offsetof(ARCCharacter, CastShadowDefaultValues) == 0x0004D0, "Member 'ARCCharacter::CastShadowDefaultValues' has a wrong offset!");
static_assert(offsetof(ARCCharacter, MeshComponentNames) == 0x0004E0, "Member 'ARCCharacter::MeshComponentNames' has a wrong offset!");

// Class RC.RCCharacterScript
// 0x0190 (0x06B0 - 0x0520)
class ARCCharacterScript : public ARCCharacter
{
public:
	uint8                                         Pad_520[0x10];                                     // 0x0520(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class URCScriptActorComponent*                ScriptActorComp;                                   // 0x0530(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfHeight;                                        // 0x0538(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Radius;                                            // 0x053C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsStartPlayer;                                    // 0x0540(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsStartPlayerEnable;                              // 0x0541(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLevelSetting;                                   // 0x0542(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_543[0x1];                                      // 0x0543(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x0544(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OldDeltaTime;                                      // 0x0550(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MoveLength;                                        // 0x0554(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                PreDirection;                                      // 0x0558(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DirectionAmount;                                   // 0x0564(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bStartDirectionComplement;                         // 0x0568(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionComplementSpeed;                          // 0x056C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxDirectionAmount;                                // 0x0570(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bStartAntiDirectionComplement;                     // 0x0574(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionRate;                                     // 0x0578(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DirectionComplementSpeedRate;                      // 0x057C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_580[0x24];                                     // 0x0580(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRCScriptActorTurnSettings             TurnSettings;                                      // 0x05A4(0x0014)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRCScriptActorTurnInfo                 TurnInfo;                                          // 0x05B8(0x002C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRCScriptActorTurnData                 TurnData;                                          // 0x05E4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bTurnable;                                         // 0x05F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFootIK;                                           // 0x05F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F6[0x2];                                      // 0x05F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRCScriptActorHitReactionSettings      HitReactionSettings;                               // 0x05F8(0x0030)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRCScriptActorHitReactionData          HitReactionData;                                   // 0x0628(0x0014)(Edit, BlueprintVisible, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bDebugScriptDraw;                                  // 0x063C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bKakiwari;                                         // 0x063D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTalk;                                             // 0x063E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayerLookAtFace;                                 // 0x063F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TalkLabelName;                                     // 0x0640(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SelifTextId;                                       // 0x0648(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         BalloonFrameType;                                  // 0x0650(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         BalloonType;                                       // 0x0654(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TalkLength;                                        // 0x0658(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SelifLength;                                       // 0x065C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BalloonLength;                                     // 0x0660(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BalloonHeightOffset;                               // 0x0664(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BalloonAngleOffset;                                // 0x0668(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BalloonLengthOffset;                               // 0x066C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DrawLayerName;                                     // 0x0670(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLoading;                                        // 0x0678(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LoadAfterPosition;                                 // 0x067C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTalkEnable;                                       // 0x0688(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSelifDraw;                                        // 0x0689(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bBalloonDraw;                                      // 0x068A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68B[0x1];                                      // 0x068B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayerLength;                                      // 0x068C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CenterLength;                                      // 0x0690(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERCActorQuestType                             QuestType;                                         // 0x0694(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   QuestTitleName;                                    // 0x0698(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNowPlayerLookAtFace;                              // 0x06A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bWalkSpline;                                       // 0x06A1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
