#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RC

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "RC_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RC.RCUiWidget.PlayWidgetAnimation
// 0x0030 (0x0030 - 0x0000)
struct RCUiWidget_PlayWidgetAnimation final
{
public:
	class UWidgetAnimation*                       InOneShotAnimation;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       InLoopAnimation;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidgetAnimation*>               InOneShotAnimationArray;                           // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UWidgetAnimation*>               InLoopAnimationArray;                              // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCUiWidget_PlayWidgetAnimation) == 0x000008, "Wrong alignment on RCUiWidget_PlayWidgetAnimation");
static_assert(sizeof(RCUiWidget_PlayWidgetAnimation) == 0x000030, "Wrong size on RCUiWidget_PlayWidgetAnimation");
static_assert(offsetof(RCUiWidget_PlayWidgetAnimation, InOneShotAnimation) == 0x000000, "Member 'RCUiWidget_PlayWidgetAnimation::InOneShotAnimation' has a wrong offset!");
static_assert(offsetof(RCUiWidget_PlayWidgetAnimation, InLoopAnimation) == 0x000008, "Member 'RCUiWidget_PlayWidgetAnimation::InLoopAnimation' has a wrong offset!");
static_assert(offsetof(RCUiWidget_PlayWidgetAnimation, InOneShotAnimationArray) == 0x000010, "Member 'RCUiWidget_PlayWidgetAnimation::InOneShotAnimationArray' has a wrong offset!");
static_assert(offsetof(RCUiWidget_PlayWidgetAnimation, InLoopAnimationArray) == 0x000020, "Member 'RCUiWidget_PlayWidgetAnimation::InLoopAnimationArray' has a wrong offset!");

// Function RC.RCUiWidgetBase.IsWidgetPause
// 0x0001 (0x0001 - 0x0000)
struct RCUiWidgetBase_IsWidgetPause final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCUiWidgetBase_IsWidgetPause) == 0x000001, "Wrong alignment on RCUiWidgetBase_IsWidgetPause");
static_assert(sizeof(RCUiWidgetBase_IsWidgetPause) == 0x000001, "Wrong size on RCUiWidgetBase_IsWidgetPause");
static_assert(offsetof(RCUiWidgetBase_IsWidgetPause, ReturnValue) == 0x000000, "Member 'RCUiWidgetBase_IsWidgetPause::ReturnValue' has a wrong offset!");

// Function RC.RCUiWidgetBase.LoadCheck
// 0x0001 (0x0001 - 0x0000)
struct RCUiWidgetBase_LoadCheck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCUiWidgetBase_LoadCheck) == 0x000001, "Wrong alignment on RCUiWidgetBase_LoadCheck");
static_assert(sizeof(RCUiWidgetBase_LoadCheck) == 0x000001, "Wrong size on RCUiWidgetBase_LoadCheck");
static_assert(offsetof(RCUiWidgetBase_LoadCheck, ReturnValue) == 0x000000, "Member 'RCUiWidgetBase_LoadCheck::ReturnValue' has a wrong offset!");

// Function RC.RCUiWidgetBase.SetPosition
// 0x0008 (0x0008 - 0x0000)
struct RCUiWidgetBase_SetPosition final
{
public:
	struct FVector2D                              In2DPosition;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCUiWidgetBase_SetPosition) == 0x000004, "Wrong alignment on RCUiWidgetBase_SetPosition");
static_assert(sizeof(RCUiWidgetBase_SetPosition) == 0x000008, "Wrong size on RCUiWidgetBase_SetPosition");
static_assert(offsetof(RCUiWidgetBase_SetPosition, In2DPosition) == 0x000000, "Member 'RCUiWidgetBase_SetPosition::In2DPosition' has a wrong offset!");

// Function RC.RCNzUiFinalePGLayoutWidget.GetPGLayoutLocationAndSize
// 0x0010 (0x0010 - 0x0000)
struct RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize) == 0x000004, "Wrong alignment on RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize");
static_assert(sizeof(RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize) == 0x000010, "Wrong size on RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize, Location) == 0x000000, "Member 'RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize::Location' has a wrong offset!");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize, Size) == 0x000008, "Member 'RCNzUiFinalePGLayoutWidget_GetPGLayoutLocationAndSize::Size' has a wrong offset!");

// Function RC.RCNzUiFinalePGLayoutWidget.InitializeButtonGuide
// 0x0003 (0x0003 - 0x0000)
struct RCNzUiFinalePGLayoutWidget_InitializeButtonGuide final
{
public:
	ERCInputKeyType                               keyL;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERCInputKeyType                               keyR;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzUiFinalePGLayoutWidget_InitializeButtonGuide) == 0x000001, "Wrong alignment on RCNzUiFinalePGLayoutWidget_InitializeButtonGuide");
static_assert(sizeof(RCNzUiFinalePGLayoutWidget_InitializeButtonGuide) == 0x000003, "Wrong size on RCNzUiFinalePGLayoutWidget_InitializeButtonGuide");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_InitializeButtonGuide, keyL) == 0x000000, "Member 'RCNzUiFinalePGLayoutWidget_InitializeButtonGuide::keyL' has a wrong offset!");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_InitializeButtonGuide, keyR) == 0x000001, "Member 'RCNzUiFinalePGLayoutWidget_InitializeButtonGuide::keyR' has a wrong offset!");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_InitializeButtonGuide, ReturnValue) == 0x000002, "Member 'RCNzUiFinalePGLayoutWidget_InitializeButtonGuide::ReturnValue' has a wrong offset!");

// Function RC.RCNzUiFinalePGLayoutWidget.InitializePGLayoutWidget
// 0x0010 (0x0010 - 0x0000)
struct RCNzUiFinalePGLayoutWidget_InitializePGLayoutWidget final
{
public:
	TArray<EPageGuideType>                        PageList;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzUiFinalePGLayoutWidget_InitializePGLayoutWidget) == 0x000008, "Wrong alignment on RCNzUiFinalePGLayoutWidget_InitializePGLayoutWidget");
static_assert(sizeof(RCNzUiFinalePGLayoutWidget_InitializePGLayoutWidget) == 0x000010, "Wrong size on RCNzUiFinalePGLayoutWidget_InitializePGLayoutWidget");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_InitializePGLayoutWidget, PageList) == 0x000000, "Member 'RCNzUiFinalePGLayoutWidget_InitializePGLayoutWidget::PageList' has a wrong offset!");

// Function RC.RCNzUiFinalePGLayoutWidget.MovePage
// 0x0004 (0x0004 - 0x0000)
struct RCNzUiFinalePGLayoutWidget_MovePage final
{
public:
	int32                                         targetIdx;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzUiFinalePGLayoutWidget_MovePage) == 0x000004, "Wrong alignment on RCNzUiFinalePGLayoutWidget_MovePage");
static_assert(sizeof(RCNzUiFinalePGLayoutWidget_MovePage) == 0x000004, "Wrong size on RCNzUiFinalePGLayoutWidget_MovePage");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_MovePage, targetIdx) == 0x000000, "Member 'RCNzUiFinalePGLayoutWidget_MovePage::targetIdx' has a wrong offset!");

// Function RC.RCNzUiFinalePGLayoutWidget.OnButtonGuideClick
// 0x0001 (0x0001 - 0x0000)
struct RCNzUiFinalePGLayoutWidget_OnButtonGuideClick final
{
public:
	ERCInputKeyType                               KeyType;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzUiFinalePGLayoutWidget_OnButtonGuideClick) == 0x000001, "Wrong alignment on RCNzUiFinalePGLayoutWidget_OnButtonGuideClick");
static_assert(sizeof(RCNzUiFinalePGLayoutWidget_OnButtonGuideClick) == 0x000001, "Wrong size on RCNzUiFinalePGLayoutWidget_OnButtonGuideClick");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_OnButtonGuideClick, KeyType) == 0x000000, "Member 'RCNzUiFinalePGLayoutWidget_OnButtonGuideClick::KeyType' has a wrong offset!");

// Function RC.RCNzUiFinalePGLayoutWidget.UpdatePageGuide
// 0x0010 (0x0010 - 0x0000)
struct RCNzUiFinalePGLayoutWidget_UpdatePageGuide final
{
public:
	TArray<EPageGuideType>                        PageList;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzUiFinalePGLayoutWidget_UpdatePageGuide) == 0x000008, "Wrong alignment on RCNzUiFinalePGLayoutWidget_UpdatePageGuide");
static_assert(sizeof(RCNzUiFinalePGLayoutWidget_UpdatePageGuide) == 0x000010, "Wrong size on RCNzUiFinalePGLayoutWidget_UpdatePageGuide");
static_assert(offsetof(RCNzUiFinalePGLayoutWidget_UpdatePageGuide, PageList) == 0x000000, "Member 'RCNzUiFinalePGLayoutWidget_UpdatePageGuide::PageList' has a wrong offset!");

// Function RC.RCActor.GetActorName
// 0x0008 (0x0008 - 0x0000)
struct RCActor_GetActorName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCActor_GetActorName) == 0x000004, "Wrong alignment on RCActor_GetActorName");
static_assert(sizeof(RCActor_GetActorName) == 0x000008, "Wrong size on RCActor_GetActorName");
static_assert(offsetof(RCActor_GetActorName, ReturnValue) == 0x000000, "Member 'RCActor_GetActorName::ReturnValue' has a wrong offset!");

// Function RC.RCActor.IsPause
// 0x0001 (0x0001 - 0x0000)
struct RCActor_IsPause final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCActor_IsPause) == 0x000001, "Wrong alignment on RCActor_IsPause");
static_assert(sizeof(RCActor_IsPause) == 0x000001, "Wrong size on RCActor_IsPause");
static_assert(offsetof(RCActor_IsPause, ReturnValue) == 0x000000, "Member 'RCActor_IsPause::ReturnValue' has a wrong offset!");

// Function RC.RCActor.IsPauseCancelFlag
// 0x0001 (0x0001 - 0x0000)
struct RCActor_IsPauseCancelFlag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCActor_IsPauseCancelFlag) == 0x000001, "Wrong alignment on RCActor_IsPauseCancelFlag");
static_assert(sizeof(RCActor_IsPauseCancelFlag) == 0x000001, "Wrong size on RCActor_IsPauseCancelFlag");
static_assert(offsetof(RCActor_IsPauseCancelFlag, ReturnValue) == 0x000000, "Member 'RCActor_IsPauseCancelFlag::ReturnValue' has a wrong offset!");

// Function RC.RCActor.IsVisibility
// 0x0001 (0x0001 - 0x0000)
struct RCActor_IsVisibility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCActor_IsVisibility) == 0x000001, "Wrong alignment on RCActor_IsVisibility");
static_assert(sizeof(RCActor_IsVisibility) == 0x000001, "Wrong size on RCActor_IsVisibility");
static_assert(offsetof(RCActor_IsVisibility, ReturnValue) == 0x000000, "Member 'RCActor_IsVisibility::ReturnValue' has a wrong offset!");

// Function RC.RCActor.SetPause
// 0x0002 (0x0002 - 0x0000)
struct RCActor_SetPause final
{
public:
	bool                                          bInPause;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirect;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCActor_SetPause) == 0x000001, "Wrong alignment on RCActor_SetPause");
static_assert(sizeof(RCActor_SetPause) == 0x000002, "Wrong size on RCActor_SetPause");
static_assert(offsetof(RCActor_SetPause, bInPause) == 0x000000, "Member 'RCActor_SetPause::bInPause' has a wrong offset!");
static_assert(offsetof(RCActor_SetPause, bDirect) == 0x000001, "Member 'RCActor_SetPause::bDirect' has a wrong offset!");

// Function RC.RCActor.SetPauseCancelFlag
// 0x0001 (0x0001 - 0x0000)
struct RCActor_SetPauseCancelFlag final
{
public:
	bool                                          bInPauseCancel;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCActor_SetPauseCancelFlag) == 0x000001, "Wrong alignment on RCActor_SetPauseCancelFlag");
static_assert(sizeof(RCActor_SetPauseCancelFlag) == 0x000001, "Wrong size on RCActor_SetPauseCancelFlag");
static_assert(offsetof(RCActor_SetPauseCancelFlag, bInPauseCancel) == 0x000000, "Member 'RCActor_SetPauseCancelFlag::bInPauseCancel' has a wrong offset!");

// Function RC.RCActor.SetVisibility
// 0x0002 (0x0002 - 0x0000)
struct RCActor_SetVisibility final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirect;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCActor_SetVisibility) == 0x000001, "Wrong alignment on RCActor_SetVisibility");
static_assert(sizeof(RCActor_SetVisibility) == 0x000002, "Wrong size on RCActor_SetVisibility");
static_assert(offsetof(RCActor_SetVisibility, bInVisible) == 0x000000, "Member 'RCActor_SetVisibility::bInVisible' has a wrong offset!");
static_assert(offsetof(RCActor_SetVisibility, bDirect) == 0x000001, "Member 'RCActor_SetVisibility::bDirect' has a wrong offset!");

// Function RC.RCAutoPlay.AutoPlay
// 0x0028 (0x0028 - 0x0000)
struct RCAutoPlay_AutoPlay final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Dist;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreZ;                                           // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERCAutoPlayCompletionPred                     Completion;                                        // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URCAutoPlay*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCAutoPlay_AutoPlay) == 0x000008, "Wrong alignment on RCAutoPlay_AutoPlay");
static_assert(sizeof(RCAutoPlay_AutoPlay) == 0x000028, "Wrong size on RCAutoPlay_AutoPlay");
static_assert(offsetof(RCAutoPlay_AutoPlay, WorldContextObject) == 0x000000, "Member 'RCAutoPlay_AutoPlay::WorldContextObject' has a wrong offset!");
static_assert(offsetof(RCAutoPlay_AutoPlay, Target) == 0x000008, "Member 'RCAutoPlay_AutoPlay::Target' has a wrong offset!");
static_assert(offsetof(RCAutoPlay_AutoPlay, Dist) == 0x000010, "Member 'RCAutoPlay_AutoPlay::Dist' has a wrong offset!");
static_assert(offsetof(RCAutoPlay_AutoPlay, Duration) == 0x000018, "Member 'RCAutoPlay_AutoPlay::Duration' has a wrong offset!");
static_assert(offsetof(RCAutoPlay_AutoPlay, IgnoreZ) == 0x00001C, "Member 'RCAutoPlay_AutoPlay::IgnoreZ' has a wrong offset!");
static_assert(offsetof(RCAutoPlay_AutoPlay, Completion) == 0x00001D, "Member 'RCAutoPlay_AutoPlay::Completion' has a wrong offset!");
static_assert(offsetof(RCAutoPlay_AutoPlay, ReturnValue) == 0x000020, "Member 'RCAutoPlay_AutoPlay::ReturnValue' has a wrong offset!");

// Function RC.RCAutoPlayActor.AutoPlayActor
// 0x0028 (0x0028 - 0x0000)
struct RCAutoPlayActor_AutoPlayActor final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Dist;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreZ;                                           // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERCAutoPlayCompletionPred                     Completion;                                        // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARCAutoPlayActor*                       ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCAutoPlayActor_AutoPlayActor) == 0x000008, "Wrong alignment on RCAutoPlayActor_AutoPlayActor");
static_assert(sizeof(RCAutoPlayActor_AutoPlayActor) == 0x000028, "Wrong size on RCAutoPlayActor_AutoPlayActor");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor, WorldContextObject) == 0x000000, "Member 'RCAutoPlayActor_AutoPlayActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor, Target) == 0x000008, "Member 'RCAutoPlayActor_AutoPlayActor::Target' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor, Dist) == 0x000010, "Member 'RCAutoPlayActor_AutoPlayActor::Dist' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor, Duration) == 0x000018, "Member 'RCAutoPlayActor_AutoPlayActor::Duration' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor, IgnoreZ) == 0x00001C, "Member 'RCAutoPlayActor_AutoPlayActor::IgnoreZ' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor, Completion) == 0x00001D, "Member 'RCAutoPlayActor_AutoPlayActor::Completion' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor, ReturnValue) == 0x000020, "Member 'RCAutoPlayActor_AutoPlayActor::ReturnValue' has a wrong offset!");

// Function RC.RCAutoPlayActor.AutoPlayActor2
// 0x0038 (0x0038 - 0x0000)
struct RCAutoPlayActor_AutoPlayActor2 final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InDistPos;                                         // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InDistRot;                                         // 0x001C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreZ;                                           // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERCAutoPlayCompletionPred                     Completion;                                        // 0x002D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARCAutoPlayActor*                       ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCAutoPlayActor_AutoPlayActor2) == 0x000008, "Wrong alignment on RCAutoPlayActor_AutoPlayActor2");
static_assert(sizeof(RCAutoPlayActor_AutoPlayActor2) == 0x000038, "Wrong size on RCAutoPlayActor_AutoPlayActor2");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, WorldContextObject) == 0x000000, "Member 'RCAutoPlayActor_AutoPlayActor2::WorldContextObject' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, Target) == 0x000008, "Member 'RCAutoPlayActor_AutoPlayActor2::Target' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, InDistPos) == 0x000010, "Member 'RCAutoPlayActor_AutoPlayActor2::InDistPos' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, InDistRot) == 0x00001C, "Member 'RCAutoPlayActor_AutoPlayActor2::InDistRot' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, Duration) == 0x000028, "Member 'RCAutoPlayActor_AutoPlayActor2::Duration' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, IgnoreZ) == 0x00002C, "Member 'RCAutoPlayActor_AutoPlayActor2::IgnoreZ' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, Completion) == 0x00002D, "Member 'RCAutoPlayActor_AutoPlayActor2::Completion' has a wrong offset!");
static_assert(offsetof(RCAutoPlayActor_AutoPlayActor2, ReturnValue) == 0x000030, "Member 'RCAutoPlayActor_AutoPlayActor2::ReturnValue' has a wrong offset!");

// Function RC.RCGrassTransformer.StopUpdateInstance
// 0x0004 (0x0004 - 0x0000)
struct RCGrassTransformer_StopUpdateInstance final
{
public:
	int32                                         InstanceIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCGrassTransformer_StopUpdateInstance) == 0x000004, "Wrong alignment on RCGrassTransformer_StopUpdateInstance");
static_assert(sizeof(RCGrassTransformer_StopUpdateInstance) == 0x000004, "Wrong size on RCGrassTransformer_StopUpdateInstance");
static_assert(offsetof(RCGrassTransformer_StopUpdateInstance, InstanceIndex) == 0x000000, "Member 'RCGrassTransformer_StopUpdateInstance::InstanceIndex' has a wrong offset!");

// Function RC.RCCSVData.SetDataTable
// 0x0008 (0x0008 - 0x0000)
struct RCCSVData_SetDataTable final
{
public:
	class UDataTable*                             pDataTable;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCSVData_SetDataTable) == 0x000008, "Wrong alignment on RCCSVData_SetDataTable");
static_assert(sizeof(RCCSVData_SetDataTable) == 0x000008, "Wrong size on RCCSVData_SetDataTable");
static_assert(offsetof(RCCSVData_SetDataTable, pDataTable) == 0x000000, "Member 'RCCSVData_SetDataTable::pDataTable' has a wrong offset!");

// Function RC.RCText3DActorBFL.GetText
// 0x0020 (0x0020 - 0x0000)
struct RCText3DActorBFL_GetText final
{
public:
	class FName                                   InActorName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCText3DActorBFL_GetText) == 0x000008, "Wrong alignment on RCText3DActorBFL_GetText");
static_assert(sizeof(RCText3DActorBFL_GetText) == 0x000020, "Wrong size on RCText3DActorBFL_GetText");
static_assert(offsetof(RCText3DActorBFL_GetText, InActorName) == 0x000000, "Member 'RCText3DActorBFL_GetText::InActorName' has a wrong offset!");
static_assert(offsetof(RCText3DActorBFL_GetText, ReturnValue) == 0x000008, "Member 'RCText3DActorBFL_GetText::ReturnValue' has a wrong offset!");

// Function RC.RCText3DActorBFL.GetText3DActor
// 0x0010 (0x0010 - 0x0000)
struct RCText3DActorBFL_GetText3DActor final
{
public:
	class FName                                   InActorName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARCText3DActor*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCText3DActorBFL_GetText3DActor) == 0x000008, "Wrong alignment on RCText3DActorBFL_GetText3DActor");
static_assert(sizeof(RCText3DActorBFL_GetText3DActor) == 0x000010, "Wrong size on RCText3DActorBFL_GetText3DActor");
static_assert(offsetof(RCText3DActorBFL_GetText3DActor, InActorName) == 0x000000, "Member 'RCText3DActorBFL_GetText3DActor::InActorName' has a wrong offset!");
static_assert(offsetof(RCText3DActorBFL_GetText3DActor, ReturnValue) == 0x000008, "Member 'RCText3DActorBFL_GetText3DActor::ReturnValue' has a wrong offset!");

// Function RC.RCText3DActorBFL.GetTextID
// 0x0010 (0x0010 - 0x0000)
struct RCText3DActorBFL_GetTextID final
{
public:
	class FName                                   InActorName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCText3DActorBFL_GetTextID) == 0x000004, "Wrong alignment on RCText3DActorBFL_GetTextID");
static_assert(sizeof(RCText3DActorBFL_GetTextID) == 0x000010, "Wrong size on RCText3DActorBFL_GetTextID");
static_assert(offsetof(RCText3DActorBFL_GetTextID, InActorName) == 0x000000, "Member 'RCText3DActorBFL_GetTextID::InActorName' has a wrong offset!");
static_assert(offsetof(RCText3DActorBFL_GetTextID, ReturnValue) == 0x000008, "Member 'RCText3DActorBFL_GetTextID::ReturnValue' has a wrong offset!");

// Function RC.RCText3DActorBFL.IsVisibility
// 0x000C (0x000C - 0x0000)
struct RCText3DActorBFL_IsVisibility final
{
public:
	class FName                                   InActorName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RCText3DActorBFL_IsVisibility) == 0x000004, "Wrong alignment on RCText3DActorBFL_IsVisibility");
static_assert(sizeof(RCText3DActorBFL_IsVisibility) == 0x00000C, "Wrong size on RCText3DActorBFL_IsVisibility");
static_assert(offsetof(RCText3DActorBFL_IsVisibility, InActorName) == 0x000000, "Member 'RCText3DActorBFL_IsVisibility::InActorName' has a wrong offset!");
static_assert(offsetof(RCText3DActorBFL_IsVisibility, ReturnValue) == 0x000008, "Member 'RCText3DActorBFL_IsVisibility::ReturnValue' has a wrong offset!");

// Function RC.RCText3DActorBFL.SetTextID
// 0x0010 (0x0010 - 0x0000)
struct RCText3DActorBFL_SetTextID final
{
public:
	class FName                                   InActorName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InTextID;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCText3DActorBFL_SetTextID) == 0x000004, "Wrong alignment on RCText3DActorBFL_SetTextID");
static_assert(sizeof(RCText3DActorBFL_SetTextID) == 0x000010, "Wrong size on RCText3DActorBFL_SetTextID");
static_assert(offsetof(RCText3DActorBFL_SetTextID, InActorName) == 0x000000, "Member 'RCText3DActorBFL_SetTextID::InActorName' has a wrong offset!");
static_assert(offsetof(RCText3DActorBFL_SetTextID, InTextID) == 0x000008, "Member 'RCText3DActorBFL_SetTextID::InTextID' has a wrong offset!");

// Function RC.RCText3DActorBFL.SetVisibility
// 0x000C (0x000C - 0x0000)
struct RCText3DActorBFL_SetVisibility final
{
public:
	class FName                                   InActorName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInVisible;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirect;                                           // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RCText3DActorBFL_SetVisibility) == 0x000004, "Wrong alignment on RCText3DActorBFL_SetVisibility");
static_assert(sizeof(RCText3DActorBFL_SetVisibility) == 0x00000C, "Wrong size on RCText3DActorBFL_SetVisibility");
static_assert(offsetof(RCText3DActorBFL_SetVisibility, InActorName) == 0x000000, "Member 'RCText3DActorBFL_SetVisibility::InActorName' has a wrong offset!");
static_assert(offsetof(RCText3DActorBFL_SetVisibility, bInVisible) == 0x000008, "Member 'RCText3DActorBFL_SetVisibility::bInVisible' has a wrong offset!");
static_assert(offsetof(RCText3DActorBFL_SetVisibility, bDirect) == 0x000009, "Member 'RCText3DActorBFL_SetVisibility::bDirect' has a wrong offset!");

// Function RC.RCBackDropActor.AddPoint
// 0x001C (0x001C - 0x0000)
struct RCBackDropActor_AddPoint final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         W;                                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         H;                                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Xbrock;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Ybrock;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCBackDropActor_AddPoint) == 0x000004, "Wrong alignment on RCBackDropActor_AddPoint");
static_assert(sizeof(RCBackDropActor_AddPoint) == 0x00001C, "Wrong size on RCBackDropActor_AddPoint");
static_assert(offsetof(RCBackDropActor_AddPoint, Pos) == 0x000000, "Member 'RCBackDropActor_AddPoint::Pos' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_AddPoint, W) == 0x00000C, "Member 'RCBackDropActor_AddPoint::W' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_AddPoint, H) == 0x000010, "Member 'RCBackDropActor_AddPoint::H' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_AddPoint, Xbrock) == 0x000014, "Member 'RCBackDropActor_AddPoint::Xbrock' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_AddPoint, Ybrock) == 0x000018, "Member 'RCBackDropActor_AddPoint::Ybrock' has a wrong offset!");

// Function RC.RCBackDropActor.Bake
// 0x0004 (0x0004 - 0x0000)
struct RCBackDropActor_Bake final
{
public:
	int32                                         brockSize;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCBackDropActor_Bake) == 0x000004, "Wrong alignment on RCBackDropActor_Bake");
static_assert(sizeof(RCBackDropActor_Bake) == 0x000004, "Wrong size on RCBackDropActor_Bake");
static_assert(offsetof(RCBackDropActor_Bake, brockSize) == 0x000000, "Member 'RCBackDropActor_Bake::brockSize' has a wrong offset!");

// Function RC.RCBackDropActor.MakeScanMap
// 0x0024 (0x0024 - 0x0000)
struct RCBackDropActor_MakeScanMap final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         startX;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         startY;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         endX;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         endY;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BrockSizeX;                                        // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BrockSizeY;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCBackDropActor_MakeScanMap) == 0x000004, "Wrong alignment on RCBackDropActor_MakeScanMap");
static_assert(sizeof(RCBackDropActor_MakeScanMap) == 0x000024, "Wrong size on RCBackDropActor_MakeScanMap");
static_assert(offsetof(RCBackDropActor_MakeScanMap, Pos) == 0x000000, "Member 'RCBackDropActor_MakeScanMap::Pos' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_MakeScanMap, startX) == 0x00000C, "Member 'RCBackDropActor_MakeScanMap::startX' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_MakeScanMap, startY) == 0x000010, "Member 'RCBackDropActor_MakeScanMap::startY' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_MakeScanMap, endX) == 0x000014, "Member 'RCBackDropActor_MakeScanMap::endX' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_MakeScanMap, endY) == 0x000018, "Member 'RCBackDropActor_MakeScanMap::endY' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_MakeScanMap, BrockSizeX) == 0x00001C, "Member 'RCBackDropActor_MakeScanMap::BrockSizeX' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_MakeScanMap, BrockSizeY) == 0x000020, "Member 'RCBackDropActor_MakeScanMap::BrockSizeY' has a wrong offset!");

// Function RC.RCBackDropActor.NeedScap
// 0x0001 (0x0001 - 0x0000)
struct RCBackDropActor_NeedScap final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCBackDropActor_NeedScap) == 0x000001, "Wrong alignment on RCBackDropActor_NeedScap");
static_assert(sizeof(RCBackDropActor_NeedScap) == 0x000001, "Wrong size on RCBackDropActor_NeedScap");
static_assert(offsetof(RCBackDropActor_NeedScap, ReturnValue) == 0x000000, "Member 'RCBackDropActor_NeedScap::ReturnValue' has a wrong offset!");

// Function RC.RCBackDropActor.RGBA2Hight
// 0x0020 (0x0020 - 0x0000)
struct RCBackDropActor_RGBA2Hight final
{
public:
	struct FVector4                               col;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RCBackDropActor_RGBA2Hight) == 0x000010, "Wrong alignment on RCBackDropActor_RGBA2Hight");
static_assert(sizeof(RCBackDropActor_RGBA2Hight) == 0x000020, "Wrong size on RCBackDropActor_RGBA2Hight");
static_assert(offsetof(RCBackDropActor_RGBA2Hight, col) == 0x000000, "Member 'RCBackDropActor_RGBA2Hight::col' has a wrong offset!");
static_assert(offsetof(RCBackDropActor_RGBA2Hight, ReturnValue) == 0x000010, "Member 'RCBackDropActor_RGBA2Hight::ReturnValue' has a wrong offset!");

// Function RC.RCCharacter.IsPause
// 0x0001 (0x0001 - 0x0000)
struct RCCharacter_IsPause final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_IsPause) == 0x000001, "Wrong alignment on RCCharacter_IsPause");
static_assert(sizeof(RCCharacter_IsPause) == 0x000001, "Wrong size on RCCharacter_IsPause");
static_assert(offsetof(RCCharacter_IsPause, ReturnValue) == 0x000000, "Member 'RCCharacter_IsPause::ReturnValue' has a wrong offset!");

// Function RC.RCCharacter.IsPauseCancelFlag
// 0x0001 (0x0001 - 0x0000)
struct RCCharacter_IsPauseCancelFlag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_IsPauseCancelFlag) == 0x000001, "Wrong alignment on RCCharacter_IsPauseCancelFlag");
static_assert(sizeof(RCCharacter_IsPauseCancelFlag) == 0x000001, "Wrong size on RCCharacter_IsPauseCancelFlag");
static_assert(offsetof(RCCharacter_IsPauseCancelFlag, ReturnValue) == 0x000000, "Member 'RCCharacter_IsPauseCancelFlag::ReturnValue' has a wrong offset!");

// Function RC.RCCharacter.IsSimulatePhysicsFlag
// 0x0001 (0x0001 - 0x0000)
struct RCCharacter_IsSimulatePhysicsFlag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_IsSimulatePhysicsFlag) == 0x000001, "Wrong alignment on RCCharacter_IsSimulatePhysicsFlag");
static_assert(sizeof(RCCharacter_IsSimulatePhysicsFlag) == 0x000001, "Wrong size on RCCharacter_IsSimulatePhysicsFlag");
static_assert(offsetof(RCCharacter_IsSimulatePhysicsFlag, ReturnValue) == 0x000000, "Member 'RCCharacter_IsSimulatePhysicsFlag::ReturnValue' has a wrong offset!");

// Function RC.RCCharacter.IsVisibility
// 0x0001 (0x0001 - 0x0000)
struct RCCharacter_IsVisibility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_IsVisibility) == 0x000001, "Wrong alignment on RCCharacter_IsVisibility");
static_assert(sizeof(RCCharacter_IsVisibility) == 0x000001, "Wrong size on RCCharacter_IsVisibility");
static_assert(offsetof(RCCharacter_IsVisibility, ReturnValue) == 0x000000, "Member 'RCCharacter_IsVisibility::ReturnValue' has a wrong offset!");

// Function RC.RCCharacter.SetPause
// 0x0002 (0x0002 - 0x0000)
struct RCCharacter_SetPause final
{
public:
	bool                                          bPauseFlag;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirectFlag;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_SetPause) == 0x000001, "Wrong alignment on RCCharacter_SetPause");
static_assert(sizeof(RCCharacter_SetPause) == 0x000002, "Wrong size on RCCharacter_SetPause");
static_assert(offsetof(RCCharacter_SetPause, bPauseFlag) == 0x000000, "Member 'RCCharacter_SetPause::bPauseFlag' has a wrong offset!");
static_assert(offsetof(RCCharacter_SetPause, bDirectFlag) == 0x000001, "Member 'RCCharacter_SetPause::bDirectFlag' has a wrong offset!");

// Function RC.RCCharacter.SetPauseCancelFlag
// 0x0001 (0x0001 - 0x0000)
struct RCCharacter_SetPauseCancelFlag final
{
public:
	bool                                          bInPauseCancel;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_SetPauseCancelFlag) == 0x000001, "Wrong alignment on RCCharacter_SetPauseCancelFlag");
static_assert(sizeof(RCCharacter_SetPauseCancelFlag) == 0x000001, "Wrong size on RCCharacter_SetPauseCancelFlag");
static_assert(offsetof(RCCharacter_SetPauseCancelFlag, bInPauseCancel) == 0x000000, "Member 'RCCharacter_SetPauseCancelFlag::bInPauseCancel' has a wrong offset!");

// Function RC.RCCharacter.SetSimulatePhysicsFlag
// 0x0002 (0x0002 - 0x0000)
struct RCCharacter_SetSimulatePhysicsFlag final
{
public:
	bool                                          bInSimulatePhysics;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInDirect;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_SetSimulatePhysicsFlag) == 0x000001, "Wrong alignment on RCCharacter_SetSimulatePhysicsFlag");
static_assert(sizeof(RCCharacter_SetSimulatePhysicsFlag) == 0x000002, "Wrong size on RCCharacter_SetSimulatePhysicsFlag");
static_assert(offsetof(RCCharacter_SetSimulatePhysicsFlag, bInSimulatePhysics) == 0x000000, "Member 'RCCharacter_SetSimulatePhysicsFlag::bInSimulatePhysics' has a wrong offset!");
static_assert(offsetof(RCCharacter_SetSimulatePhysicsFlag, bInDirect) == 0x000001, "Member 'RCCharacter_SetSimulatePhysicsFlag::bInDirect' has a wrong offset!");

// Function RC.RCCharacter.SetVisibility
// 0x0003 (0x0003 - 0x0000)
struct RCCharacter_SetVisibility final
{
public:
	bool                                          bVisibleFlag;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirectFlag;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCollision;                                      // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacter_SetVisibility) == 0x000001, "Wrong alignment on RCCharacter_SetVisibility");
static_assert(sizeof(RCCharacter_SetVisibility) == 0x000003, "Wrong size on RCCharacter_SetVisibility");
static_assert(offsetof(RCCharacter_SetVisibility, bVisibleFlag) == 0x000000, "Member 'RCCharacter_SetVisibility::bVisibleFlag' has a wrong offset!");
static_assert(offsetof(RCCharacter_SetVisibility, bDirectFlag) == 0x000001, "Member 'RCCharacter_SetVisibility::bDirectFlag' has a wrong offset!");
static_assert(offsetof(RCCharacter_SetVisibility, bIsCollision) == 0x000002, "Member 'RCCharacter_SetVisibility::bIsCollision' has a wrong offset!");

// Function RC.RCCharacterScript.GetActorLocationBalloon
// 0x000C (0x000C - 0x0000)
struct RCCharacterScript_GetActorLocationBalloon final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_GetActorLocationBalloon) == 0x000004, "Wrong alignment on RCCharacterScript_GetActorLocationBalloon");
static_assert(sizeof(RCCharacterScript_GetActorLocationBalloon) == 0x00000C, "Wrong size on RCCharacterScript_GetActorLocationBalloon");
static_assert(offsetof(RCCharacterScript_GetActorLocationBalloon, ReturnValue) == 0x000000, "Member 'RCCharacterScript_GetActorLocationBalloon::ReturnValue' has a wrong offset!");

// Function RC.RCCharacterScript.GetActorLocationFoot
// 0x000C (0x000C - 0x0000)
struct RCCharacterScript_GetActorLocationFoot final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_GetActorLocationFoot) == 0x000004, "Wrong alignment on RCCharacterScript_GetActorLocationFoot");
static_assert(sizeof(RCCharacterScript_GetActorLocationFoot) == 0x00000C, "Wrong size on RCCharacterScript_GetActorLocationFoot");
static_assert(offsetof(RCCharacterScript_GetActorLocationFoot, ReturnValue) == 0x000000, "Member 'RCCharacterScript_GetActorLocationFoot::ReturnValue' has a wrong offset!");

// Function RC.RCCharacterScript.GetDirectionAmount
// 0x0004 (0x0004 - 0x0000)
struct RCCharacterScript_GetDirectionAmount final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_GetDirectionAmount) == 0x000004, "Wrong alignment on RCCharacterScript_GetDirectionAmount");
static_assert(sizeof(RCCharacterScript_GetDirectionAmount) == 0x000004, "Wrong size on RCCharacterScript_GetDirectionAmount");
static_assert(offsetof(RCCharacterScript_GetDirectionAmount, ReturnValue) == 0x000000, "Member 'RCCharacterScript_GetDirectionAmount::ReturnValue' has a wrong offset!");

// Function RC.RCCharacterScript.GetFootIKData
// 0x0064 (0x0064 - 0x0000)
struct RCCharacterScript_GetFootIKData final
{
public:
	struct FRCScriptActorFootIKData               ReturnValue;                                       // 0x0000(0x0064)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_GetFootIKData) == 0x000004, "Wrong alignment on RCCharacterScript_GetFootIKData");
static_assert(sizeof(RCCharacterScript_GetFootIKData) == 0x000064, "Wrong size on RCCharacterScript_GetFootIKData");
static_assert(offsetof(RCCharacterScript_GetFootIKData, ReturnValue) == 0x000000, "Member 'RCCharacterScript_GetFootIKData::ReturnValue' has a wrong offset!");

// Function RC.RCCharacterScript.GetMaxVelocityLengthInFrames
// 0x0004 (0x0004 - 0x0000)
struct RCCharacterScript_GetMaxVelocityLengthInFrames final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_GetMaxVelocityLengthInFrames) == 0x000004, "Wrong alignment on RCCharacterScript_GetMaxVelocityLengthInFrames");
static_assert(sizeof(RCCharacterScript_GetMaxVelocityLengthInFrames) == 0x000004, "Wrong size on RCCharacterScript_GetMaxVelocityLengthInFrames");
static_assert(offsetof(RCCharacterScript_GetMaxVelocityLengthInFrames, ReturnValue) == 0x000000, "Member 'RCCharacterScript_GetMaxVelocityLengthInFrames::ReturnValue' has a wrong offset!");

// Function RC.RCCharacterScript.GetMoveSpeed
// 0x0004 (0x0004 - 0x0000)
struct RCCharacterScript_GetMoveSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_GetMoveSpeed) == 0x000004, "Wrong alignment on RCCharacterScript_GetMoveSpeed");
static_assert(sizeof(RCCharacterScript_GetMoveSpeed) == 0x000004, "Wrong size on RCCharacterScript_GetMoveSpeed");
static_assert(offsetof(RCCharacterScript_GetMoveSpeed, ReturnValue) == 0x000000, "Member 'RCCharacterScript_GetMoveSpeed::ReturnValue' has a wrong offset!");

// Function RC.RCCharacterScript.IsMoveEnd
// 0x0001 (0x0001 - 0x0000)
struct RCCharacterScript_IsMoveEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_IsMoveEnd) == 0x000001, "Wrong alignment on RCCharacterScript_IsMoveEnd");
static_assert(sizeof(RCCharacterScript_IsMoveEnd) == 0x000001, "Wrong size on RCCharacterScript_IsMoveEnd");
static_assert(offsetof(RCCharacterScript_IsMoveEnd, ReturnValue) == 0x000000, "Member 'RCCharacterScript_IsMoveEnd::ReturnValue' has a wrong offset!");

// Function RC.RCCharacterScript.RestoreMovePosition
// 0x0004 (0x0004 - 0x0000)
struct RCCharacterScript_RestoreMovePosition final
{
public:
	float                                         SpeedScale;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_RestoreMovePosition) == 0x000004, "Wrong alignment on RCCharacterScript_RestoreMovePosition");
static_assert(sizeof(RCCharacterScript_RestoreMovePosition) == 0x000004, "Wrong size on RCCharacterScript_RestoreMovePosition");
static_assert(offsetof(RCCharacterScript_RestoreMovePosition, SpeedScale) == 0x000000, "Member 'RCCharacterScript_RestoreMovePosition::SpeedScale' has a wrong offset!");

// Function RC.RCCharacterScript.RestoreRotationYaw
// 0x0008 (0x0008 - 0x0000)
struct RCCharacterScript_RestoreRotationYaw final
{
public:
	float                                         SpeedScale;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirect;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RCCharacterScript_RestoreRotationYaw) == 0x000004, "Wrong alignment on RCCharacterScript_RestoreRotationYaw");
static_assert(sizeof(RCCharacterScript_RestoreRotationYaw) == 0x000008, "Wrong size on RCCharacterScript_RestoreRotationYaw");
static_assert(offsetof(RCCharacterScript_RestoreRotationYaw, SpeedScale) == 0x000000, "Member 'RCCharacterScript_RestoreRotationYaw::SpeedScale' has a wrong offset!");
static_assert(offsetof(RCCharacterScript_RestoreRotationYaw, bDirect) == 0x000004, "Member 'RCCharacterScript_RestoreRotationYaw::bDirect' has a wrong offset!");

// Function RC.RCCharacterScript.SetMovePause
// 0x0001 (0x0001 - 0x0000)
struct RCCharacterScript_SetMovePause final
{
public:
	bool                                          bInMovePause;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_SetMovePause) == 0x000001, "Wrong alignment on RCCharacterScript_SetMovePause");
static_assert(sizeof(RCCharacterScript_SetMovePause) == 0x000001, "Wrong size on RCCharacterScript_SetMovePause");
static_assert(offsetof(RCCharacterScript_SetMovePause, bInMovePause) == 0x000000, "Member 'RCCharacterScript_SetMovePause::bInMovePause' has a wrong offset!");

// Function RC.RCCharacterScript.SetMoveSpeed
// 0x0008 (0x0008 - 0x0000)
struct RCCharacterScript_SetMoveSpeed final
{
public:
	float                                         InWalkSpeed;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRunSpeed;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_SetMoveSpeed) == 0x000004, "Wrong alignment on RCCharacterScript_SetMoveSpeed");
static_assert(sizeof(RCCharacterScript_SetMoveSpeed) == 0x000008, "Wrong size on RCCharacterScript_SetMoveSpeed");
static_assert(offsetof(RCCharacterScript_SetMoveSpeed, InWalkSpeed) == 0x000000, "Member 'RCCharacterScript_SetMoveSpeed::InWalkSpeed' has a wrong offset!");
static_assert(offsetof(RCCharacterScript_SetMoveSpeed, InRunSpeed) == 0x000004, "Member 'RCCharacterScript_SetMoveSpeed::InRunSpeed' has a wrong offset!");

// Function RC.RCCharacterScript.SetOrientRotationtoMovementFlag
// 0x0001 (0x0001 - 0x0000)
struct RCCharacterScript_SetOrientRotationtoMovementFlag final
{
public:
	bool                                          bFlag;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCCharacterScript_SetOrientRotationtoMovementFlag) == 0x000001, "Wrong alignment on RCCharacterScript_SetOrientRotationtoMovementFlag");
static_assert(sizeof(RCCharacterScript_SetOrientRotationtoMovementFlag) == 0x000001, "Wrong size on RCCharacterScript_SetOrientRotationtoMovementFlag");
