#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RCEffect

#include "Basic.hpp"


namespace SDK
{

// Enum RCEffect.ERCAttachRotRule
// NumValues: 0x0007
enum class ERCAttachRotRule : uint8
{
	None                                     = 0,
	ChrFront                                 = 1,
	ChrFrontZLock                            = 2,
	ChrMoveDir                               = 3,
	TwoBoneDir                               = 4,
	World                                    = 5,
	ERCAttachRotRule_MAX                     = 6,
};

// Enum RCEffect.ERCFreeTimelinePlayType
// NumValues: 0x0006
enum class ERCFreeTimelinePlayType : uint8
{
	None                                     = 0,
	Play                                     = 1,
	PlayLP                                   = 2,
	PlayOT                                   = 3,
	Stop                                     = 4,
	ERCFreeTimelinePlayType_MAX              = 5,
};

// ScriptStruct RCEffect.RCAttachParamInfo
// 0x0020 (0x0020 - 0x0000)
struct FRCAttachParamInfo final
{
public:
	bool                                          bAttached;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LocationSocketName;                                // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERCAttachRotRule                              RotateSpawnedRule;                                 // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERCAttachRotRule                              RotateUpdateRule;                                  // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RotBaseSocketName1;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RotBaseSocketName2;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRCAttachParamInfo) == 0x000004, "Wrong alignment on FRCAttachParamInfo");
static_assert(sizeof(FRCAttachParamInfo) == 0x000020, "Wrong size on FRCAttachParamInfo");
static_assert(offsetof(FRCAttachParamInfo, bAttached) == 0x000000, "Member 'FRCAttachParamInfo::bAttached' has a wrong offset!");
static_assert(offsetof(FRCAttachParamInfo, LocationSocketName) == 0x000004, "Member 'FRCAttachParamInfo::LocationSocketName' has a wrong offset!");
static_assert(offsetof(FRCAttachParamInfo, RotateSpawnedRule) == 0x00000C, "Member 'FRCAttachParamInfo::RotateSpawnedRule' has a wrong offset!");
static_assert(offsetof(FRCAttachParamInfo, RotateUpdateRule) == 0x00000D, "Member 'FRCAttachParamInfo::RotateUpdateRule' has a wrong offset!");
static_assert(offsetof(FRCAttachParamInfo, RotBaseSocketName1) == 0x000010, "Member 'FRCAttachParamInfo::RotBaseSocketName1' has a wrong offset!");
static_assert(offsetof(FRCAttachParamInfo, RotBaseSocketName2) == 0x000018, "Member 'FRCAttachParamInfo::RotBaseSocketName2' has a wrong offset!");

}

