#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RCLoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function RCLoadingScreen.RCNzSceneChangeLoadingWidget.Finish
// 0x0001 (0x0001 - 0x0000)
struct RCNzSceneChangeLoadingWidget_Finish final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzSceneChangeLoadingWidget_Finish) == 0x000001, "Wrong alignment on RCNzSceneChangeLoadingWidget_Finish");
static_assert(sizeof(RCNzSceneChangeLoadingWidget_Finish) == 0x000001, "Wrong size on RCNzSceneChangeLoadingWidget_Finish");
static_assert(offsetof(RCNzSceneChangeLoadingWidget_Finish, ReturnValue) == 0x000000, "Member 'RCNzSceneChangeLoadingWidget_Finish::ReturnValue' has a wrong offset!");

// Function RCLoadingScreen.RCNzSceneChangeLoadingWidget.SetDisplayNum
// 0x0004 (0x0004 - 0x0000)
struct RCNzSceneChangeLoadingWidget_SetDisplayNum final
{
public:
	int32                                         in_Num;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzSceneChangeLoadingWidget_SetDisplayNum) == 0x000004, "Wrong alignment on RCNzSceneChangeLoadingWidget_SetDisplayNum");
static_assert(sizeof(RCNzSceneChangeLoadingWidget_SetDisplayNum) == 0x000004, "Wrong size on RCNzSceneChangeLoadingWidget_SetDisplayNum");
static_assert(offsetof(RCNzSceneChangeLoadingWidget_SetDisplayNum, in_Num) == 0x000000, "Member 'RCNzSceneChangeLoadingWidget_SetDisplayNum::in_Num' has a wrong offset!");

// Function RCLoadingScreen.RCNzSceneChangeLoadingWidget.Start
// 0x0001 (0x0001 - 0x0000)
struct RCNzSceneChangeLoadingWidget_Start final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCNzSceneChangeLoadingWidget_Start) == 0x000001, "Wrong alignment on RCNzSceneChangeLoadingWidget_Start");
static_assert(sizeof(RCNzSceneChangeLoadingWidget_Start) == 0x000001, "Wrong size on RCNzSceneChangeLoadingWidget_Start");
static_assert(offsetof(RCNzSceneChangeLoadingWidget_Start, ReturnValue) == 0x000000, "Member 'RCNzSceneChangeLoadingWidget_Start::ReturnValue' has a wrong offset!");

// Function RCLoadingScreen.RCReSceneChangeLoadingWidget.Finish
// 0x0001 (0x0001 - 0x0000)
struct RCReSceneChangeLoadingWidget_Finish final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCReSceneChangeLoadingWidget_Finish) == 0x000001, "Wrong alignment on RCReSceneChangeLoadingWidget_Finish");
static_assert(sizeof(RCReSceneChangeLoadingWidget_Finish) == 0x000001, "Wrong size on RCReSceneChangeLoadingWidget_Finish");
static_assert(offsetof(RCReSceneChangeLoadingWidget_Finish, ReturnValue) == 0x000000, "Member 'RCReSceneChangeLoadingWidget_Finish::ReturnValue' has a wrong offset!");

// Function RCLoadingScreen.RCReSceneChangeLoadingWidget.SetDisplayNum
// 0x0004 (0x0004 - 0x0000)
struct RCReSceneChangeLoadingWidget_SetDisplayNum final
{
public:
	int32                                         in_Num;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCReSceneChangeLoadingWidget_SetDisplayNum) == 0x000004, "Wrong alignment on RCReSceneChangeLoadingWidget_SetDisplayNum");
static_assert(sizeof(RCReSceneChangeLoadingWidget_SetDisplayNum) == 0x000004, "Wrong size on RCReSceneChangeLoadingWidget_SetDisplayNum");
static_assert(offsetof(RCReSceneChangeLoadingWidget_SetDisplayNum, in_Num) == 0x000000, "Member 'RCReSceneChangeLoadingWidget_SetDisplayNum::in_Num' has a wrong offset!");

// Function RCLoadingScreen.RCReSceneChangeLoadingWidget.Start
// 0x0001 (0x0001 - 0x0000)
struct RCReSceneChangeLoadingWidget_Start final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCReSceneChangeLoadingWidget_Start) == 0x000001, "Wrong alignment on RCReSceneChangeLoadingWidget_Start");
static_assert(sizeof(RCReSceneChangeLoadingWidget_Start) == 0x000001, "Wrong size on RCReSceneChangeLoadingWidget_Start");
static_assert(offsetof(RCReSceneChangeLoadingWidget_Start, ReturnValue) == 0x000000, "Member 'RCReSceneChangeLoadingWidget_Start::ReturnValue' has a wrong offset!");

// Function RCLoadingScreen.RCReSceneChangeTestWidget.Finish
// 0x0001 (0x0001 - 0x0000)
struct RCReSceneChangeTestWidget_Finish final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCReSceneChangeTestWidget_Finish) == 0x000001, "Wrong alignment on RCReSceneChangeTestWidget_Finish");
static_assert(sizeof(RCReSceneChangeTestWidget_Finish) == 0x000001, "Wrong size on RCReSceneChangeTestWidget_Finish");
static_assert(offsetof(RCReSceneChangeTestWidget_Finish, ReturnValue) == 0x000000, "Member 'RCReSceneChangeTestWidget_Finish::ReturnValue' has a wrong offset!");

// Function RCLoadingScreen.RCReSceneChangeTestWidget.SetDisplayNum
// 0x0004 (0x0004 - 0x0000)
struct RCReSceneChangeTestWidget_SetDisplayNum final
{
public:
	int32                                         in_Num;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCReSceneChangeTestWidget_SetDisplayNum) == 0x000004, "Wrong alignment on RCReSceneChangeTestWidget_SetDisplayNum");
static_assert(sizeof(RCReSceneChangeTestWidget_SetDisplayNum) == 0x000004, "Wrong size on RCReSceneChangeTestWidget_SetDisplayNum");
static_assert(offsetof(RCReSceneChangeTestWidget_SetDisplayNum, in_Num) == 0x000000, "Member 'RCReSceneChangeTestWidget_SetDisplayNum::in_Num' has a wrong offset!");

// Function RCLoadingScreen.RCReSceneChangeTestWidget.Start
// 0x0001 (0x0001 - 0x0000)
struct RCReSceneChangeTestWidget_Start final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCReSceneChangeTestWidget_Start) == 0x000001, "Wrong alignment on RCReSceneChangeTestWidget_Start");
static_assert(sizeof(RCReSceneChangeTestWidget_Start) == 0x000001, "Wrong size on RCReSceneChangeTestWidget_Start");
static_assert(offsetof(RCReSceneChangeTestWidget_Start, ReturnValue) == 0x000000, "Member 'RCReSceneChangeTestWidget_Start::ReturnValue' has a wrong offset!");

// Function RCLoadingScreen.RCLoadingScreenTestWidget.Finish
// 0x0001 (0x0001 - 0x0000)
struct RCLoadingScreenTestWidget_Finish final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCLoadingScreenTestWidget_Finish) == 0x000001, "Wrong alignment on RCLoadingScreenTestWidget_Finish");
static_assert(sizeof(RCLoadingScreenTestWidget_Finish) == 0x000001, "Wrong size on RCLoadingScreenTestWidget_Finish");
static_assert(offsetof(RCLoadingScreenTestWidget_Finish, ReturnValue) == 0x000000, "Member 'RCLoadingScreenTestWidget_Finish::ReturnValue' has a wrong offset!");

// Function RCLoadingScreen.RCLoadingScreenTestWidget.SetDisplayNum
// 0x0004 (0x0004 - 0x0000)
struct RCLoadingScreenTestWidget_SetDisplayNum final
{
public:
	int32                                         in_Num;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCLoadingScreenTestWidget_SetDisplayNum) == 0x000004, "Wrong alignment on RCLoadingScreenTestWidget_SetDisplayNum");
static_assert(sizeof(RCLoadingScreenTestWidget_SetDisplayNum) == 0x000004, "Wrong size on RCLoadingScreenTestWidget_SetDisplayNum");
static_assert(offsetof(RCLoadingScreenTestWidget_SetDisplayNum, in_Num) == 0x000000, "Member 'RCLoadingScreenTestWidget_SetDisplayNum::in_Num' has a wrong offset!");

// Function RCLoadingScreen.RCLoadingScreenTestWidget.Start
// 0x0001 (0x0001 - 0x0000)
struct RCLoadingScreenTestWidget_Start final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RCLoadingScreenTestWidget_Start) == 0x000001, "Wrong alignment on RCLoadingScreenTestWidget_Start");
static_assert(sizeof(RCLoadingScreenTestWidget_Start) == 0x000001, "Wrong size on RCLoadingScreenTestWidget_Start");
static_assert(offsetof(RCLoadingScreenTestWidget_Start, ReturnValue) == 0x000000, "Member 'RCLoadingScreenTestWidget_Start::ReturnValue' has a wrong offset!");

}

