#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Text3D

#include "Basic.hpp"

#include "Text3D_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Text3D.Text3DCharacterTransform.SetLocationDistance
// 0x000C (0x000C - 0x0000)
struct Text3DCharacterTransform_SetLocationDistance final
{
public:
	struct FVector                                Distance;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetLocationDistance) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetLocationDistance");
static_assert(sizeof(Text3DCharacterTransform_SetLocationDistance) == 0x00000C, "Wrong size on Text3DCharacterTransform_SetLocationDistance");
static_assert(offsetof(Text3DCharacterTransform_SetLocationDistance, Distance) == 0x000000, "Member 'Text3DCharacterTransform_SetLocationDistance::Distance' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetLocationEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetLocationEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetLocationEnabled) == 0x000001, "Wrong alignment on Text3DCharacterTransform_SetLocationEnabled");
static_assert(sizeof(Text3DCharacterTransform_SetLocationEnabled) == 0x000001, "Wrong size on Text3DCharacterTransform_SetLocationEnabled");
static_assert(offsetof(Text3DCharacterTransform_SetLocationEnabled, bEnabled) == 0x000000, "Member 'Text3DCharacterTransform_SetLocationEnabled::bEnabled' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetLocationOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetLocationOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetLocationOrder) == 0x000001, "Wrong alignment on Text3DCharacterTransform_SetLocationOrder");
static_assert(sizeof(Text3DCharacterTransform_SetLocationOrder) == 0x000001, "Wrong size on Text3DCharacterTransform_SetLocationOrder");
static_assert(offsetof(Text3DCharacterTransform_SetLocationOrder, Order) == 0x000000, "Member 'Text3DCharacterTransform_SetLocationOrder::Order' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetLocationProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetLocationProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetLocationProgress) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetLocationProgress");
static_assert(sizeof(Text3DCharacterTransform_SetLocationProgress) == 0x000004, "Wrong size on Text3DCharacterTransform_SetLocationProgress");
static_assert(offsetof(Text3DCharacterTransform_SetLocationProgress, Progress) == 0x000000, "Member 'Text3DCharacterTransform_SetLocationProgress::Progress' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetLocationRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetLocationRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetLocationRange) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetLocationRange");
static_assert(sizeof(Text3DCharacterTransform_SetLocationRange) == 0x000004, "Wrong size on Text3DCharacterTransform_SetLocationRange");
static_assert(offsetof(Text3DCharacterTransform_SetLocationRange, Range) == 0x000000, "Member 'Text3DCharacterTransform_SetLocationRange::Range' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetRotateBegin
// 0x000C (0x000C - 0x0000)
struct Text3DCharacterTransform_SetRotateBegin final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetRotateBegin) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetRotateBegin");
static_assert(sizeof(Text3DCharacterTransform_SetRotateBegin) == 0x00000C, "Wrong size on Text3DCharacterTransform_SetRotateBegin");
static_assert(offsetof(Text3DCharacterTransform_SetRotateBegin, Value) == 0x000000, "Member 'Text3DCharacterTransform_SetRotateBegin::Value' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetRotateEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetRotateEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetRotateEnabled) == 0x000001, "Wrong alignment on Text3DCharacterTransform_SetRotateEnabled");
static_assert(sizeof(Text3DCharacterTransform_SetRotateEnabled) == 0x000001, "Wrong size on Text3DCharacterTransform_SetRotateEnabled");
static_assert(offsetof(Text3DCharacterTransform_SetRotateEnabled, bEnabled) == 0x000000, "Member 'Text3DCharacterTransform_SetRotateEnabled::bEnabled' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetRotateEnd
// 0x000C (0x000C - 0x0000)
struct Text3DCharacterTransform_SetRotateEnd final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetRotateEnd) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetRotateEnd");
static_assert(sizeof(Text3DCharacterTransform_SetRotateEnd) == 0x00000C, "Wrong size on Text3DCharacterTransform_SetRotateEnd");
static_assert(offsetof(Text3DCharacterTransform_SetRotateEnd, Value) == 0x000000, "Member 'Text3DCharacterTransform_SetRotateEnd::Value' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetRotateOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetRotateOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetRotateOrder) == 0x000001, "Wrong alignment on Text3DCharacterTransform_SetRotateOrder");
static_assert(sizeof(Text3DCharacterTransform_SetRotateOrder) == 0x000001, "Wrong size on Text3DCharacterTransform_SetRotateOrder");
static_assert(offsetof(Text3DCharacterTransform_SetRotateOrder, Order) == 0x000000, "Member 'Text3DCharacterTransform_SetRotateOrder::Order' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetRotateProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetRotateProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetRotateProgress) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetRotateProgress");
static_assert(sizeof(Text3DCharacterTransform_SetRotateProgress) == 0x000004, "Wrong size on Text3DCharacterTransform_SetRotateProgress");
static_assert(offsetof(Text3DCharacterTransform_SetRotateProgress, Progress) == 0x000000, "Member 'Text3DCharacterTransform_SetRotateProgress::Progress' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetRotateRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetRotateRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetRotateRange) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetRotateRange");
static_assert(sizeof(Text3DCharacterTransform_SetRotateRange) == 0x000004, "Wrong size on Text3DCharacterTransform_SetRotateRange");
static_assert(offsetof(Text3DCharacterTransform_SetRotateRange, Range) == 0x000000, "Member 'Text3DCharacterTransform_SetRotateRange::Range' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetScaleBegin
// 0x000C (0x000C - 0x0000)
struct Text3DCharacterTransform_SetScaleBegin final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetScaleBegin) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetScaleBegin");
static_assert(sizeof(Text3DCharacterTransform_SetScaleBegin) == 0x00000C, "Wrong size on Text3DCharacterTransform_SetScaleBegin");
static_assert(offsetof(Text3DCharacterTransform_SetScaleBegin, Value) == 0x000000, "Member 'Text3DCharacterTransform_SetScaleBegin::Value' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetScaleEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetScaleEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetScaleEnabled) == 0x000001, "Wrong alignment on Text3DCharacterTransform_SetScaleEnabled");
static_assert(sizeof(Text3DCharacterTransform_SetScaleEnabled) == 0x000001, "Wrong size on Text3DCharacterTransform_SetScaleEnabled");
static_assert(offsetof(Text3DCharacterTransform_SetScaleEnabled, bEnabled) == 0x000000, "Member 'Text3DCharacterTransform_SetScaleEnabled::bEnabled' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetScaleEnd
// 0x000C (0x000C - 0x0000)
struct Text3DCharacterTransform_SetScaleEnd final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetScaleEnd) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetScaleEnd");
static_assert(sizeof(Text3DCharacterTransform_SetScaleEnd) == 0x00000C, "Wrong size on Text3DCharacterTransform_SetScaleEnd");
static_assert(offsetof(Text3DCharacterTransform_SetScaleEnd, Value) == 0x000000, "Member 'Text3DCharacterTransform_SetScaleEnd::Value' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetScaleOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetScaleOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetScaleOrder) == 0x000001, "Wrong alignment on Text3DCharacterTransform_SetScaleOrder");
static_assert(sizeof(Text3DCharacterTransform_SetScaleOrder) == 0x000001, "Wrong size on Text3DCharacterTransform_SetScaleOrder");
static_assert(offsetof(Text3DCharacterTransform_SetScaleOrder, Order) == 0x000000, "Member 'Text3DCharacterTransform_SetScaleOrder::Order' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetScaleProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetScaleProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetScaleProgress) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetScaleProgress");
static_assert(sizeof(Text3DCharacterTransform_SetScaleProgress) == 0x000004, "Wrong size on Text3DCharacterTransform_SetScaleProgress");
static_assert(offsetof(Text3DCharacterTransform_SetScaleProgress, Progress) == 0x000000, "Member 'Text3DCharacterTransform_SetScaleProgress::Progress' has a wrong offset!");

// Function Text3D.Text3DCharacterTransform.SetScaleRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetScaleRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DCharacterTransform_SetScaleRange) == 0x000004, "Wrong alignment on Text3DCharacterTransform_SetScaleRange");
static_assert(sizeof(Text3DCharacterTransform_SetScaleRange) == 0x000004, "Wrong size on Text3DCharacterTransform_SetScaleRange");
static_assert(offsetof(Text3DCharacterTransform_SetScaleRange, Range) == 0x000000, "Member 'Text3DCharacterTransform_SetScaleRange::Range' has a wrong offset!");

// Function Text3D.Text3DComponent.GetTextSize
// 0x000C (0x000C - 0x0000)
struct Text3DComponent_GetTextSize final
{
public:
	struct FVector                                OutTextSize;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_GetTextSize) == 0x000004, "Wrong alignment on Text3DComponent_GetTextSize");
static_assert(sizeof(Text3DComponent_GetTextSize) == 0x00000C, "Wrong size on Text3DComponent_GetTextSize");
static_assert(offsetof(Text3DComponent_GetTextSize, OutTextSize) == 0x000000, "Member 'Text3DComponent_GetTextSize::OutTextSize' has a wrong offset!");

// Function Text3D.Text3DComponent.SetBackMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetBackMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetBackMaterial) == 0x000008, "Wrong alignment on Text3DComponent_SetBackMaterial");
static_assert(sizeof(Text3DComponent_SetBackMaterial) == 0x000008, "Wrong size on Text3DComponent_SetBackMaterial");
static_assert(offsetof(Text3DComponent_SetBackMaterial, Value) == 0x000000, "Member 'Text3DComponent_SetBackMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetBevel
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetBevel final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetBevel) == 0x000004, "Wrong alignment on Text3DComponent_SetBevel");
static_assert(sizeof(Text3DComponent_SetBevel) == 0x000004, "Wrong size on Text3DComponent_SetBevel");
static_assert(offsetof(Text3DComponent_SetBevel, Value) == 0x000000, "Member 'Text3DComponent_SetBevel::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetBevelMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetBevelMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetBevelMaterial) == 0x000008, "Wrong alignment on Text3DComponent_SetBevelMaterial");
static_assert(sizeof(Text3DComponent_SetBevelMaterial) == 0x000008, "Wrong size on Text3DComponent_SetBevelMaterial");
static_assert(offsetof(Text3DComponent_SetBevelMaterial, Value) == 0x000000, "Member 'Text3DComponent_SetBevelMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetBevelSegments
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetBevelSegments final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetBevelSegments) == 0x000004, "Wrong alignment on Text3DComponent_SetBevelSegments");
static_assert(sizeof(Text3DComponent_SetBevelSegments) == 0x000004, "Wrong size on Text3DComponent_SetBevelSegments");
static_assert(offsetof(Text3DComponent_SetBevelSegments, Value) == 0x000000, "Member 'Text3DComponent_SetBevelSegments::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetBevelType
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetBevelType final
{
public:
	EText3DBevelType                              Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetBevelType) == 0x000001, "Wrong alignment on Text3DComponent_SetBevelType");
static_assert(sizeof(Text3DComponent_SetBevelType) == 0x000001, "Wrong size on Text3DComponent_SetBevelType");
static_assert(offsetof(Text3DComponent_SetBevelType, Value) == 0x000000, "Member 'Text3DComponent_SetBevelType::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetExtrude
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetExtrude final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetExtrude) == 0x000004, "Wrong alignment on Text3DComponent_SetExtrude");
static_assert(sizeof(Text3DComponent_SetExtrude) == 0x000004, "Wrong size on Text3DComponent_SetExtrude");
static_assert(offsetof(Text3DComponent_SetExtrude, Value) == 0x000000, "Member 'Text3DComponent_SetExtrude::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetExtrudeMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetExtrudeMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetExtrudeMaterial) == 0x000008, "Wrong alignment on Text3DComponent_SetExtrudeMaterial");
static_assert(sizeof(Text3DComponent_SetExtrudeMaterial) == 0x000008, "Wrong size on Text3DComponent_SetExtrudeMaterial");
static_assert(offsetof(Text3DComponent_SetExtrudeMaterial, Value) == 0x000000, "Member 'Text3DComponent_SetExtrudeMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetFont
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetFont final
{
public:
	const class UFont*                            InFont;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetFont) == 0x000008, "Wrong alignment on Text3DComponent_SetFont");
static_assert(sizeof(Text3DComponent_SetFont) == 0x000008, "Wrong size on Text3DComponent_SetFont");
static_assert(offsetof(Text3DComponent_SetFont, InFont) == 0x000000, "Member 'Text3DComponent_SetFont::InFont' has a wrong offset!");

// Function Text3D.Text3DComponent.SetFreeze
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetFreeze final
{
public:
	bool                                          bFreeze;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetFreeze) == 0x000001, "Wrong alignment on Text3DComponent_SetFreeze");
static_assert(sizeof(Text3DComponent_SetFreeze) == 0x000001, "Wrong size on Text3DComponent_SetFreeze");
static_assert(offsetof(Text3DComponent_SetFreeze, bFreeze) == 0x000000, "Member 'Text3DComponent_SetFreeze::bFreeze' has a wrong offset!");

// Function Text3D.Text3DComponent.SetFrontMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetFrontMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetFrontMaterial) == 0x000008, "Wrong alignment on Text3DComponent_SetFrontMaterial");
static_assert(sizeof(Text3DComponent_SetFrontMaterial) == 0x000008, "Wrong size on Text3DComponent_SetFrontMaterial");
static_assert(offsetof(Text3DComponent_SetFrontMaterial, Value) == 0x000000, "Member 'Text3DComponent_SetFrontMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetHasMaxHeight
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasMaxHeight final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetHasMaxHeight) == 0x000001, "Wrong alignment on Text3DComponent_SetHasMaxHeight");
static_assert(sizeof(Text3DComponent_SetHasMaxHeight) == 0x000001, "Wrong size on Text3DComponent_SetHasMaxHeight");
static_assert(offsetof(Text3DComponent_SetHasMaxHeight, Value) == 0x000000, "Member 'Text3DComponent_SetHasMaxHeight::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetHasMaxWidth
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasMaxWidth final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetHasMaxWidth) == 0x000001, "Wrong alignment on Text3DComponent_SetHasMaxWidth");
static_assert(sizeof(Text3DComponent_SetHasMaxWidth) == 0x000001, "Wrong size on Text3DComponent_SetHasMaxWidth");
static_assert(offsetof(Text3DComponent_SetHasMaxWidth, Value) == 0x000000, "Member 'Text3DComponent_SetHasMaxWidth::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHorizontalAlignment final
{
public:
	EText3DHorizontalTextAlignment                Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetHorizontalAlignment) == 0x000001, "Wrong alignment on Text3DComponent_SetHorizontalAlignment");
static_assert(sizeof(Text3DComponent_SetHorizontalAlignment) == 0x000001, "Wrong size on Text3DComponent_SetHorizontalAlignment");
static_assert(offsetof(Text3DComponent_SetHorizontalAlignment, Value) == 0x000000, "Member 'Text3DComponent_SetHorizontalAlignment::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetKerning
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetKerning final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetKerning) == 0x000004, "Wrong alignment on Text3DComponent_SetKerning");
static_assert(sizeof(Text3DComponent_SetKerning) == 0x000004, "Wrong size on Text3DComponent_SetKerning");
static_assert(offsetof(Text3DComponent_SetKerning, Value) == 0x000000, "Member 'Text3DComponent_SetKerning::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetLineSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetLineSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetLineSpacing) == 0x000004, "Wrong alignment on Text3DComponent_SetLineSpacing");
static_assert(sizeof(Text3DComponent_SetLineSpacing) == 0x000004, "Wrong size on Text3DComponent_SetLineSpacing");
static_assert(offsetof(Text3DComponent_SetLineSpacing, Value) == 0x000000, "Member 'Text3DComponent_SetLineSpacing::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetMaxHeight
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetMaxHeight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetMaxHeight) == 0x000004, "Wrong alignment on Text3DComponent_SetMaxHeight");
static_assert(sizeof(Text3DComponent_SetMaxHeight) == 0x000004, "Wrong size on Text3DComponent_SetMaxHeight");
static_assert(offsetof(Text3DComponent_SetMaxHeight, Value) == 0x000000, "Member 'Text3DComponent_SetMaxHeight::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetMaxWidth
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetMaxWidth final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetMaxWidth) == 0x000004, "Wrong alignment on Text3DComponent_SetMaxWidth");
static_assert(sizeof(Text3DComponent_SetMaxWidth) == 0x000004, "Wrong size on Text3DComponent_SetMaxWidth");
static_assert(offsetof(Text3DComponent_SetMaxWidth, Value) == 0x000000, "Member 'Text3DComponent_SetMaxWidth::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetOutline
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetOutline final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetOutline) == 0x000001, "Wrong alignment on Text3DComponent_SetOutline");
static_assert(sizeof(Text3DComponent_SetOutline) == 0x000001, "Wrong size on Text3DComponent_SetOutline");
static_assert(offsetof(Text3DComponent_SetOutline, bValue) == 0x000000, "Member 'Text3DComponent_SetOutline::bValue' has a wrong offset!");

// Function Text3D.Text3DComponent.SetScaleProportionally
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetScaleProportionally final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetScaleProportionally) == 0x000001, "Wrong alignment on Text3DComponent_SetScaleProportionally");
static_assert(sizeof(Text3DComponent_SetScaleProportionally) == 0x000001, "Wrong size on Text3DComponent_SetScaleProportionally");
static_assert(offsetof(Text3DComponent_SetScaleProportionally, Value) == 0x000000, "Member 'Text3DComponent_SetScaleProportionally::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetText
// 0x0018 (0x0018 - 0x0000)
struct Text3DComponent_SetText final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetText) == 0x000008, "Wrong alignment on Text3DComponent_SetText");
static_assert(sizeof(Text3DComponent_SetText) == 0x000018, "Wrong size on Text3DComponent_SetText");
static_assert(offsetof(Text3DComponent_SetText, Value) == 0x000000, "Member 'Text3DComponent_SetText::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetVerticalAlignment final
{
public:
	EText3DVerticalTextAlignment                  Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetVerticalAlignment) == 0x000001, "Wrong alignment on Text3DComponent_SetVerticalAlignment");
static_assert(sizeof(Text3DComponent_SetVerticalAlignment) == 0x000001, "Wrong size on Text3DComponent_SetVerticalAlignment");
static_assert(offsetof(Text3DComponent_SetVerticalAlignment, Value) == 0x000000, "Member 'Text3DComponent_SetVerticalAlignment::Value' has a wrong offset!");

// Function Text3D.Text3DComponent.SetWordSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetWordSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DComponent_SetWordSpacing) == 0x000004, "Wrong alignment on Text3DComponent_SetWordSpacing");
static_assert(sizeof(Text3DComponent_SetWordSpacing) == 0x000004, "Wrong size on Text3DComponent_SetWordSpacing");
static_assert(offsetof(Text3DComponent_SetWordSpacing, Value) == 0x000000, "Member 'Text3DComponent_SetWordSpacing::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.GetTextSize
// 0x000C (0x000C - 0x0000)
struct Text3DMeshedComponent_GetTextSize final
{
public:
	struct FVector                                OutTextSize;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_GetTextSize) == 0x000004, "Wrong alignment on Text3DMeshedComponent_GetTextSize");
static_assert(sizeof(Text3DMeshedComponent_GetTextSize) == 0x00000C, "Wrong size on Text3DMeshedComponent_GetTextSize");
static_assert(offsetof(Text3DMeshedComponent_GetTextSize, OutTextSize) == 0x000000, "Member 'Text3DMeshedComponent_GetTextSize::OutTextSize' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetBackMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DMeshedComponent_SetBackMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetBackMaterial) == 0x000008, "Wrong alignment on Text3DMeshedComponent_SetBackMaterial");
static_assert(sizeof(Text3DMeshedComponent_SetBackMaterial) == 0x000008, "Wrong size on Text3DMeshedComponent_SetBackMaterial");
static_assert(offsetof(Text3DMeshedComponent_SetBackMaterial, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetBackMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetBevel
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetBevel final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetBevel) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetBevel");
static_assert(sizeof(Text3DMeshedComponent_SetBevel) == 0x000004, "Wrong size on Text3DMeshedComponent_SetBevel");
static_assert(offsetof(Text3DMeshedComponent_SetBevel, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetBevel::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetBevelMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DMeshedComponent_SetBevelMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetBevelMaterial) == 0x000008, "Wrong alignment on Text3DMeshedComponent_SetBevelMaterial");
static_assert(sizeof(Text3DMeshedComponent_SetBevelMaterial) == 0x000008, "Wrong size on Text3DMeshedComponent_SetBevelMaterial");
static_assert(offsetof(Text3DMeshedComponent_SetBevelMaterial, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetBevelMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetBevelSegments
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetBevelSegments final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetBevelSegments) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetBevelSegments");
static_assert(sizeof(Text3DMeshedComponent_SetBevelSegments) == 0x000004, "Wrong size on Text3DMeshedComponent_SetBevelSegments");
static_assert(offsetof(Text3DMeshedComponent_SetBevelSegments, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetBevelSegments::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetBevelType
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetBevelType final
{
public:
	EText3DBevelType                              Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetBevelType) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetBevelType");
static_assert(sizeof(Text3DMeshedComponent_SetBevelType) == 0x000001, "Wrong size on Text3DMeshedComponent_SetBevelType");
static_assert(offsetof(Text3DMeshedComponent_SetBevelType, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetBevelType::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetExtrude
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetExtrude final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetExtrude) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetExtrude");
static_assert(sizeof(Text3DMeshedComponent_SetExtrude) == 0x000004, "Wrong size on Text3DMeshedComponent_SetExtrude");
static_assert(offsetof(Text3DMeshedComponent_SetExtrude, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetExtrude::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetExtrudeMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DMeshedComponent_SetExtrudeMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetExtrudeMaterial) == 0x000008, "Wrong alignment on Text3DMeshedComponent_SetExtrudeMaterial");
static_assert(sizeof(Text3DMeshedComponent_SetExtrudeMaterial) == 0x000008, "Wrong size on Text3DMeshedComponent_SetExtrudeMaterial");
static_assert(offsetof(Text3DMeshedComponent_SetExtrudeMaterial, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetExtrudeMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetFont
// 0x0008 (0x0008 - 0x0000)
struct Text3DMeshedComponent_SetFont final
{
public:
	const class UFont*                            InFont;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetFont) == 0x000008, "Wrong alignment on Text3DMeshedComponent_SetFont");
static_assert(sizeof(Text3DMeshedComponent_SetFont) == 0x000008, "Wrong size on Text3DMeshedComponent_SetFont");
static_assert(offsetof(Text3DMeshedComponent_SetFont, InFont) == 0x000000, "Member 'Text3DMeshedComponent_SetFont::InFont' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetFreeze
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetFreeze final
{
public:
	bool                                          bFreeze;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetFreeze) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetFreeze");
static_assert(sizeof(Text3DMeshedComponent_SetFreeze) == 0x000001, "Wrong size on Text3DMeshedComponent_SetFreeze");
static_assert(offsetof(Text3DMeshedComponent_SetFreeze, bFreeze) == 0x000000, "Member 'Text3DMeshedComponent_SetFreeze::bFreeze' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetFrontMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DMeshedComponent_SetFrontMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetFrontMaterial) == 0x000008, "Wrong alignment on Text3DMeshedComponent_SetFrontMaterial");
static_assert(sizeof(Text3DMeshedComponent_SetFrontMaterial) == 0x000008, "Wrong size on Text3DMeshedComponent_SetFrontMaterial");
static_assert(offsetof(Text3DMeshedComponent_SetFrontMaterial, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetFrontMaterial::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetHasMaxHeight
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetHasMaxHeight final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetHasMaxHeight) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetHasMaxHeight");
static_assert(sizeof(Text3DMeshedComponent_SetHasMaxHeight) == 0x000001, "Wrong size on Text3DMeshedComponent_SetHasMaxHeight");
static_assert(offsetof(Text3DMeshedComponent_SetHasMaxHeight, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetHasMaxHeight::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetHasMaxWidth
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetHasMaxWidth final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetHasMaxWidth) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetHasMaxWidth");
static_assert(sizeof(Text3DMeshedComponent_SetHasMaxWidth) == 0x000001, "Wrong size on Text3DMeshedComponent_SetHasMaxWidth");
static_assert(offsetof(Text3DMeshedComponent_SetHasMaxWidth, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetHasMaxWidth::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetHorizontalAlignment final
{
public:
	EText3DHorizontalTextAlignment                Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetHorizontalAlignment) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetHorizontalAlignment");
static_assert(sizeof(Text3DMeshedComponent_SetHorizontalAlignment) == 0x000001, "Wrong size on Text3DMeshedComponent_SetHorizontalAlignment");
static_assert(offsetof(Text3DMeshedComponent_SetHorizontalAlignment, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetHorizontalAlignment::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetKerning
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetKerning final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetKerning) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetKerning");
static_assert(sizeof(Text3DMeshedComponent_SetKerning) == 0x000004, "Wrong size on Text3DMeshedComponent_SetKerning");
static_assert(offsetof(Text3DMeshedComponent_SetKerning, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetKerning::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetLineSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetLineSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetLineSpacing) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetLineSpacing");
static_assert(sizeof(Text3DMeshedComponent_SetLineSpacing) == 0x000004, "Wrong size on Text3DMeshedComponent_SetLineSpacing");
static_assert(offsetof(Text3DMeshedComponent_SetLineSpacing, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetLineSpacing::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetMashSaveMode
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetMashSaveMode final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetMashSaveMode) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetMashSaveMode");
static_assert(sizeof(Text3DMeshedComponent_SetMashSaveMode) == 0x000001, "Wrong size on Text3DMeshedComponent_SetMashSaveMode");
static_assert(offsetof(Text3DMeshedComponent_SetMashSaveMode, InFlag) == 0x000000, "Member 'Text3DMeshedComponent_SetMashSaveMode::InFlag' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetMashSavePath
// 0x0010 (0x0010 - 0x0000)
struct Text3DMeshedComponent_SetMashSavePath final
{
public:
	class FString                                 InSavePath;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetMashSavePath) == 0x000008, "Wrong alignment on Text3DMeshedComponent_SetMashSavePath");
static_assert(sizeof(Text3DMeshedComponent_SetMashSavePath) == 0x000010, "Wrong size on Text3DMeshedComponent_SetMashSavePath");
static_assert(offsetof(Text3DMeshedComponent_SetMashSavePath, InSavePath) == 0x000000, "Member 'Text3DMeshedComponent_SetMashSavePath::InSavePath' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetMaxHeight
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetMaxHeight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetMaxHeight) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetMaxHeight");
static_assert(sizeof(Text3DMeshedComponent_SetMaxHeight) == 0x000004, "Wrong size on Text3DMeshedComponent_SetMaxHeight");
static_assert(offsetof(Text3DMeshedComponent_SetMaxHeight, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetMaxHeight::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetMaxWidth
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetMaxWidth final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetMaxWidth) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetMaxWidth");
static_assert(sizeof(Text3DMeshedComponent_SetMaxWidth) == 0x000004, "Wrong size on Text3DMeshedComponent_SetMaxWidth");
static_assert(offsetof(Text3DMeshedComponent_SetMaxWidth, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetMaxWidth::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetOutline
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetOutline final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetOutline) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetOutline");
static_assert(sizeof(Text3DMeshedComponent_SetOutline) == 0x000001, "Wrong size on Text3DMeshedComponent_SetOutline");
static_assert(offsetof(Text3DMeshedComponent_SetOutline, bValue) == 0x000000, "Member 'Text3DMeshedComponent_SetOutline::bValue' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetScaleProportionally
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetScaleProportionally final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetScaleProportionally) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetScaleProportionally");
static_assert(sizeof(Text3DMeshedComponent_SetScaleProportionally) == 0x000001, "Wrong size on Text3DMeshedComponent_SetScaleProportionally");
static_assert(offsetof(Text3DMeshedComponent_SetScaleProportionally, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetScaleProportionally::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetText
// 0x0018 (0x0018 - 0x0000)
struct Text3DMeshedComponent_SetText final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetText) == 0x000008, "Wrong alignment on Text3DMeshedComponent_SetText");
static_assert(sizeof(Text3DMeshedComponent_SetText) == 0x000018, "Wrong size on Text3DMeshedComponent_SetText");
static_assert(offsetof(Text3DMeshedComponent_SetText, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetText::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DMeshedComponent_SetVerticalAlignment final
{
public:
	EText3DVerticalTextAlignment                  Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetVerticalAlignment) == 0x000001, "Wrong alignment on Text3DMeshedComponent_SetVerticalAlignment");
static_assert(sizeof(Text3DMeshedComponent_SetVerticalAlignment) == 0x000001, "Wrong size on Text3DMeshedComponent_SetVerticalAlignment");
static_assert(offsetof(Text3DMeshedComponent_SetVerticalAlignment, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetVerticalAlignment::Value' has a wrong offset!");

// Function Text3D.Text3DMeshedComponent.SetWordSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DMeshedComponent_SetWordSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Text3DMeshedComponent_SetWordSpacing) == 0x000004, "Wrong alignment on Text3DMeshedComponent_SetWordSpacing");
static_assert(sizeof(Text3DMeshedComponent_SetWordSpacing) == 0x000004, "Wrong size on Text3DMeshedComponent_SetWordSpacing");
static_assert(offsetof(Text3DMeshedComponent_SetWordSpacing, Value) == 0x000000, "Member 'Text3DMeshedComponent_SetWordSpacing::Value' has a wrong offset!");

}

