#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UELogo_P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UELogo_P.UELogo_P_C
// 0x0020 (0x02A0 - 0x0280)
class AUELogo_P_C final : public ARCLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URCStartupWidget*                       LogoWidget;                                        // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         skippableTime;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTime;                                          // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFinish;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTick;                                            // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_UELogo_P(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UELogo_P_C">();
	}
	static class AUELogo_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUELogo_P_C>();
	}
};
static_assert(alignof(AUELogo_P_C) == 0x000008, "Wrong alignment on AUELogo_P_C");
static_assert(sizeof(AUELogo_P_C) == 0x0002A0, "Wrong size on AUELogo_P_C");
static_assert(offsetof(AUELogo_P_C, UberGraphFrame) == 0x000280, "Member 'AUELogo_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUELogo_P_C, LogoWidget) == 0x000288, "Member 'AUELogo_P_C::LogoWidget' has a wrong offset!");
static_assert(offsetof(AUELogo_P_C, skippableTime) == 0x000290, "Member 'AUELogo_P_C::skippableTime' has a wrong offset!");
static_assert(offsetof(AUELogo_P_C, FadeTime) == 0x000294, "Member 'AUELogo_P_C::FadeTime' has a wrong offset!");
static_assert(offsetof(AUELogo_P_C, isFinish) == 0x000298, "Member 'AUELogo_P_C::isFinish' has a wrong offset!");
static_assert(offsetof(AUELogo_P_C, IsTick) == 0x000299, "Member 'AUELogo_P_C::IsTick' has a wrong offset!");

}

