#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UELogo_P

#include "Basic.hpp"


namespace SDK::Params
{

// Function UELogo_P.UELogo_P_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct UELogo_P_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UELogo_P_C_ReceiveTick) == 0x000004, "Wrong alignment on UELogo_P_C_ReceiveTick");
static_assert(sizeof(UELogo_P_C_ReceiveTick) == 0x000004, "Wrong size on UELogo_P_C_ReceiveTick");
static_assert(offsetof(UELogo_P_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'UELogo_P_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function UELogo_P.UELogo_P_C.ExecuteUbergraph_UELogo_P
// 0x0030 (0x0030 - 0x0000)
struct UELogo_P_C_ExecuteUbergraph_UELogo_P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARCGameModeBase*                        K2Node_DynamicCast_AsRCGame_Mode_Base;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Title_StartUp_UELogo_C*            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkip_ReturnValue;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingFinishAnimation_ReturnValue;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UELogo_P_C_ExecuteUbergraph_UELogo_P) == 0x000008, "Wrong alignment on UELogo_P_C_ExecuteUbergraph_UELogo_P");
static_assert(sizeof(UELogo_P_C_ExecuteUbergraph_UELogo_P) == 0x000030, "Wrong size on UELogo_P_C_ExecuteUbergraph_UELogo_P");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, EntryPoint) == 0x000000, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::EntryPoint' has a wrong offset!");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, K2Node_DynamicCast_AsRCGame_Mode_Base) == 0x000010, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::K2Node_DynamicCast_AsRCGame_Mode_Base' has a wrong offset!");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, CallFunc_Create_ReturnValue) == 0x000020, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, CallFunc_IsSkip_ReturnValue) == 0x000028, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::CallFunc_IsSkip_ReturnValue' has a wrong offset!");
static_assert(offsetof(UELogo_P_C_ExecuteUbergraph_UELogo_P, CallFunc_IsPlayingFinishAnimation_ReturnValue) == 0x000029, "Member 'UELogo_P_C_ExecuteUbergraph_UELogo_P::CallFunc_IsPlayingFinishAnimation_ReturnValue' has a wrong offset!");

}

