#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Sky_RC1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Sky_RC1.Ultra_Dynamic_Sky_RC1_C.Set Material Variables
// 0x02C8 (0x02C8 - 0x0000)
struct Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables final
{
public:
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_1;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_2;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveLinearColor*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      CallFunc_Array_Get_Item_3;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      CallFunc_Array_Get_Item_4;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_3;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_4;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_5;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_6;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_7;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_8;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_9;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_10;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_3;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_11;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_12;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_4;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_4;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue_1;       // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_13;         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_5;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_14;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_15;         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_5;                // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_6;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x018C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_7;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_1;        // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_2;        // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_1;  // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue_1;    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_2;            // 0x01F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_3;        // 0x0204(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_4;        // 0x0214(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_2;  // 0x0224(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_3;  // 0x0234(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_3;            // 0x0244(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_4;            // 0x0254(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_5;        // 0x0264(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_4;  // 0x0274(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_5;            // 0x0284(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_6;            // 0x0294(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_7;            // 0x02A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_8;            // 0x02B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables");
static_assert(sizeof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables) == 0x0002C8, "Wrong size on Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000000, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_1) == 0x000004, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_SelectFloat_ReturnValue) == 0x00000C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue) == 0x000010, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_2) == 0x000018, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Array_Get_Item) == 0x000020, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Array_Get_Item_3) == 0x000038, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Array_Get_Item_4) == 0x000040, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_3) == 0x000048, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_4) == 0x00004C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_5) == 0x000054, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_6) == 0x000058, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_SelectFloat_ReturnValue_1) == 0x000060, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_7) == 0x000064, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue_1) == 0x000068, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_8) == 0x00006C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000070, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_SelectFloat_ReturnValue_2) == 0x000074, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue_2) == 0x000078, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakRotator_Roll) == 0x00007C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakRotator_Pitch) == 0x000080, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakRotator_Yaw) == 0x000084, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000088, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000094, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_9) == 0x0000A4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_10) == 0x0000A8, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x0000AC, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x0000B0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_SelectFloat_ReturnValue_3) == 0x0000C0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue) == 0x0000C4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue_3) == 0x0000D4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, Temp_bool_Variable) == 0x0000D8, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_11) == 0x0000DC, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_12) == 0x0000E0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x0000E4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_SelectFloat_ReturnValue_4) == 0x0000E8, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_SelectFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue_4) == 0x0000EC, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x0000F0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000F4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakRotator_Roll_1) == 0x000104, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakRotator_Pitch_1) == 0x000108, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakRotator_Yaw_1) == 0x00010C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000110, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Conv_RotatorToVector_ReturnValue_1) == 0x00011C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Conv_RotatorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000128, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_IsValid_ReturnValue_2) == 0x000138, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_IsValid_ReturnValue_3) == 0x000139, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_13) == 0x00013C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_IsValid_ReturnValue_4) == 0x000140, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_FClamp_ReturnValue) == 0x000144, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetActorForwardVector_ReturnValue) == 0x000148, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_IsValid_ReturnValue_5) == 0x000154, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakVector_X) == 0x000158, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakVector_Y) == 0x00015C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_BreakVector_Z) == 0x000160, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue_5) == 0x000164, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000168, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00016C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_14) == 0x000170, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_MapRangeUnclamped_ReturnValue_15) == 0x000174, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_MapRangeUnclamped_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Lerp_ReturnValue) == 0x000178, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Lerp_ReturnValue_1) == 0x00017C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Less_FloatFloat_ReturnValue_5) == 0x000180, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Less_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_SelectFloat_ReturnValue_5) == 0x000184, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_SelectFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue_6) == 0x000188, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetLinearColorValue_ReturnValue) == 0x00018C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetFloatValue_ReturnValue_7) == 0x00019C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetFloatValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetLinearColorValue_ReturnValue_1) == 0x0001A0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetLinearColorValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_1) == 0x0001B0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, K2Node_Select_Default) == 0x0001C0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetLinearColorValue_ReturnValue_2) == 0x0001D0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetLinearColorValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Multiply_LinearColorFloat_ReturnValue_1) == 0x0001E0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Multiply_LinearColorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Conv_LinearColorToColor_ReturnValue_1) == 0x0001F0, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Conv_LinearColorToColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_2) == 0x0001F4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetLinearColorValue_ReturnValue_3) == 0x000204, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetLinearColorValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetLinearColorValue_ReturnValue_4) == 0x000214, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetLinearColorValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Multiply_LinearColorFloat_ReturnValue_2) == 0x000224, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Multiply_LinearColorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Multiply_LinearColorFloat_ReturnValue_3) == 0x000234, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Multiply_LinearColorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_3) == 0x000244, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_4) == 0x000254, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_GetLinearColorValue_ReturnValue_5) == 0x000264, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_GetLinearColorValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_Multiply_LinearColorFloat_ReturnValue_4) == 0x000274, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_Multiply_LinearColorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_5) == 0x000284, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_6) == 0x000294, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_7) == 0x0002A4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables, CallFunc_LinearColorLerp_ReturnValue_8) == 0x0002B4, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Material_Variables::CallFunc_LinearColorLerp_ReturnValue_8' has a wrong offset!");

// Function Ultra_Dynamic_Sky_RC1.Ultra_Dynamic_Sky_RC1_C.Set Solar Angle
// 0x00F8 (0x00F8 - 0x0000)
struct Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetAxes_X;                                // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAxes_Y;                                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAxes_Z;                                // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle) == 0x000004, "Wrong alignment on Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle");
static_assert(sizeof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle) == 0x0000F8, "Wrong size on Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_GetAxes_X) == 0x00000C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_GetAxes_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_GetAxes_Y) == 0x000018, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_GetAxes_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_GetAxes_Z) == 0x000024, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_GetAxes_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000034, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00003C, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_MakeRotator_ReturnValue_1) == 0x000048, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000054, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000058, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000064, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000070, "Member 'Ultra_Dynamic_Sky_RC1_C_Set_Solar_Angle::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function Ultra_Dynamic_Sky_RC1.Ultra_Dynamic_Sky_RC1_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct Ultra_Dynamic_Sky_RC1_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_RC1_C_UserConstructionScript) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_RC1_C_UserConstructionScript");
static_assert(sizeof(Ultra_Dynamic_Sky_RC1_C_UserConstructionScript) == 0x000020, "Wrong size on Ultra_Dynamic_Sky_RC1_C_UserConstructionScript");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'Ultra_Dynamic_Sky_RC1_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Sky_RC1_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Ultra_Dynamic_Sky_RC1_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000018, "Member 'Ultra_Dynamic_Sky_RC1_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function Ultra_Dynamic_Sky_RC1.Ultra_Dynamic_Sky_RC1_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ultra_Dynamic_Sky_RC1_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_RC1_C_ReceiveTick) == 0x000004, "Wrong alignment on Ultra_Dynamic_Sky_RC1_C_ReceiveTick");
static_assert(sizeof(Ultra_Dynamic_Sky_RC1_C_ReceiveTick) == 0x000004, "Wrong size on Ultra_Dynamic_Sky_RC1_C_ReceiveTick");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ultra_Dynamic_Sky_RC1_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Ultra_Dynamic_Sky_RC1.Ultra_Dynamic_Sky_RC1_C.ExecuteUbergraph_Ultra_Dynamic_Sky_RC1
// 0x0020 (0x0020 - 0x0000)
struct Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1) == 0x000004, "Wrong alignment on Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1");
static_assert(sizeof(Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1) == 0x000020, "Wrong size on Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1, EntryPoint) == 0x000000, "Member 'Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Ultra_Dynamic_Sky_RC1_C_ExecuteUbergraph_Ultra_Dynamic_Sky_RC1::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
