#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sts_Icon_Speed

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sts_Icon_Speed.WBP_Menu_Sts_Icon_Speed_C
// 0x0020 (0x0308 - 0x02E8)
class UWBP_Menu_Sts_Icon_Speed_C final : public URCUiMenuStatusIcon
{
public:
	class UImage*                                 Icon_Speed_Lv1;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Speed_Lv2;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Speed_Lv3;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Speed;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sts_Icon_Speed_C">();
	}
	static class UWBP_Menu_Sts_Icon_Speed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sts_Icon_Speed_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sts_Icon_Speed_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sts_Icon_Speed_C");
static_assert(sizeof(UWBP_Menu_Sts_Icon_Speed_C) == 0x000308, "Wrong size on UWBP_Menu_Sts_Icon_Speed_C");
static_assert(offsetof(UWBP_Menu_Sts_Icon_Speed_C, Icon_Speed_Lv1) == 0x0002E8, "Member 'UWBP_Menu_Sts_Icon_Speed_C::Icon_Speed_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sts_Icon_Speed_C, Icon_Speed_Lv2) == 0x0002F0, "Member 'UWBP_Menu_Sts_Icon_Speed_C::Icon_Speed_Lv2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sts_Icon_Speed_C, Icon_Speed_Lv3) == 0x0002F8, "Member 'UWBP_Menu_Sts_Icon_Speed_C::Icon_Speed_Lv3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sts_Icon_Speed_C, Switcher_Speed) == 0x000300, "Member 'UWBP_Menu_Sts_Icon_Speed_C::Switcher_Speed' has a wrong offset!");

}

