#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Skip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Skip.WBP_Skip_C
// 0x0038 (0x0348 - 0x0310)
class UWBP_Skip_C final : public URCUiMovieSkip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Skip_BG;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Guide;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextBlockArray;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FName>                           SkipTextIDs;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Skip(int32 EntryPoint);
	void Construct();
	void Set_Text_ID(TArray<class FName>& TextID, TArray<class UTextBlock*>& TextBlock);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Skip_C">();
	}
	static class UWBP_Skip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Skip_C>();
	}
};
static_assert(alignof(UWBP_Skip_C) == 0x000008, "Wrong alignment on UWBP_Skip_C");
static_assert(sizeof(UWBP_Skip_C) == 0x000348, "Wrong size on UWBP_Skip_C");
static_assert(offsetof(UWBP_Skip_C, UberGraphFrame) == 0x000310, "Member 'UWBP_Skip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Skip_C, Img_Skip_BG) == 0x000318, "Member 'UWBP_Skip_C::Img_Skip_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Skip_C, Txt_Guide) == 0x000320, "Member 'UWBP_Skip_C::Txt_Guide' has a wrong offset!");
static_assert(offsetof(UWBP_Skip_C, TextBlockArray) == 0x000328, "Member 'UWBP_Skip_C::TextBlockArray' has a wrong offset!");
static_assert(offsetof(UWBP_Skip_C, SkipTextIDs) == 0x000338, "Member 'UWBP_Skip_C::SkipTextIDs' has a wrong offset!");

}

