#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Cont_Quest

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Cont_Quest.WBP_Menu_Cont_Quest_C.Get_Img_Name_Brush_0
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSoftObjectPath                        TexturePathL01;                                    // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        TexturePathL00;                                    // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00B8(0x0088)()
	struct FSlateBrush                            CallFunc_SelectBrush____;                          // 0x0140(0x0088)()
};
static_assert(alignof(WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0) == 0x000008, "Wrong alignment on WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0");
static_assert(sizeof(WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0) == 0x0001C8, "Wrong size on WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0");
static_assert(offsetof(WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0, ReturnValue) == 0x000000, "Member 'WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0, TexturePathL01) == 0x000088, "Member 'WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0::TexturePathL01' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0, TexturePathL00) == 0x0000A0, "Member 'WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0::TexturePathL00' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0, K2Node_MakeStruct_SlateBrush) == 0x0000B8, "Member 'WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0, CallFunc_SelectBrush____) == 0x000140, "Member 'WBP_Menu_Cont_Quest_C_Get_Img_Name_Brush_0::CallFunc_SelectBrush____' has a wrong offset!");

}

