#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReSelectWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ReSelectWindow.WBP_ReSelectWindow_C.ExecuteUbergraph_WBP_ReSelectWindow
// 0x0038 (0x0038 - 0x0000)
struct WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow) == 0x000008, "Wrong alignment on WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow");
static_assert(sizeof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow) == 0x000038, "Wrong size on WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow");
static_assert(offsetof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow, EntryPoint) == 0x000000, "Member 'WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow, CallFunc_PlayAnimation_ReturnValue_4) == 0x000028, "Member 'WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow, CallFunc_PlayAnimation_ReturnValue_5) == 0x000030, "Member 'WBP_ReSelectWindow_C_ExecuteUbergraph_WBP_ReSelectWindow::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");

// Function WBP_ReSelectWindow.WBP_ReSelectWindow_C.CustomNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_ReSelectWindow_C_CustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReSelectWindow_C_CustomNavigation) == 0x000008, "Wrong alignment on WBP_ReSelectWindow_C_CustomNavigation");
static_assert(sizeof(WBP_ReSelectWindow_C_CustomNavigation) == 0x000018, "Wrong size on WBP_ReSelectWindow_C_CustomNavigation");
static_assert(offsetof(WBP_ReSelectWindow_C_CustomNavigation, Navigation_0) == 0x000000, "Member 'WBP_ReSelectWindow_C_CustomNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_CustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_ReSelectWindow_C_CustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectWindow_C_CustomNavigation, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_ReSelectWindow_C_CustomNavigation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

}

