#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chos_Pointer

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chos_Pointer.WBP_Chos_Pointer_C
// 0x0058 (0x03D8 - 0x0380)
class UWBP_Chos_Pointer_C final : public URCReUiChousaPointer
{
public:
	class UWidgetAnimation*                       AN_Question_In;                                    // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Question;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_Def_Base_C*           Pointer_Def_Base;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_Def_Line_C*           Pointer_Def_Line;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_Def_Ring_C*           Pointer_Def_Ring;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_On_Base_C*            Pointer_On_Base;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_On_Center_C*          Pointer_On_Center;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_On_Gear_C*            Pointer_On_Gear;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_On_Glow_C*            Pointer_On_Glow;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_On_Wing_L_C*          Pointer_On_Wing_L;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_Pointer_On_Wing_R_C*          Pointer_On_Wing_R;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Chos_Pointer_C">();
	}
	static class UWBP_Chos_Pointer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chos_Pointer_C>();
	}
};
static_assert(alignof(UWBP_Chos_Pointer_C) == 0x000008, "Wrong alignment on UWBP_Chos_Pointer_C");
static_assert(sizeof(UWBP_Chos_Pointer_C) == 0x0003D8, "Wrong size on UWBP_Chos_Pointer_C");
static_assert(offsetof(UWBP_Chos_Pointer_C, AN_Question_In) == 0x000380, "Member 'UWBP_Chos_Pointer_C::AN_Question_In' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Img_Question) == 0x000388, "Member 'UWBP_Chos_Pointer_C::Img_Question' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_Def_Base) == 0x000390, "Member 'UWBP_Chos_Pointer_C::Pointer_Def_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_Def_Line) == 0x000398, "Member 'UWBP_Chos_Pointer_C::Pointer_Def_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_Def_Ring) == 0x0003A0, "Member 'UWBP_Chos_Pointer_C::Pointer_Def_Ring' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_On_Base) == 0x0003A8, "Member 'UWBP_Chos_Pointer_C::Pointer_On_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_On_Center) == 0x0003B0, "Member 'UWBP_Chos_Pointer_C::Pointer_On_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_On_Gear) == 0x0003B8, "Member 'UWBP_Chos_Pointer_C::Pointer_On_Gear' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_On_Glow) == 0x0003C0, "Member 'UWBP_Chos_Pointer_C::Pointer_On_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_On_Wing_L) == 0x0003C8, "Member 'UWBP_Chos_Pointer_C::Pointer_On_Wing_L' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Pointer_C, Pointer_On_Wing_R) == 0x0003D0, "Member 'UWBP_Chos_Pointer_C::Pointer_On_Wing_R' has a wrong offset!");

}

