#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Cont_SubQuest

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Cont_SubQuest.WBP_Menu_Cont_SubQuest_C
// 0x0018 (0x03A0 - 0x0388)
class UWBP_Menu_Cont_SubQuest_C final : public URCUiMenuContentsButton
{
public:
	class UWBP_Menu_Cont_Icon_New_C*              Icon_New;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Cont_Icon_Update_C*           Icon_Update;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Name;                                          // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FSlateBrush Get_Img_Name_Brush_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Cont_SubQuest_C">();
	}
	static class UWBP_Menu_Cont_SubQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Cont_SubQuest_C>();
	}
};
static_assert(alignof(UWBP_Menu_Cont_SubQuest_C) == 0x000008, "Wrong alignment on UWBP_Menu_Cont_SubQuest_C");
static_assert(sizeof(UWBP_Menu_Cont_SubQuest_C) == 0x0003A0, "Wrong size on UWBP_Menu_Cont_SubQuest_C");
static_assert(offsetof(UWBP_Menu_Cont_SubQuest_C, Icon_New) == 0x000388, "Member 'UWBP_Menu_Cont_SubQuest_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Cont_SubQuest_C, Icon_Update) == 0x000390, "Member 'UWBP_Menu_Cont_SubQuest_C::Icon_Update' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Cont_SubQuest_C, Img_Name) == 0x000398, "Member 'UWBP_Menu_Cont_SubQuest_C::Img_Name' has a wrong offset!");

}

