#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReSelectEyeTracking

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReSelectEyeTracking.WBP_ReSelectEyeTracking_C
// 0x0058 (0x03D8 - 0x0380)
class UWBP_ReSelectEyeTracking_C final : public URCReUiSelectWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Glow01;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow03;                                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MistFrame01;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MistFrame02;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MistWindow01;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelectEye_Bar_C*                 WBP_ReSelect_Bar_center;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelectEye_Bar_C*                 WBP_ReSelect_Bar_left_0;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelectEye_Bar_C*                 WBP_ReSelect_Bar_left_1;                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelectEye_Bar_C*                 WBP_ReSelect_Bar_right_0;                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelectEye_Bar_C*                 WBP_ReSelect_Bar_right_1;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReSelectEyeTracking(int32 EntryPoint);
	void OnHideStarted();
	void OnShowStarted();
	class UWidget* CustomNavigation(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReSelectEyeTracking_C">();
	}
	static class UWBP_ReSelectEyeTracking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReSelectEyeTracking_C>();
	}
};
static_assert(alignof(UWBP_ReSelectEyeTracking_C) == 0x000008, "Wrong alignment on UWBP_ReSelectEyeTracking_C");
static_assert(sizeof(UWBP_ReSelectEyeTracking_C) == 0x0003D8, "Wrong size on UWBP_ReSelectEyeTracking_C");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, UberGraphFrame) == 0x000380, "Member 'UWBP_ReSelectEyeTracking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, Glow01) == 0x000388, "Member 'UWBP_ReSelectEyeTracking_C::Glow01' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, Glow03) == 0x000390, "Member 'UWBP_ReSelectEyeTracking_C::Glow03' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, MistFrame01) == 0x000398, "Member 'UWBP_ReSelectEyeTracking_C::MistFrame01' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, MistFrame02) == 0x0003A0, "Member 'UWBP_ReSelectEyeTracking_C::MistFrame02' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, MistWindow01) == 0x0003A8, "Member 'UWBP_ReSelectEyeTracking_C::MistWindow01' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, WBP_ReSelect_Bar_center) == 0x0003B0, "Member 'UWBP_ReSelectEyeTracking_C::WBP_ReSelect_Bar_center' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, WBP_ReSelect_Bar_left_0) == 0x0003B8, "Member 'UWBP_ReSelectEyeTracking_C::WBP_ReSelect_Bar_left_0' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, WBP_ReSelect_Bar_left_1) == 0x0003C0, "Member 'UWBP_ReSelectEyeTracking_C::WBP_ReSelect_Bar_left_1' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, WBP_ReSelect_Bar_right_0) == 0x0003C8, "Member 'UWBP_ReSelectEyeTracking_C::WBP_ReSelect_Bar_right_0' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectEyeTracking_C, WBP_ReSelect_Bar_right_1) == 0x0003D0, "Member 'UWBP_ReSelectEyeTracking_C::WBP_ReSelect_Bar_right_1' has a wrong offset!");

}

