#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map_Marker_Bus

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Map_Marker_Bus.WBP_Map_Marker_Bus_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_Map_Marker_Bus_C final : public URCReUiMiniMapIcon
{
public:
	class UImage*                                 Img_Bus;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bus_copy;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Nomark_Icon;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Bus;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Map_Marker_Bus_C">();
	}
	static class UWBP_Map_Marker_Bus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Map_Marker_Bus_C>();
	}
};
static_assert(alignof(UWBP_Map_Marker_Bus_C) == 0x000008, "Wrong alignment on UWBP_Map_Marker_Bus_C");
static_assert(sizeof(UWBP_Map_Marker_Bus_C) == 0x000300, "Wrong size on UWBP_Map_Marker_Bus_C");
static_assert(offsetof(UWBP_Map_Marker_Bus_C, Img_Bus) == 0x0002E0, "Member 'UWBP_Map_Marker_Bus_C::Img_Bus' has a wrong offset!");
static_assert(offsetof(UWBP_Map_Marker_Bus_C, Img_Bus_copy) == 0x0002E8, "Member 'UWBP_Map_Marker_Bus_C::Img_Bus_copy' has a wrong offset!");
static_assert(offsetof(UWBP_Map_Marker_Bus_C, Img_Nomark_Icon) == 0x0002F0, "Member 'UWBP_Map_Marker_Bus_C::Img_Nomark_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Map_Marker_Bus_C, WidgetSwitcher_Bus) == 0x0002F8, "Member 'UWBP_Map_Marker_Bus_C::WidgetSwitcher_Bus' has a wrong offset!");

}

