#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tips

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tips.WBP_Tips_C
// 0x0030 (0x0490 - 0x0460)
class UWBP_Tips_C final : public URCUiTipsScreenWidget
{
public:
	class UImage*                                 Image_93;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Black;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SimpleLoading;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TextLine;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_Tips_Arrow_L;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_Tips_Arrow_R;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tips_C">();
	}
	static class UWBP_Tips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tips_C>();
	}
};
static_assert(alignof(UWBP_Tips_C) == 0x000008, "Wrong alignment on UWBP_Tips_C");
static_assert(sizeof(UWBP_Tips_C) == 0x000490, "Wrong size on UWBP_Tips_C");
static_assert(offsetof(UWBP_Tips_C, Image_93) == 0x000460, "Member 'UWBP_Tips_C::Image_93' has a wrong offset!");
static_assert(offsetof(UWBP_Tips_C, Img_Black) == 0x000468, "Member 'UWBP_Tips_C::Img_Black' has a wrong offset!");
static_assert(offsetof(UWBP_Tips_C, Img_SimpleLoading) == 0x000470, "Member 'UWBP_Tips_C::Img_SimpleLoading' has a wrong offset!");
static_assert(offsetof(UWBP_Tips_C, Img_TextLine) == 0x000478, "Member 'UWBP_Tips_C::Img_TextLine' has a wrong offset!");
static_assert(offsetof(UWBP_Tips_C, MI_UI_Tips_Arrow_L) == 0x000480, "Member 'UWBP_Tips_C::MI_UI_Tips_Arrow_L' has a wrong offset!");
static_assert(offsetof(UWBP_Tips_C, MI_UI_Tips_Arrow_R) == 0x000488, "Member 'UWBP_Tips_C::MI_UI_Tips_Arrow_R' has a wrong offset!");

}

