#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReTalk_NamePL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReTalk_NamePL.WBP_ReTalk_NamePL_C
// 0x0030 (0x0390 - 0x0360)
class UWBP_ReTalk_NamePL_C final : public URCReUiMessageNameplate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Name_Eff;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_NoiseEff;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_NoiseEff_Dummy;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextCharaName_000;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextCharaName_Dummy;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReTalk_NamePL(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReTalk_NamePL_C">();
	}
	static class UWBP_ReTalk_NamePL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReTalk_NamePL_C>();
	}
};
static_assert(alignof(UWBP_ReTalk_NamePL_C) == 0x000008, "Wrong alignment on UWBP_ReTalk_NamePL_C");
static_assert(sizeof(UWBP_ReTalk_NamePL_C) == 0x000390, "Wrong size on UWBP_ReTalk_NamePL_C");
static_assert(offsetof(UWBP_ReTalk_NamePL_C, UberGraphFrame) == 0x000360, "Member 'UWBP_ReTalk_NamePL_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalk_NamePL_C, Image_Name_Eff) == 0x000368, "Member 'UWBP_ReTalk_NamePL_C::Image_Name_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalk_NamePL_C, RetainerBox_NoiseEff) == 0x000370, "Member 'UWBP_ReTalk_NamePL_C::RetainerBox_NoiseEff' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalk_NamePL_C, RetainerBox_NoiseEff_Dummy) == 0x000378, "Member 'UWBP_ReTalk_NamePL_C::RetainerBox_NoiseEff_Dummy' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalk_NamePL_C, TextCharaName_000) == 0x000380, "Member 'UWBP_ReTalk_NamePL_C::TextCharaName_000' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalk_NamePL_C, TextCharaName_Dummy) == 0x000388, "Member 'UWBP_ReTalk_NamePL_C::TextCharaName_Dummy' has a wrong offset!");

}

