#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tutorial_Layout

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Tutorial_Layout.WBP_Menu_Tutorial_Layout_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_Menu_Tutorial_Layout_C final : public URCUiMenuTutorial
{
public:
	class UImage*                                 Image;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_List_C*              Tutorial_List;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Tutorial_Layout_C">();
	}
	static class UWBP_Menu_Tutorial_Layout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Tutorial_Layout_C>();
	}
};
static_assert(alignof(UWBP_Menu_Tutorial_Layout_C) == 0x000008, "Wrong alignment on UWBP_Menu_Tutorial_Layout_C");
static_assert(sizeof(UWBP_Menu_Tutorial_Layout_C) == 0x000320, "Wrong size on UWBP_Menu_Tutorial_Layout_C");
static_assert(offsetof(UWBP_Menu_Tutorial_Layout_C, Image) == 0x000308, "Member 'UWBP_Menu_Tutorial_Layout_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_Layout_C, Image_0) == 0x000310, "Member 'UWBP_Menu_Tutorial_Layout_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_Layout_C, Tutorial_List) == 0x000318, "Member 'UWBP_Menu_Tutorial_Layout_C::Tutorial_List' has a wrong offset!");

}

