#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result.WBP_Result_C
// 0x0090 (0x04E0 - 0x0450)
class UWBP_Result_C final : public URCNzResult
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BTNGuide_Layout_R_Line1_C*         BTNGuide_Layout;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_PlaceHolder_ChapterImage;                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Rank_C*                     WBP_Result_Rank_1;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Rank_C*                     WBP_Result_Rank_2;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Rank_C*                     WBP_Result_Rank_3;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Rank_C*                     WBP_Result_Rank_4;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Rank_C*                     WBP_Result_Rank_5;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_ScoreDetails_C*             WBP_Result_ScoreDetails;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rank0;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rank1;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rank2;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rank3;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rank4;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextBlockArray;                                    // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FName>                           ResultTextIDs;                                     // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Result(int32 EntryPoint);
	void Construct();
	void SetTextID(TArray<class FName>& TextID, TArray<class UTextBlock*>& TextBlock);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_C">();
	}
	static class UWBP_Result_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_C>();
	}
};
static_assert(alignof(UWBP_Result_C) == 0x000008, "Wrong alignment on UWBP_Result_C");
static_assert(sizeof(UWBP_Result_C) == 0x0004E0, "Wrong size on UWBP_Result_C");
static_assert(offsetof(UWBP_Result_C, UberGraphFrame) == 0x000450, "Member 'UWBP_Result_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, BTNGuide_Layout) == 0x000458, "Member 'UWBP_Result_C::BTNGuide_Layout' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, Img_PlaceHolder_ChapterImage) == 0x000460, "Member 'UWBP_Result_C::Img_PlaceHolder_ChapterImage' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WBP_Result_Rank_1) == 0x000468, "Member 'UWBP_Result_C::WBP_Result_Rank_1' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WBP_Result_Rank_2) == 0x000470, "Member 'UWBP_Result_C::WBP_Result_Rank_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WBP_Result_Rank_3) == 0x000478, "Member 'UWBP_Result_C::WBP_Result_Rank_3' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WBP_Result_Rank_4) == 0x000480, "Member 'UWBP_Result_C::WBP_Result_Rank_4' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WBP_Result_Rank_5) == 0x000488, "Member 'UWBP_Result_C::WBP_Result_Rank_5' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WBP_Result_ScoreDetails) == 0x000490, "Member 'UWBP_Result_C::WBP_Result_ScoreDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WidgetSwitcher_Rank0) == 0x000498, "Member 'UWBP_Result_C::WidgetSwitcher_Rank0' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WidgetSwitcher_Rank1) == 0x0004A0, "Member 'UWBP_Result_C::WidgetSwitcher_Rank1' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WidgetSwitcher_Rank2) == 0x0004A8, "Member 'UWBP_Result_C::WidgetSwitcher_Rank2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WidgetSwitcher_Rank3) == 0x0004B0, "Member 'UWBP_Result_C::WidgetSwitcher_Rank3' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, WidgetSwitcher_Rank4) == 0x0004B8, "Member 'UWBP_Result_C::WidgetSwitcher_Rank4' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, TextBlockArray) == 0x0004C0, "Member 'UWBP_Result_C::TextBlockArray' has a wrong offset!");
static_assert(offsetof(UWBP_Result_C, ResultTextIDs) == 0x0004D0, "Member 'UWBP_Result_C::ResultTextIDs' has a wrong offset!");

}

