#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReSelect_Check

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReSelect_Check.WBP_ReSelect_Check_C
// 0x0030 (0x02C8 - 0x0298)
class UWBP_ReSelect_Check_C final : public URCUiWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AN_Finish;                                         // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Wait;                                           // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Start;                                          // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Check_base;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_ReSelect_Check_Icon;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReSelect_Check(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReSelect_Check_C">();
	}
	static class UWBP_ReSelect_Check_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReSelect_Check_C>();
	}
};
static_assert(alignof(UWBP_ReSelect_Check_C) == 0x000008, "Wrong alignment on UWBP_ReSelect_Check_C");
static_assert(sizeof(UWBP_ReSelect_Check_C) == 0x0002C8, "Wrong size on UWBP_ReSelect_Check_C");
static_assert(offsetof(UWBP_ReSelect_Check_C, UberGraphFrame) == 0x000298, "Member 'UWBP_ReSelect_Check_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelect_Check_C, AN_Finish) == 0x0002A0, "Member 'UWBP_ReSelect_Check_C::AN_Finish' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelect_Check_C, AN_Wait) == 0x0002A8, "Member 'UWBP_ReSelect_Check_C::AN_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelect_Check_C, AN_Start) == 0x0002B0, "Member 'UWBP_ReSelect_Check_C::AN_Start' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelect_Check_C, Check_base) == 0x0002B8, "Member 'UWBP_ReSelect_Check_C::Check_base' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelect_Check_C, T_UI_ReSelect_Check_Icon) == 0x0002C0, "Member 'UWBP_ReSelect_Check_C::T_UI_ReSelect_Check_Icon' has a wrong offset!");

}

