#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_NzSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_NzSkill.WBP_Menu_NzSkill_C
// 0x00B0 (0x0460 - 0x03B0)
class UWBP_Menu_NzSkill_C final : public URCUiMenuSkillTree
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Skill_BG;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_A1;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_B1;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_B2;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_B3;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_C1;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_C2;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_C3;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_C4;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_C5;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_D1;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_D2;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_D3;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_D4;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_D5;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_E1;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_E2;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_E3;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_E4;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Set_C*           Skill_Icon_Set_E5;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Detail_C*             WBP_Menu_NzSkill_Detail;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_NzSkill(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_NzSkill_C">();
	}
	static class UWBP_Menu_NzSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_NzSkill_C>();
	}
};
static_assert(alignof(UWBP_Menu_NzSkill_C) == 0x000008, "Wrong alignment on UWBP_Menu_NzSkill_C");
static_assert(sizeof(UWBP_Menu_NzSkill_C) == 0x000460, "Wrong size on UWBP_Menu_NzSkill_C");
static_assert(offsetof(UWBP_Menu_NzSkill_C, UberGraphFrame) == 0x0003B0, "Member 'UWBP_Menu_NzSkill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_BG) == 0x0003B8, "Member 'UWBP_Menu_NzSkill_C::Skill_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_A1) == 0x0003C0, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_A1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_B1) == 0x0003C8, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_B1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_B2) == 0x0003D0, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_B2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_B3) == 0x0003D8, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_B3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_C1) == 0x0003E0, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_C1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_C2) == 0x0003E8, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_C2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_C3) == 0x0003F0, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_C3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_C4) == 0x0003F8, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_C4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_C5) == 0x000400, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_C5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_D1) == 0x000408, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_D1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_D2) == 0x000410, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_D2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_D3) == 0x000418, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_D3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_D4) == 0x000420, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_D4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_D5) == 0x000428, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_D5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_E1) == 0x000430, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_E1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_E2) == 0x000438, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_E2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_E3) == 0x000440, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_E3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_E4) == 0x000448, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_E4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, Skill_Icon_Set_E5) == 0x000450, "Member 'UWBP_Menu_NzSkill_C::Skill_Icon_Set_E5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_C, WBP_Menu_NzSkill_Detail) == 0x000458, "Member 'UWBP_Menu_NzSkill_C::WBP_Menu_NzSkill_Detail' has a wrong offset!");

}

