#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BTNGuide_Layout_L_Line3

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BTNGuide_Layout_L_Line3.WBP_BTNGuide_Layout_L_Line3_C
// 0x0038 (0x0348 - 0x0310)
class UWBP_BTNGuide_Layout_L_Line3_C final : public URCUiButtonGuide
{
public:
	class UImage*                                 BTNGuidePL_01;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BTNGuidePL_02;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BTNGuidePL_03;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     Text_BTNGuide_01;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     Text_BTNGuide_02;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     Text_BTNGuide_03;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BTNGuide_Layout_L_Line3_C">();
	}
	static class UWBP_BTNGuide_Layout_L_Line3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BTNGuide_Layout_L_Line3_C>();
	}
};
static_assert(alignof(UWBP_BTNGuide_Layout_L_Line3_C) == 0x000008, "Wrong alignment on UWBP_BTNGuide_Layout_L_Line3_C");
static_assert(sizeof(UWBP_BTNGuide_Layout_L_Line3_C) == 0x000348, "Wrong size on UWBP_BTNGuide_Layout_L_Line3_C");
static_assert(offsetof(UWBP_BTNGuide_Layout_L_Line3_C, BTNGuidePL_01) == 0x000310, "Member 'UWBP_BTNGuide_Layout_L_Line3_C::BTNGuidePL_01' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_L_Line3_C, BTNGuidePL_02) == 0x000318, "Member 'UWBP_BTNGuide_Layout_L_Line3_C::BTNGuidePL_02' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_L_Line3_C, BTNGuidePL_03) == 0x000320, "Member 'UWBP_BTNGuide_Layout_L_Line3_C::BTNGuidePL_03' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_L_Line3_C, Image_0) == 0x000328, "Member 'UWBP_BTNGuide_Layout_L_Line3_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_L_Line3_C, Text_BTNGuide_01) == 0x000330, "Member 'UWBP_BTNGuide_Layout_L_Line3_C::Text_BTNGuide_01' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_L_Line3_C, Text_BTNGuide_02) == 0x000338, "Member 'UWBP_BTNGuide_Layout_L_Line3_C::Text_BTNGuide_02' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_L_Line3_C, Text_BTNGuide_03) == 0x000340, "Member 'UWBP_BTNGuide_Layout_L_Line3_C::Text_BTNGuide_03' has a wrong offset!");

}

