#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_AMap

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_AMap.WBP_Menu_AMap_C
// 0x0048 (0x0430 - 0x03E8)
class UWBP_Menu_AMap_C final : public URCUiMenuAreaMap
{
public:
	class UImage*                                 Img_BG;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_AreaMap_BackMoya;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_AreaMap_Base_MapDeco_01;                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_AreaMap_Base_MapDeco_02;                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_AreaMap_Base_MapDeco_03;                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_AreaMap_Base_Text;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AreaMap_Guide_C*                   WBP_AreaMap_Guide;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_AMap_Map_C*                   WBP_UI_Menu_AMap_Map;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Paegr_C*                           WBP_UI_Paegr;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_AMap_C">();
	}
	static class UWBP_Menu_AMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_AMap_C>();
	}
};
static_assert(alignof(UWBP_Menu_AMap_C) == 0x000008, "Wrong alignment on UWBP_Menu_AMap_C");
static_assert(sizeof(UWBP_Menu_AMap_C) == 0x000430, "Wrong size on UWBP_Menu_AMap_C");
static_assert(offsetof(UWBP_Menu_AMap_C, Img_BG) == 0x0003E8, "Member 'UWBP_Menu_AMap_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, T_UI_AreaMap_BackMoya) == 0x0003F0, "Member 'UWBP_Menu_AMap_C::T_UI_AreaMap_BackMoya' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, T_UI_AreaMap_Base_MapDeco_01) == 0x0003F8, "Member 'UWBP_Menu_AMap_C::T_UI_AreaMap_Base_MapDeco_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, T_UI_AreaMap_Base_MapDeco_02) == 0x000400, "Member 'UWBP_Menu_AMap_C::T_UI_AreaMap_Base_MapDeco_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, T_UI_AreaMap_Base_MapDeco_03) == 0x000408, "Member 'UWBP_Menu_AMap_C::T_UI_AreaMap_Base_MapDeco_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, T_UI_AreaMap_Base_Text) == 0x000410, "Member 'UWBP_Menu_AMap_C::T_UI_AreaMap_Base_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, WBP_AreaMap_Guide) == 0x000418, "Member 'UWBP_Menu_AMap_C::WBP_AreaMap_Guide' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, WBP_UI_Menu_AMap_Map) == 0x000420, "Member 'UWBP_Menu_AMap_C::WBP_UI_Menu_AMap_Map' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_C, WBP_UI_Paegr) == 0x000428, "Member 'UWBP_Menu_AMap_C::WBP_UI_Paegr' has a wrong offset!");

}

