#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_NzSkill_SetIcon_Class

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_NzSkill_SetIcon_Class.WBP_Menu_NzSkill_SetIcon_Class_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_Menu_NzSkill_SetIcon_Class_C final : public URCUiMenuSkillTypeIcon
{
public:
	class UWBP_Menu_NzSkill_SetIcon_Class_Attack_C* SetIcon_Class_Attack;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_SetIcon_Class_HP_C*   SetIcon_Class_HP;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_SetIcon_Class_Speed_C* SetIcon_Class_Speed;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_SetIcon_Class;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_NzSkill_SetIcon_Class_C">();
	}
	static class UWBP_Menu_NzSkill_SetIcon_Class_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_NzSkill_SetIcon_Class_C>();
	}
};
static_assert(alignof(UWBP_Menu_NzSkill_SetIcon_Class_C) == 0x000008, "Wrong alignment on UWBP_Menu_NzSkill_SetIcon_Class_C");
static_assert(sizeof(UWBP_Menu_NzSkill_SetIcon_Class_C) == 0x000310, "Wrong size on UWBP_Menu_NzSkill_SetIcon_Class_C");
static_assert(offsetof(UWBP_Menu_NzSkill_SetIcon_Class_C, SetIcon_Class_Attack) == 0x0002F0, "Member 'UWBP_Menu_NzSkill_SetIcon_Class_C::SetIcon_Class_Attack' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SetIcon_Class_C, SetIcon_Class_HP) == 0x0002F8, "Member 'UWBP_Menu_NzSkill_SetIcon_Class_C::SetIcon_Class_HP' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SetIcon_Class_C, SetIcon_Class_Speed) == 0x000300, "Member 'UWBP_Menu_NzSkill_SetIcon_Class_C::SetIcon_Class_Speed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SetIcon_Class_C, Switcher_SetIcon_Class) == 0x000308, "Member 'UWBP_Menu_NzSkill_SetIcon_Class_C::Switcher_SetIcon_Class' has a wrong offset!");

}

