#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_SubQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_SubQuest.WBP_Menu_SubQuest_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_Menu_SubQuest_C final : public URCUiMenuSubQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Menu_Com_Tab_C*                    Menu_Com_Tab;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Quest_List_C*                 Quest_List;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quest_List_Bg;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quest_List_Bg_1;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_SubQuest_Detail_Layout_C*     SubQuest_Detail_Layout;                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_SubQuest(int32 EntryPoint);
	void RegistTutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_SubQuest_C">();
	}
	static class UWBP_Menu_SubQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_SubQuest_C>();
	}
};
static_assert(alignof(UWBP_Menu_SubQuest_C) == 0x000008, "Wrong alignment on UWBP_Menu_SubQuest_C");
static_assert(sizeof(UWBP_Menu_SubQuest_C) == 0x000370, "Wrong size on UWBP_Menu_SubQuest_C");
static_assert(offsetof(UWBP_Menu_SubQuest_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Menu_SubQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_C, Menu_Com_Tab) == 0x000348, "Member 'UWBP_Menu_SubQuest_C::Menu_Com_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_C, Quest_List) == 0x000350, "Member 'UWBP_Menu_SubQuest_C::Quest_List' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_C, Quest_List_Bg) == 0x000358, "Member 'UWBP_Menu_SubQuest_C::Quest_List_Bg' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_C, Quest_List_Bg_1) == 0x000360, "Member 'UWBP_Menu_SubQuest_C::Quest_List_Bg_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_C, SubQuest_Detail_Layout) == 0x000368, "Member 'UWBP_Menu_SubQuest_C::SubQuest_Detail_Layout' has a wrong offset!");

}

