#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReSelectWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReSelectWindow.WBP_ReSelectWindow_C
// 0x0068 (0x03E8 - 0x0380)
class UWBP_ReSelectWindow_C final : public URCReUiSelectWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Glow01;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow03;                                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MistFrame01;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MistFrame02;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MistWindow01;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelect_Bar_C*                    ReSelect_Bar_000;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelect_Bar_01_C*                 ReSelect_Bar_001;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelect_Bar_02_C*                 ReSelect_Bar_002;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelect_Bar_03_C*                 ReSelect_Bar_003;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelect_Bar_04_C*                 ReSelect_Bar_004;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelect_Bar_05_C*                 ReSelect_Bar_005;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReSelect_InsertImage_C*            WBP_ReSelect_InsertImage;                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReSelectWindow(int32 EntryPoint);
	void OnShowStarted();
	void OnHideStarted();
	class UWidget* CustomNavigation(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReSelectWindow_C">();
	}
	static class UWBP_ReSelectWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReSelectWindow_C>();
	}
};
static_assert(alignof(UWBP_ReSelectWindow_C) == 0x000008, "Wrong alignment on UWBP_ReSelectWindow_C");
static_assert(sizeof(UWBP_ReSelectWindow_C) == 0x0003E8, "Wrong size on UWBP_ReSelectWindow_C");
static_assert(offsetof(UWBP_ReSelectWindow_C, UberGraphFrame) == 0x000380, "Member 'UWBP_ReSelectWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, Glow01) == 0x000388, "Member 'UWBP_ReSelectWindow_C::Glow01' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, Glow03) == 0x000390, "Member 'UWBP_ReSelectWindow_C::Glow03' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, MistFrame01) == 0x000398, "Member 'UWBP_ReSelectWindow_C::MistFrame01' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, MistFrame02) == 0x0003A0, "Member 'UWBP_ReSelectWindow_C::MistFrame02' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, MistWindow01) == 0x0003A8, "Member 'UWBP_ReSelectWindow_C::MistWindow01' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, ReSelect_Bar_000) == 0x0003B0, "Member 'UWBP_ReSelectWindow_C::ReSelect_Bar_000' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, ReSelect_Bar_001) == 0x0003B8, "Member 'UWBP_ReSelectWindow_C::ReSelect_Bar_001' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, ReSelect_Bar_002) == 0x0003C0, "Member 'UWBP_ReSelectWindow_C::ReSelect_Bar_002' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, ReSelect_Bar_003) == 0x0003C8, "Member 'UWBP_ReSelectWindow_C::ReSelect_Bar_003' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, ReSelect_Bar_004) == 0x0003D0, "Member 'UWBP_ReSelectWindow_C::ReSelect_Bar_004' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, ReSelect_Bar_005) == 0x0003D8, "Member 'UWBP_ReSelectWindow_C::ReSelect_Bar_005' has a wrong offset!");
static_assert(offsetof(UWBP_ReSelectWindow_C, WBP_ReSelect_InsertImage) == 0x0003E0, "Member 'UWBP_ReSelectWindow_C::WBP_ReSelect_InsertImage' has a wrong offset!");

}

