#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chos_GetKagi

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chos_GetKagi.WBP_Chos_GetKagi_C
// 0x0058 (0x03E8 - 0x0390)
class UWBP_Chos_GetKagi_C final : public URCReUiChousaGetKagi
{
public:
	class UImage*                                 BasePL_Caption;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BasePL_Name;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_UpdateEff;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Kagi_Image;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 M_UI_Chos_GetKagi_Frame;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReTalk_Cursor_C*                   ReTalk_Cursor;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_Chos_GetKagi_Deco_Kagi;                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_Chos_GetKagi_Deco_Kagi_2;                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_GetKagi_RainBase_C*           WBP_Chos_GetKagi_RainBase;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Get;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Update;                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Chos_GetKagi_C">();
	}
	static class UWBP_Chos_GetKagi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chos_GetKagi_C>();
	}
};
static_assert(alignof(UWBP_Chos_GetKagi_C) == 0x000008, "Wrong alignment on UWBP_Chos_GetKagi_C");
static_assert(sizeof(UWBP_Chos_GetKagi_C) == 0x0003E8, "Wrong size on UWBP_Chos_GetKagi_C");
static_assert(offsetof(UWBP_Chos_GetKagi_C, BasePL_Caption) == 0x000390, "Member 'UWBP_Chos_GetKagi_C::BasePL_Caption' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, BasePL_Name) == 0x000398, "Member 'UWBP_Chos_GetKagi_C::BasePL_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, Img_UpdateEff) == 0x0003A0, "Member 'UWBP_Chos_GetKagi_C::Img_UpdateEff' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, Kagi_Image) == 0x0003A8, "Member 'UWBP_Chos_GetKagi_C::Kagi_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, M_UI_Chos_GetKagi_Frame) == 0x0003B0, "Member 'UWBP_Chos_GetKagi_C::M_UI_Chos_GetKagi_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, ReTalk_Cursor) == 0x0003B8, "Member 'UWBP_Chos_GetKagi_C::ReTalk_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, T_UI_Chos_GetKagi_Deco_Kagi) == 0x0003C0, "Member 'UWBP_Chos_GetKagi_C::T_UI_Chos_GetKagi_Deco_Kagi' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, T_UI_Chos_GetKagi_Deco_Kagi_2) == 0x0003C8, "Member 'UWBP_Chos_GetKagi_C::T_UI_Chos_GetKagi_Deco_Kagi_2' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, WBP_Chos_GetKagi_RainBase) == 0x0003D0, "Member 'UWBP_Chos_GetKagi_C::WBP_Chos_GetKagi_RainBase' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, WidgetSwitcher_Get) == 0x0003D8, "Member 'UWBP_Chos_GetKagi_C::WidgetSwitcher_Get' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_GetKagi_C, WidgetSwitcher_Update) == 0x0003E0, "Member 'UWBP_Chos_GetKagi_C::WidgetSwitcher_Update' has a wrong offset!");

}

