#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_TitleMenu_List

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Title_TitleMenu_List.WBP_Title_TitleMenu_List_C
// 0x0048 (0x0380 - 0x0338)
class UWBP_Title_TitleMenu_List_C final : public URCTitleMenuList
{
public:
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_00;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_01;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_02;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_03;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_04;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_05;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_06;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_07;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_TitleMenu_List_Item_C*       List_Item_08;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Title_TitleMenu_List_C">();
	}
	static class UWBP_Title_TitleMenu_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Title_TitleMenu_List_C>();
	}
};
static_assert(alignof(UWBP_Title_TitleMenu_List_C) == 0x000008, "Wrong alignment on UWBP_Title_TitleMenu_List_C");
static_assert(sizeof(UWBP_Title_TitleMenu_List_C) == 0x000380, "Wrong size on UWBP_Title_TitleMenu_List_C");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_00) == 0x000338, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_00' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_01) == 0x000340, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_01' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_02) == 0x000348, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_02' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_03) == 0x000350, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_03' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_04) == 0x000358, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_04' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_05) == 0x000360, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_05' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_06) == 0x000368, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_06' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_07) == 0x000370, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_07' has a wrong offset!");
static_assert(offsetof(UWBP_Title_TitleMenu_List_C, List_Item_08) == 0x000378, "Member 'UWBP_Title_TitleMenu_List_C::List_Item_08' has a wrong offset!");

}

