#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_Language_Window

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Title_Language_Window.WBP_Title_Language_Window_C
// 0x0060 (0x0370 - 0x0310)
class UWBP_Title_Language_Window_C final : public URCTitleLanguageWindow
{
public:
	class UWidgetAnimation*                       AN_Off;                                            // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Finish;                                         // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Wait;                                           // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Start;                                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_00;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_01;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_02;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_03;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_04;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_05;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_06;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Language_Window_Item_C*      Window_Item_07;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Title_Language_Window_C">();
	}
	static class UWBP_Title_Language_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Title_Language_Window_C>();
	}
};
static_assert(alignof(UWBP_Title_Language_Window_C) == 0x000008, "Wrong alignment on UWBP_Title_Language_Window_C");
static_assert(sizeof(UWBP_Title_Language_Window_C) == 0x000370, "Wrong size on UWBP_Title_Language_Window_C");
static_assert(offsetof(UWBP_Title_Language_Window_C, AN_Off) == 0x000310, "Member 'UWBP_Title_Language_Window_C::AN_Off' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, AN_Finish) == 0x000318, "Member 'UWBP_Title_Language_Window_C::AN_Finish' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, AN_Wait) == 0x000320, "Member 'UWBP_Title_Language_Window_C::AN_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, AN_Start) == 0x000328, "Member 'UWBP_Title_Language_Window_C::AN_Start' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_00) == 0x000330, "Member 'UWBP_Title_Language_Window_C::Window_Item_00' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_01) == 0x000338, "Member 'UWBP_Title_Language_Window_C::Window_Item_01' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_02) == 0x000340, "Member 'UWBP_Title_Language_Window_C::Window_Item_02' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_03) == 0x000348, "Member 'UWBP_Title_Language_Window_C::Window_Item_03' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_04) == 0x000350, "Member 'UWBP_Title_Language_Window_C::Window_Item_04' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_05) == 0x000358, "Member 'UWBP_Title_Language_Window_C::Window_Item_05' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_06) == 0x000360, "Member 'UWBP_Title_Language_Window_C::Window_Item_06' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Language_Window_C, Window_Item_07) == 0x000368, "Member 'UWBP_Title_Language_Window_C::Window_Item_07' has a wrong offset!");

}

