#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_NzSkill_SetIcon_Get

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_NzSkill_SetIcon_Get.WBP_Menu_NzSkill_SetIcon_Get_C
// 0x0018 (0x0300 - 0x02E8)
class UWBP_Menu_NzSkill_SetIcon_Get_C final : public URCUiMenuCommonIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Skill_SetIcon_BG;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SetIcon_Get;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_NzSkill_SetIcon_Get_C">();
	}
	static class UWBP_Menu_NzSkill_SetIcon_Get_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_NzSkill_SetIcon_Get_C>();
	}
};
static_assert(alignof(UWBP_Menu_NzSkill_SetIcon_Get_C) == 0x000008, "Wrong alignment on UWBP_Menu_NzSkill_SetIcon_Get_C");
static_assert(sizeof(UWBP_Menu_NzSkill_SetIcon_Get_C) == 0x000300, "Wrong size on UWBP_Menu_NzSkill_SetIcon_Get_C");
static_assert(offsetof(UWBP_Menu_NzSkill_SetIcon_Get_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Menu_NzSkill_SetIcon_Get_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SetIcon_Get_C, Skill_SetIcon_BG) == 0x0002F0, "Member 'UWBP_Menu_NzSkill_SetIcon_Get_C::Skill_SetIcon_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SetIcon_Get_C, Text_SetIcon_Get) == 0x0002F8, "Member 'UWBP_Menu_NzSkill_SetIcon_Get_C::Text_SetIcon_Get' has a wrong offset!");

}

