#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Chara_Sele_Lay_002

#include "Basic.hpp"

#include "RC_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Chara_Sele_Lay_002.WBP_Menu_Chara_Sele_Lay_002_C
// 0x0038 (0x03D0 - 0x0398)
class UWBP_Menu_Chara_Sele_Lay_002_C final : public URCUiMenuCharacterSelect
{
public:
	class UWBP_Menu_Chara_Sele_CharaFace_C*       CharaFace_00;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_CharaFace_C*       CharaFace_01;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_CharaFace_C*       CharaFace_02;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_CharaFace_C*       CharaFace_03;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_CharaFace_C*       CharaFace_04;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_CharaFace_C*       CharaFace_05;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_CharaFace_C*       CharaFace_06;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* ButtonNavigation(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Chara_Sele_Lay_002_C">();
	}
	static class UWBP_Menu_Chara_Sele_Lay_002_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Chara_Sele_Lay_002_C>();
	}
};
static_assert(alignof(UWBP_Menu_Chara_Sele_Lay_002_C) == 0x000008, "Wrong alignment on UWBP_Menu_Chara_Sele_Lay_002_C");
static_assert(sizeof(UWBP_Menu_Chara_Sele_Lay_002_C) == 0x0003D0, "Wrong size on UWBP_Menu_Chara_Sele_Lay_002_C");
static_assert(offsetof(UWBP_Menu_Chara_Sele_Lay_002_C, CharaFace_00) == 0x000398, "Member 'UWBP_Menu_Chara_Sele_Lay_002_C::CharaFace_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_Sele_Lay_002_C, CharaFace_01) == 0x0003A0, "Member 'UWBP_Menu_Chara_Sele_Lay_002_C::CharaFace_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_Sele_Lay_002_C, CharaFace_02) == 0x0003A8, "Member 'UWBP_Menu_Chara_Sele_Lay_002_C::CharaFace_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_Sele_Lay_002_C, CharaFace_03) == 0x0003B0, "Member 'UWBP_Menu_Chara_Sele_Lay_002_C::CharaFace_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_Sele_Lay_002_C, CharaFace_04) == 0x0003B8, "Member 'UWBP_Menu_Chara_Sele_Lay_002_C::CharaFace_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_Sele_Lay_002_C, CharaFace_05) == 0x0003C0, "Member 'UWBP_Menu_Chara_Sele_Lay_002_C::CharaFace_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_Sele_Lay_002_C, CharaFace_06) == 0x0003C8, "Member 'UWBP_Menu_Chara_Sele_Lay_002_C::CharaFace_06' has a wrong offset!");

}

