#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_SubQuest_Detail_Layout

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_SubQuest_Detail_Layout.WBP_Menu_SubQuest_Detail_Layout_C
// 0x0030 (0x0330 - 0x0300)
class UWBP_Menu_SubQuest_Detail_Layout_C final : public URCUiMenuSubQuestDetail
{
public:
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NextTarget_C*                 NextTarget;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_SubQuest_Caption_C*           SubQuest_Caption;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_SubQuest_Client_C*            SubQuest_Client;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_SubQuest_Image_C*             SubQuest_Image;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_SubQuest_Place_C*             SubQuest_Place;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_SubQuest_Detail_Layout_C">();
	}
	static class UWBP_Menu_SubQuest_Detail_Layout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_SubQuest_Detail_Layout_C>();
	}
};
static_assert(alignof(UWBP_Menu_SubQuest_Detail_Layout_C) == 0x000008, "Wrong alignment on UWBP_Menu_SubQuest_Detail_Layout_C");
static_assert(sizeof(UWBP_Menu_SubQuest_Detail_Layout_C) == 0x000330, "Wrong size on UWBP_Menu_SubQuest_Detail_Layout_C");
static_assert(offsetof(UWBP_Menu_SubQuest_Detail_Layout_C, Image_0) == 0x000300, "Member 'UWBP_Menu_SubQuest_Detail_Layout_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_Detail_Layout_C, NextTarget) == 0x000308, "Member 'UWBP_Menu_SubQuest_Detail_Layout_C::NextTarget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_Detail_Layout_C, SubQuest_Caption) == 0x000310, "Member 'UWBP_Menu_SubQuest_Detail_Layout_C::SubQuest_Caption' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_Detail_Layout_C, SubQuest_Client) == 0x000318, "Member 'UWBP_Menu_SubQuest_Detail_Layout_C::SubQuest_Client' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_Detail_Layout_C, SubQuest_Image) == 0x000320, "Member 'UWBP_Menu_SubQuest_Detail_Layout_C::SubQuest_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_SubQuest_Detail_Layout_C, SubQuest_Place) == 0x000328, "Member 'UWBP_Menu_SubQuest_Detail_Layout_C::SubQuest_Place' has a wrong offset!");

}

