#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Kagi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Kagi.WBP_Menu_Kagi_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_Menu_Kagi_C final : public URCUiMenuKagi
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Menu_Com_Window_Info_C*            Com_Window_Info;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_Caption_C*               Kagi_Caption;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_Image_C*                 Kagi_Image;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_List_C*                  Kagi_List;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_NzBG_C*                  WBP_Menu_Kagi_NzBG;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RegistTutorial();
	void ExecuteUbergraph_WBP_Menu_Kagi(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Kagi_C">();
	}
	static class UWBP_Menu_Kagi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Kagi_C>();
	}
};
static_assert(alignof(UWBP_Menu_Kagi_C) == 0x000008, "Wrong alignment on UWBP_Menu_Kagi_C");
static_assert(sizeof(UWBP_Menu_Kagi_C) == 0x000370, "Wrong size on UWBP_Menu_Kagi_C");
static_assert(offsetof(UWBP_Menu_Kagi_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Menu_Kagi_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_C, Com_Window_Info) == 0x000348, "Member 'UWBP_Menu_Kagi_C::Com_Window_Info' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_C, Kagi_Caption) == 0x000350, "Member 'UWBP_Menu_Kagi_C::Kagi_Caption' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_C, Kagi_Image) == 0x000358, "Member 'UWBP_Menu_Kagi_C::Kagi_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_C, Kagi_List) == 0x000360, "Member 'UWBP_Menu_Kagi_C::Kagi_List' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_C, WBP_Menu_Kagi_NzBG) == 0x000368, "Member 'UWBP_Menu_Kagi_C::WBP_Menu_Kagi_NzBG' has a wrong offset!");

}

