#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Gallery_Layout

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Gallery_Layout.WBP_Gallery_Layout_C
// 0x0020 (0x0338 - 0x0318)
class UWBP_Gallery_Layout_C final : public URCTitleGalleryMovie
{
public:
	class UWBP_Gallery_Image_C*                   WBP_Gallery_Image;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_ImageTitleName_C*          WBP_Gallery_ImageTitleName;                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_List_C*                    WBP_Gallery_List;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Window_Info_C*             WBP_Gallery_Window_Info;                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Gallery_Layout_C">();
	}
	static class UWBP_Gallery_Layout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Gallery_Layout_C>();
	}
};
static_assert(alignof(UWBP_Gallery_Layout_C) == 0x000008, "Wrong alignment on UWBP_Gallery_Layout_C");
static_assert(sizeof(UWBP_Gallery_Layout_C) == 0x000338, "Wrong size on UWBP_Gallery_Layout_C");
static_assert(offsetof(UWBP_Gallery_Layout_C, WBP_Gallery_Image) == 0x000318, "Member 'UWBP_Gallery_Layout_C::WBP_Gallery_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Layout_C, WBP_Gallery_ImageTitleName) == 0x000320, "Member 'UWBP_Gallery_Layout_C::WBP_Gallery_ImageTitleName' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Layout_C, WBP_Gallery_List) == 0x000328, "Member 'UWBP_Gallery_Layout_C::WBP_Gallery_List' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Layout_C, WBP_Gallery_Window_Info) == 0x000330, "Member 'UWBP_Gallery_Layout_C::WBP_Gallery_Window_Info' has a wrong offset!");

}

