#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReTalk_Cursor_Circle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReTalk_Cursor_Circle.WBP_ReTalk_Cursor_Circle_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_ReTalk_Cursor_Circle_C final : public URCReUiMessageCursorParts
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Cursor_circle_00;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_circle_01;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReTalk_Cursor_Circle(int32 EntryPoint);
	void OnHideStarted();
	void OnShowStarted();
	void OnShowFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReTalk_Cursor_Circle_C">();
	}
	static class UWBP_ReTalk_Cursor_Circle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReTalk_Cursor_Circle_C>();
	}
};
static_assert(alignof(UWBP_ReTalk_Cursor_Circle_C) == 0x000008, "Wrong alignment on UWBP_ReTalk_Cursor_Circle_C");
static_assert(sizeof(UWBP_ReTalk_Cursor_Circle_C) == 0x0002F8, "Wrong size on UWBP_ReTalk_Cursor_Circle_C");
static_assert(offsetof(UWBP_ReTalk_Cursor_Circle_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ReTalk_Cursor_Circle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalk_Cursor_Circle_C, Cursor_circle_00) == 0x0002E8, "Member 'UWBP_ReTalk_Cursor_Circle_C::Cursor_circle_00' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalk_Cursor_Circle_C, Cursor_circle_01) == 0x0002F0, "Member 'UWBP_ReTalk_Cursor_Circle_C::Cursor_circle_01' has a wrong offset!");

}

