#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Character_Select

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Character_Select.WBP_Menu_Character_Select_C
// 0x0068 (0x0390 - 0x0328)
class UWBP_Menu_Character_Select_C final : public URCUiMenuCharacter
{
public:
	class UWBP_Menu_Chara_Sele_Lay_000_C*         Layout_000;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_001_C*         Layout_001;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_002_C*         Layout_002;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_003_C*         Layout_003;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_004_C*         Layout_004;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_005_C*         Layout_005;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_006_C*         Layout_006;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_021_C*         Layout_021;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_022_C*         Layout_022;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_023_C*         Layout_023;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_024_C*         Layout_024;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_Sele_Lay_025_C*         Layout_025;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Tab_C*                    Menu_Com_Tab;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Character_Select_C">();
	}
	static class UWBP_Menu_Character_Select_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Character_Select_C>();
	}
};
static_assert(alignof(UWBP_Menu_Character_Select_C) == 0x000008, "Wrong alignment on UWBP_Menu_Character_Select_C");
static_assert(sizeof(UWBP_Menu_Character_Select_C) == 0x000390, "Wrong size on UWBP_Menu_Character_Select_C");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_000) == 0x000328, "Member 'UWBP_Menu_Character_Select_C::Layout_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_001) == 0x000330, "Member 'UWBP_Menu_Character_Select_C::Layout_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_002) == 0x000338, "Member 'UWBP_Menu_Character_Select_C::Layout_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_003) == 0x000340, "Member 'UWBP_Menu_Character_Select_C::Layout_003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_004) == 0x000348, "Member 'UWBP_Menu_Character_Select_C::Layout_004' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_005) == 0x000350, "Member 'UWBP_Menu_Character_Select_C::Layout_005' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_006) == 0x000358, "Member 'UWBP_Menu_Character_Select_C::Layout_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_021) == 0x000360, "Member 'UWBP_Menu_Character_Select_C::Layout_021' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_022) == 0x000368, "Member 'UWBP_Menu_Character_Select_C::Layout_022' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_023) == 0x000370, "Member 'UWBP_Menu_Character_Select_C::Layout_023' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_024) == 0x000378, "Member 'UWBP_Menu_Character_Select_C::Layout_024' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Layout_025) == 0x000380, "Member 'UWBP_Menu_Character_Select_C::Layout_025' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Select_C, Menu_Com_Tab) == 0x000388, "Member 'UWBP_Menu_Character_Select_C::Menu_Com_Tab' has a wrong offset!");

}

