#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_NzSkill_SetIcon_Get

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_NzSkill_SetIcon_Get.WBP_Menu_NzSkill_SetIcon_Get_C.ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get) == 0x000008, "Wrong alignment on WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get");
static_assert(sizeof(WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get) == 0x000030, "Wrong size on WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get");
static_assert(offsetof(WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get, EntryPoint) == 0x000000, "Member 'WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Menu_NzSkill_SetIcon_Get_C_ExecuteUbergraph_WBP_Menu_NzSkill_SetIcon_Get::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

