#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BackLog_Item

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BackLog_Item.WBP_BackLog_Item_C
// 0x0038 (0x03A8 - 0x0370)
class UWBP_BackLog_Item_C final : public URCUiBackLogItem
{
public:
	class UImage*                                 Img_Face_Replace;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_BackLog_Base_TextOff2;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_BackLog_Base_TextOn2;                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TextLine_01;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TextLine_02;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TextLine_03;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_VoiceIcon;                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BackLog_Item_C">();
	}
	static class UWBP_BackLog_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BackLog_Item_C>();
	}
};
static_assert(alignof(UWBP_BackLog_Item_C) == 0x000008, "Wrong alignment on UWBP_BackLog_Item_C");
static_assert(sizeof(UWBP_BackLog_Item_C) == 0x0003A8, "Wrong size on UWBP_BackLog_Item_C");
static_assert(offsetof(UWBP_BackLog_Item_C, Img_Face_Replace) == 0x000370, "Member 'UWBP_BackLog_Item_C::Img_Face_Replace' has a wrong offset!");
static_assert(offsetof(UWBP_BackLog_Item_C, T_UI_BackLog_Base_TextOff2) == 0x000378, "Member 'UWBP_BackLog_Item_C::T_UI_BackLog_Base_TextOff2' has a wrong offset!");
static_assert(offsetof(UWBP_BackLog_Item_C, T_UI_BackLog_Base_TextOn2) == 0x000380, "Member 'UWBP_BackLog_Item_C::T_UI_BackLog_Base_TextOn2' has a wrong offset!");
static_assert(offsetof(UWBP_BackLog_Item_C, TextLine_01) == 0x000388, "Member 'UWBP_BackLog_Item_C::TextLine_01' has a wrong offset!");
static_assert(offsetof(UWBP_BackLog_Item_C, TextLine_02) == 0x000390, "Member 'UWBP_BackLog_Item_C::TextLine_02' has a wrong offset!");
static_assert(offsetof(UWBP_BackLog_Item_C, TextLine_03) == 0x000398, "Member 'UWBP_BackLog_Item_C::TextLine_03' has a wrong offset!");
static_assert(offsetof(UWBP_BackLog_Item_C, WidgetSwitcher_VoiceIcon) == 0x0003A0, "Member 'UWBP_BackLog_Item_C::WidgetSwitcher_VoiceIcon' has a wrong offset!");

}

