#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_Save_Check

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Title_Save_Check.WBP_Title_Save_Check_C
// 0x0018 (0x0328 - 0x0310)
class UWBP_Title_Save_Check_C final : public URCTitleSaveCheck
{
public:
	class UWBP_Title_Save_Check_Icon_C*           Save_Check_Icon;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Saving_C*                          Saving_Icon;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StartUp_Bg;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Title_Save_Check_C">();
	}
	static class UWBP_Title_Save_Check_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Title_Save_Check_C>();
	}
};
static_assert(alignof(UWBP_Title_Save_Check_C) == 0x000008, "Wrong alignment on UWBP_Title_Save_Check_C");
static_assert(sizeof(UWBP_Title_Save_Check_C) == 0x000328, "Wrong size on UWBP_Title_Save_Check_C");
static_assert(offsetof(UWBP_Title_Save_Check_C, Save_Check_Icon) == 0x000310, "Member 'UWBP_Title_Save_Check_C::Save_Check_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Save_Check_C, Saving_Icon) == 0x000318, "Member 'UWBP_Title_Save_Check_C::Saving_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Title_Save_Check_C, StartUp_Bg) == 0x000320, "Member 'UWBP_Title_Save_Check_C::StartUp_Bg' has a wrong offset!");

}

