#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Gallery_Sound_List

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Gallery_Sound_List.WBP_Gallery_Sound_List_C
// 0x0048 (0x03E8 - 0x03A0)
class UWBP_Gallery_Sound_List_C final : public URCTitleGalleryBGMList
{
public:
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_00;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_01;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_02;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_03;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_04;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_05;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_06;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_07;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Gallery_Sound_ListBar_C*           Sound_ListBar_08;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Gallery_Sound_List_C">();
	}
	static class UWBP_Gallery_Sound_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Gallery_Sound_List_C>();
	}
};
static_assert(alignof(UWBP_Gallery_Sound_List_C) == 0x000008, "Wrong alignment on UWBP_Gallery_Sound_List_C");
static_assert(sizeof(UWBP_Gallery_Sound_List_C) == 0x0003E8, "Wrong size on UWBP_Gallery_Sound_List_C");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_00) == 0x0003A0, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_00' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_01) == 0x0003A8, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_01' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_02) == 0x0003B0, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_02' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_03) == 0x0003B8, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_03' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_04) == 0x0003C0, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_04' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_05) == 0x0003C8, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_05' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_06) == 0x0003D0, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_06' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_07) == 0x0003D8, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_07' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_List_C, Sound_ListBar_08) == 0x0003E0, "Member 'UWBP_Gallery_Sound_List_C::Sound_ListBar_08' has a wrong offset!");

}

