#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReBalloon_Cloud_l_base

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReBalloon_Cloud_l_base.WBP_ReBalloon_Cloud_l_base_C
// 0x0018 (0x0318 - 0x0300)
class UWBP_ReBalloon_Cloud_l_base_C final : public URCReUiBalloonLargeCloud
{
public:
	class UImage*                                 T_bg_l;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_bg_s;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PushButton_C*                      WBP_PushButton;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReBalloon_Cloud_l_base_C">();
	}
	static class UWBP_ReBalloon_Cloud_l_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReBalloon_Cloud_l_base_C>();
	}
};
static_assert(alignof(UWBP_ReBalloon_Cloud_l_base_C) == 0x000008, "Wrong alignment on UWBP_ReBalloon_Cloud_l_base_C");
static_assert(sizeof(UWBP_ReBalloon_Cloud_l_base_C) == 0x000318, "Wrong size on UWBP_ReBalloon_Cloud_l_base_C");
static_assert(offsetof(UWBP_ReBalloon_Cloud_l_base_C, T_bg_l) == 0x000300, "Member 'UWBP_ReBalloon_Cloud_l_base_C::T_bg_l' has a wrong offset!");
static_assert(offsetof(UWBP_ReBalloon_Cloud_l_base_C, T_bg_s) == 0x000308, "Member 'UWBP_ReBalloon_Cloud_l_base_C::T_bg_s' has a wrong offset!");
static_assert(offsetof(UWBP_ReBalloon_Cloud_l_base_C, WBP_PushButton) == 0x000310, "Member 'UWBP_ReBalloon_Cloud_l_base_C::WBP_PushButton' has a wrong offset!");

}

