#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_KagiSelect_List

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_KagiSelect_List.WBP_Menu_KagiSelect_List_C
// 0x0028 (0x03C0 - 0x0398)
class UWBP_Menu_KagiSelect_List_C final : public URCUiMenuKagiList
{
public:
	class UWBP_Menu_KagiSelect_ListBar_C*         Kagi_ListBar_00;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_KagiSelect_ListBar_C*         Kagi_ListBar_01;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_KagiSelect_ListBar_C*         Kagi_ListBar_02;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_KagiSelect_ListBar_C*         Kagi_ListBar_03;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_KagiSelect_ListBar_C*         Kagi_ListBar_04;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_KagiSelect_List_C">();
	}
	static class UWBP_Menu_KagiSelect_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_KagiSelect_List_C>();
	}
};
static_assert(alignof(UWBP_Menu_KagiSelect_List_C) == 0x000008, "Wrong alignment on UWBP_Menu_KagiSelect_List_C");
static_assert(sizeof(UWBP_Menu_KagiSelect_List_C) == 0x0003C0, "Wrong size on UWBP_Menu_KagiSelect_List_C");
static_assert(offsetof(UWBP_Menu_KagiSelect_List_C, Kagi_ListBar_00) == 0x000398, "Member 'UWBP_Menu_KagiSelect_List_C::Kagi_ListBar_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_List_C, Kagi_ListBar_01) == 0x0003A0, "Member 'UWBP_Menu_KagiSelect_List_C::Kagi_ListBar_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_List_C, Kagi_ListBar_02) == 0x0003A8, "Member 'UWBP_Menu_KagiSelect_List_C::Kagi_ListBar_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_List_C, Kagi_ListBar_03) == 0x0003B0, "Member 'UWBP_Menu_KagiSelect_List_C::Kagi_ListBar_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_List_C, Kagi_ListBar_04) == 0x0003B8, "Member 'UWBP_Menu_KagiSelect_List_C::Kagi_ListBar_04' has a wrong offset!");

}

