#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Int_Talk_Dot

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Int_Talk_Dot.WBP_Int_Talk_Dot_C
// 0x0018 (0x0338 - 0x0320)
class UWBP_Int_Talk_Dot_C final : public URCUiInteractTalkDot
{
public:
	class UImage*                                 Talk_Dot_00;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Talk_Dot_01;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Talk_Dot_02;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Int_Talk_Dot_C">();
	}
	static class UWBP_Int_Talk_Dot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Int_Talk_Dot_C>();
	}
};
static_assert(alignof(UWBP_Int_Talk_Dot_C) == 0x000008, "Wrong alignment on UWBP_Int_Talk_Dot_C");
static_assert(sizeof(UWBP_Int_Talk_Dot_C) == 0x000338, "Wrong size on UWBP_Int_Talk_Dot_C");
static_assert(offsetof(UWBP_Int_Talk_Dot_C, Talk_Dot_00) == 0x000320, "Member 'UWBP_Int_Talk_Dot_C::Talk_Dot_00' has a wrong offset!");
static_assert(offsetof(UWBP_Int_Talk_Dot_C, Talk_Dot_01) == 0x000328, "Member 'UWBP_Int_Talk_Dot_C::Talk_Dot_01' has a wrong offset!");
static_assert(offsetof(UWBP_Int_Talk_Dot_C, Talk_Dot_02) == 0x000330, "Member 'UWBP_Int_Talk_Dot_C::Talk_Dot_02' has a wrong offset!");

}

