#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Paegr

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Paegr.WBP_Paegr_C
// 0x0030 (0x0358 - 0x0328)
class UWBP_Paegr_C final : public URCUiMenuAreaMapPager
{
public:
	class UImage*                                 Img_PlaceName_BG;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     WBP_ButtonGuide_L;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     WBP_ButtonGuide_R;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Pager_Item_C*                      WBP_UI_Pager_Item_0;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Pager_Item_C*                      WBP_UI_Pager_Item_1;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Pager_Item_C*                      WBP_UI_Pager_Item_2;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Paegr_C">();
	}
	static class UWBP_Paegr_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Paegr_C>();
	}
};
static_assert(alignof(UWBP_Paegr_C) == 0x000008, "Wrong alignment on UWBP_Paegr_C");
static_assert(sizeof(UWBP_Paegr_C) == 0x000358, "Wrong size on UWBP_Paegr_C");
static_assert(offsetof(UWBP_Paegr_C, Img_PlaceName_BG) == 0x000328, "Member 'UWBP_Paegr_C::Img_PlaceName_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Paegr_C, WBP_ButtonGuide_L) == 0x000330, "Member 'UWBP_Paegr_C::WBP_ButtonGuide_L' has a wrong offset!");
static_assert(offsetof(UWBP_Paegr_C, WBP_ButtonGuide_R) == 0x000338, "Member 'UWBP_Paegr_C::WBP_ButtonGuide_R' has a wrong offset!");
static_assert(offsetof(UWBP_Paegr_C, WBP_UI_Pager_Item_0) == 0x000340, "Member 'UWBP_Paegr_C::WBP_UI_Pager_Item_0' has a wrong offset!");
static_assert(offsetof(UWBP_Paegr_C, WBP_UI_Pager_Item_1) == 0x000348, "Member 'UWBP_Paegr_C::WBP_UI_Pager_Item_1' has a wrong offset!");
static_assert(offsetof(UWBP_Paegr_C, WBP_UI_Pager_Item_2) == 0x000350, "Member 'UWBP_Paegr_C::WBP_UI_Pager_Item_2' has a wrong offset!");

}

