#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_raindrop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Title_raindrop.WBP_Title_raindrop_C.Start
// 0x0018 (0x0018 - 0x0000)
struct WBP_Title_raindrop_C_Start final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_raindrop_C_Start) == 0x000008, "Wrong alignment on WBP_Title_raindrop_C_Start");
static_assert(sizeof(WBP_Title_raindrop_C_Start) == 0x000018, "Wrong size on WBP_Title_raindrop_C_Start");
static_assert(offsetof(WBP_Title_raindrop_C_Start, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'WBP_Title_raindrop_C_Start::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_Start, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_Title_raindrop_C_Start::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_Start, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Title_raindrop_C_Start::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_Start, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'WBP_Title_raindrop_C_Start::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function WBP_Title_raindrop.WBP_Title_raindrop_C.SetArea
// 0x0058 (0x0058 - 0x0000)
struct WBP_Title_raindrop_C_SetArea final
{
public:
	struct FBox2D                                 ReferArea;                                         // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 CallFunc_MakeBox2D_ReturnValue;                    // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Title_raindrop_C_SetArea) == 0x000008, "Wrong alignment on WBP_Title_raindrop_C_SetArea");
static_assert(sizeof(WBP_Title_raindrop_C_SetArea) == 0x000058, "Wrong size on WBP_Title_raindrop_C_SetArea");
static_assert(offsetof(WBP_Title_raindrop_C_SetArea, ReferArea) == 0x000000, "Member 'WBP_Title_raindrop_C_SetArea::ReferArea' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetArea, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_Title_raindrop_C_SetArea::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetArea, CallFunc_GetSize_ReturnValue) == 0x000020, "Member 'WBP_Title_raindrop_C_SetArea::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetArea, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000028, "Member 'WBP_Title_raindrop_C_SetArea::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetArea, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000030, "Member 'WBP_Title_raindrop_C_SetArea::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetArea, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000038, "Member 'WBP_Title_raindrop_C_SetArea::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetArea, CallFunc_MakeBox2D_ReturnValue) == 0x000040, "Member 'WBP_Title_raindrop_C_SetArea::CallFunc_MakeBox2D_ReturnValue' has a wrong offset!");

// Function WBP_Title_raindrop.WBP_Title_raindrop_C.SetPosition
// 0x0040 (0x0040 - 0x0000)
struct WBP_Title_raindrop_C_SetPosition final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_raindrop_C_SetPosition) == 0x000008, "Wrong alignment on WBP_Title_raindrop_C_SetPosition");
static_assert(sizeof(WBP_Title_raindrop_C_SetPosition) == 0x000040, "Wrong size on WBP_Title_raindrop_C_SetPosition");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_BreakVector2D_X_1) == 0x000014, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_BreakVector2D_Y_1) == 0x000018, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_RandomFloat_ReturnValue) == 0x00001C, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000020, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_K2_SetTimer_ReturnValue) == 0x000028, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000030, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Title_raindrop_C_SetPosition, CallFunc_MakeVector2D_ReturnValue_1) == 0x000034, "Member 'WBP_Title_raindrop_C_SetPosition::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

}

