#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReMiniMap_LookAround

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReMiniMap_LookAround.WBP_ReMiniMap_LookAround_C
// 0x0040 (0x0560 - 0x0520)
class UWBP_ReMiniMap_LookAround_C final : public URCReUiMiniMap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Cent;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Direction;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Target;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Direction;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SizeReferrer;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MiniMap_Img;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Mask;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReMiniMap_LookAround(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReMiniMap_LookAround_C">();
	}
	static class UWBP_ReMiniMap_LookAround_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReMiniMap_LookAround_C>();
	}
};
static_assert(alignof(UWBP_ReMiniMap_LookAround_C) == 0x000008, "Wrong alignment on UWBP_ReMiniMap_LookAround_C");
static_assert(sizeof(UWBP_ReMiniMap_LookAround_C) == 0x000560, "Wrong size on UWBP_ReMiniMap_LookAround_C");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, UberGraphFrame) == 0x000520, "Member 'UWBP_ReMiniMap_LookAround_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, CanvasPanel_Cent) == 0x000528, "Member 'UWBP_ReMiniMap_LookAround_C::CanvasPanel_Cent' has a wrong offset!");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, CanvasPanel_Direction) == 0x000530, "Member 'UWBP_ReMiniMap_LookAround_C::CanvasPanel_Direction' has a wrong offset!");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, CanvasPanel_Target) == 0x000538, "Member 'UWBP_ReMiniMap_LookAround_C::CanvasPanel_Target' has a wrong offset!");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, Img_Direction) == 0x000540, "Member 'UWBP_ReMiniMap_LookAround_C::Img_Direction' has a wrong offset!");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, Img_SizeReferrer) == 0x000548, "Member 'UWBP_ReMiniMap_LookAround_C::Img_SizeReferrer' has a wrong offset!");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, MiniMap_Img) == 0x000550, "Member 'UWBP_ReMiniMap_LookAround_C::MiniMap_Img' has a wrong offset!");
static_assert(offsetof(UWBP_ReMiniMap_LookAround_C, RetainerBox_Mask) == 0x000558, "Member 'UWBP_ReMiniMap_LookAround_C::RetainerBox_Mask' has a wrong offset!");

}

