#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WMap_Icon_Subquest

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_WMap_Icon_Subquest.WBP_Menu_WMap_Icon_Subquest_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_Menu_WMap_Icon_Subquest_C final : public URCUiMenuWorldMapIcon
{
public:
	class UWBP_Menu_WMap_Number_C*                Icon_Number;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Subquest;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_WMap_Icon_Subquest_C">();
	}
	static class UWBP_Menu_WMap_Icon_Subquest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_WMap_Icon_Subquest_C>();
	}
};
static_assert(alignof(UWBP_Menu_WMap_Icon_Subquest_C) == 0x000008, "Wrong alignment on UWBP_Menu_WMap_Icon_Subquest_C");
static_assert(sizeof(UWBP_Menu_WMap_Icon_Subquest_C) == 0x000308, "Wrong size on UWBP_Menu_WMap_Icon_Subquest_C");
static_assert(offsetof(UWBP_Menu_WMap_Icon_Subquest_C, Icon_Number) == 0x0002F0, "Member 'UWBP_Menu_WMap_Icon_Subquest_C::Icon_Number' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_Subquest_C, Icon_Subquest) == 0x0002F8, "Member 'UWBP_Menu_WMap_Icon_Subquest_C::Icon_Subquest' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_Subquest_C, Image_0) == 0x000300, "Member 'UWBP_Menu_WMap_Icon_Subquest_C::Image_0' has a wrong offset!");

}

