#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Glossary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Glossary.WBP_Menu_Glossary_C
// 0x0028 (0x0348 - 0x0320)
class UWBP_Menu_Glossary_C final : public URCUiMenuGlossaryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Menu_Com_Window_Info_C*            Com_Window_Info;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Glossary_Layout_C*            Glossary_Layout;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Tab_C*                    Menu_Com_Tab;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_Layout_C*            Tutorial_Layout;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Glossary(int32 EntryPoint);
	void RegistTutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Glossary_C">();
	}
	static class UWBP_Menu_Glossary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Glossary_C>();
	}
};
static_assert(alignof(UWBP_Menu_Glossary_C) == 0x000008, "Wrong alignment on UWBP_Menu_Glossary_C");
static_assert(sizeof(UWBP_Menu_Glossary_C) == 0x000348, "Wrong size on UWBP_Menu_Glossary_C");
static_assert(offsetof(UWBP_Menu_Glossary_C, UberGraphFrame) == 0x000320, "Member 'UWBP_Menu_Glossary_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Glossary_C, Com_Window_Info) == 0x000328, "Member 'UWBP_Menu_Glossary_C::Com_Window_Info' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Glossary_C, Glossary_Layout) == 0x000330, "Member 'UWBP_Menu_Glossary_C::Glossary_Layout' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Glossary_C, Menu_Com_Tab) == 0x000338, "Member 'UWBP_Menu_Glossary_C::Menu_Com_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Glossary_C, Tutorial_Layout) == 0x000340, "Member 'UWBP_Menu_Glossary_C::Tutorial_Layout' has a wrong offset!");

}

