#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_SubStory

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Title_SubStory.WBP_Title_SubStory_C
// 0x0028 (0x0380 - 0x0358)
class UWBP_Title_SubStory_C final : public URCTitleSubStory
{
public:
	class UWBP_Title_ChapterSelect_Caption_C*     ChapterSelect_Caption;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_SubStory_Image_C*            SubStory_Image;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_SubStory_List_C*             SubStory_List;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_Help_C*                      Title_Help;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_SubStory_Window_C*           WBP_Title_SubStory_Window;                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Title_SubStory_C">();
	}
	static class UWBP_Title_SubStory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Title_SubStory_C>();
	}
};
static_assert(alignof(UWBP_Title_SubStory_C) == 0x000008, "Wrong alignment on UWBP_Title_SubStory_C");
static_assert(sizeof(UWBP_Title_SubStory_C) == 0x000380, "Wrong size on UWBP_Title_SubStory_C");
static_assert(offsetof(UWBP_Title_SubStory_C, ChapterSelect_Caption) == 0x000358, "Member 'UWBP_Title_SubStory_C::ChapterSelect_Caption' has a wrong offset!");
static_assert(offsetof(UWBP_Title_SubStory_C, SubStory_Image) == 0x000360, "Member 'UWBP_Title_SubStory_C::SubStory_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Title_SubStory_C, SubStory_List) == 0x000368, "Member 'UWBP_Title_SubStory_C::SubStory_List' has a wrong offset!");
static_assert(offsetof(UWBP_Title_SubStory_C, Title_Help) == 0x000370, "Member 'UWBP_Title_SubStory_C::Title_Help' has a wrong offset!");
static_assert(offsetof(UWBP_Title_SubStory_C, WBP_Title_SubStory_Window) == 0x000378, "Member 'UWBP_Title_SubStory_C::WBP_Title_SubStory_Window' has a wrong offset!");

}

