#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chos_Finish

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chos_Finish.WBP_Chos_Finish_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_Chos_Finish_C final : public URCReUiChousaTelop
{
public:
	class UImage*                                 Bg_Black;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_Chos_FinishPL_Mist;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_Chos_FinishPL_Moyaflame;                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_Chos_FinishPL_Moyaflame2;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_Chos_FinishPL_Noize;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Chos_Finish_C">();
	}
	static class UWBP_Chos_Finish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chos_Finish_C>();
	}
};
static_assert(alignof(UWBP_Chos_Finish_C) == 0x000008, "Wrong alignment on UWBP_Chos_Finish_C");
static_assert(sizeof(UWBP_Chos_Finish_C) == 0x000318, "Wrong size on UWBP_Chos_Finish_C");
static_assert(offsetof(UWBP_Chos_Finish_C, Bg_Black) == 0x0002F0, "Member 'UWBP_Chos_Finish_C::Bg_Black' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Finish_C, MI_UI_Chos_FinishPL_Mist) == 0x0002F8, "Member 'UWBP_Chos_Finish_C::MI_UI_Chos_FinishPL_Mist' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Finish_C, MI_UI_Chos_FinishPL_Moyaflame) == 0x000300, "Member 'UWBP_Chos_Finish_C::MI_UI_Chos_FinishPL_Moyaflame' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Finish_C, MI_UI_Chos_FinishPL_Moyaflame2) == 0x000308, "Member 'UWBP_Chos_Finish_C::MI_UI_Chos_FinishPL_Moyaflame2' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Finish_C, MI_UI_Chos_FinishPL_Noize) == 0x000310, "Member 'UWBP_Chos_Finish_C::MI_UI_Chos_FinishPL_Noize' has a wrong offset!");

}

