#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_NzSkill_Icon_Set

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_NzSkill_Icon_Set.WBP_Menu_NzSkill_Icon_Set_C
// 0x0168 (0x04C8 - 0x0360)
class UWBP_Menu_NzSkill_Icon_Set_C final : public URCUiMenuSkillTreeIcon
{
public:
	class UImage*                                 Icon_AssistTime_Lv1;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_AssistTime_Lv1_Not;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_AssistTime_Lv2;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_AssistTime_Lv2_Not;                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Condition;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_EF_Open_C*       Icon_EF_Open;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_EF_Release_C*    Icon_EF_Release;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Equip_C*         Icon_Equip;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_EF_Select_C*     Icon_FL_Select;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv1;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv1_Not;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv2;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv2_Not;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv3;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv3_Not;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv4;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv4_Not;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv5;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_HPUp_Lv5_Not;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_kagi_Lv1;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_kagi_Lv1_Not;                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_kagi_Lv2;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_kagi_Lv2_Not;                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Puzzle_Lv1;                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Puzzle_Lv1_Not;                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Puzzle_Lv2;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Puzzle_Lv2_Not;                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Suiri_Lv1;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Suiri_Lv1_Not;                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Suiri_Lv2;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_KagiDown_Suiri_Lv2_Not;                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_Icon_Key_C*           Icon_Key;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_MissWord_Lv1;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_MissWord_Lv1_Not;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_MissWord_Lv2;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_MissWord_Lv2_Not;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_MoveSpeed_Lv1;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_MoveSpeed_Lv1_Not;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_RotationSpeed;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_RotationSpeed_Not;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_TextColour_Lv1;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_TextColour_Lv1_Not;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_TextSpeed_Lv1;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_TextSpeed_Lv1_Not;                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Icon_Main;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_NzSkill_Icon_Set_C">();
	}
	static class UWBP_Menu_NzSkill_Icon_Set_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_NzSkill_Icon_Set_C>();
	}
};
static_assert(alignof(UWBP_Menu_NzSkill_Icon_Set_C) == 0x000008, "Wrong alignment on UWBP_Menu_NzSkill_Icon_Set_C");
static_assert(sizeof(UWBP_Menu_NzSkill_Icon_Set_C) == 0x0004C8, "Wrong size on UWBP_Menu_NzSkill_Icon_Set_C");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_AssistTime_Lv1) == 0x000360, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_AssistTime_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_AssistTime_Lv1_Not) == 0x000368, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_AssistTime_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_AssistTime_Lv2) == 0x000370, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_AssistTime_Lv2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_AssistTime_Lv2_Not) == 0x000378, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_AssistTime_Lv2_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_Condition) == 0x000380, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_Condition' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_EF_Open) == 0x000388, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_EF_Open' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_EF_Release) == 0x000390, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_EF_Release' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_Equip) == 0x000398, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_Equip' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_FL_Select) == 0x0003A0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_FL_Select' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv1) == 0x0003A8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv1_Not) == 0x0003B0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv2) == 0x0003B8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv2_Not) == 0x0003C0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv2_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv3) == 0x0003C8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv3_Not) == 0x0003D0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv3_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv4) == 0x0003D8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv4_Not) == 0x0003E0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv4_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv5) == 0x0003E8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_HPUp_Lv5_Not) == 0x0003F0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_HPUp_Lv5_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_kagi_Lv1) == 0x0003F8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_kagi_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_kagi_Lv1_Not) == 0x000400, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_kagi_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_kagi_Lv2) == 0x000408, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_kagi_Lv2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_kagi_Lv2_Not) == 0x000410, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_kagi_Lv2_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Puzzle_Lv1) == 0x000418, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Puzzle_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Puzzle_Lv1_Not) == 0x000420, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Puzzle_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Puzzle_Lv2) == 0x000428, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Puzzle_Lv2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Puzzle_Lv2_Not) == 0x000430, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Puzzle_Lv2_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Suiri_Lv1) == 0x000438, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Suiri_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Suiri_Lv1_Not) == 0x000440, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Suiri_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Suiri_Lv2) == 0x000448, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Suiri_Lv2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_KagiDown_Suiri_Lv2_Not) == 0x000450, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_KagiDown_Suiri_Lv2_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_Key) == 0x000458, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_Key' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_MissWord_Lv1) == 0x000460, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_MissWord_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_MissWord_Lv1_Not) == 0x000468, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_MissWord_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_MissWord_Lv2) == 0x000470, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_MissWord_Lv2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_MissWord_Lv2_Not) == 0x000478, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_MissWord_Lv2_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_MoveSpeed_Lv1) == 0x000480, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_MoveSpeed_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_MoveSpeed_Lv1_Not) == 0x000488, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_MoveSpeed_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_RotationSpeed) == 0x000490, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_RotationSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_RotationSpeed_Not) == 0x000498, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_RotationSpeed_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_TextColour_Lv1) == 0x0004A0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_TextColour_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_TextColour_Lv1_Not) == 0x0004A8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_TextColour_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_TextSpeed_Lv1) == 0x0004B0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_TextSpeed_Lv1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Icon_TextSpeed_Lv1_Not) == 0x0004B8, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Icon_TextSpeed_Lv1_Not' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_Icon_Set_C, Switcher_Icon_Main) == 0x0004C0, "Member 'UWBP_Menu_NzSkill_Icon_Set_C::Switcher_Icon_Main' has a wrong offset!");

}

