#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Collect_ListBar_Close

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Collect_ListBar_Close.WBP_Menu_Collect_ListBar_Close_C
// 0x0020 (0x02D0 - 0x02B0)
class UWBP_Menu_Collect_ListBar_Close_C final : public URCMenuCollectionListBarClose
{
public:
	class UImage*                                 Collect_ListBar_Cursor;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ListBar_Push;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ListBar_Close_Base;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Collect_ListBar_Close_C">();
	}
	static class UWBP_Menu_Collect_ListBar_Close_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Collect_ListBar_Close_C>();
	}
};
static_assert(alignof(UWBP_Menu_Collect_ListBar_Close_C) == 0x000008, "Wrong alignment on UWBP_Menu_Collect_ListBar_Close_C");
static_assert(sizeof(UWBP_Menu_Collect_ListBar_Close_C) == 0x0002D0, "Wrong size on UWBP_Menu_Collect_ListBar_Close_C");
static_assert(offsetof(UWBP_Menu_Collect_ListBar_Close_C, Collect_ListBar_Cursor) == 0x0002B0, "Member 'UWBP_Menu_Collect_ListBar_Close_C::Collect_ListBar_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Collect_ListBar_Close_C, Image_0) == 0x0002B8, "Member 'UWBP_Menu_Collect_ListBar_Close_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Collect_ListBar_Close_C, Img_ListBar_Push) == 0x0002C0, "Member 'UWBP_Menu_Collect_ListBar_Close_C::Img_ListBar_Push' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Collect_ListBar_Close_C, ListBar_Close_Base) == 0x0002C8, "Member 'UWBP_Menu_Collect_ListBar_Close_C::ListBar_Close_Base' has a wrong offset!");

}

