#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_NzSkill_SystemWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_NzSkill_SystemWindow.WBP_Menu_NzSkill_SystemWindow_C
// 0x0078 (0x04A0 - 0x0428)
class UWBP_Menu_NzSkill_SystemWindow_C final : public URCUiMenuSkillWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg_Black;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_CostInformation;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_SkilIcon;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_WindowTitle;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CostInformation_Get;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CostInformation_Set;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_TitleName_Get;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_TitleName_Remove;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_TitleName_Set;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AdjustWindow_Button_000_C*         WBP_AdjustWindow_Button_000;                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FName>                           SkillTextIDs;                                      // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTextBlock*>                     TextBlockArray;                                    // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Set_Text_ID(TArray<class FName>& TextID, TArray<class UTextBlock*>& TextBlock);
	void Construct();
	void ExecuteUbergraph_WBP_Menu_NzSkill_SystemWindow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_NzSkill_SystemWindow_C">();
	}
	static class UWBP_Menu_NzSkill_SystemWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_NzSkill_SystemWindow_C>();
	}
};
static_assert(alignof(UWBP_Menu_NzSkill_SystemWindow_C) == 0x000008, "Wrong alignment on UWBP_Menu_NzSkill_SystemWindow_C");
static_assert(sizeof(UWBP_Menu_NzSkill_SystemWindow_C) == 0x0004A0, "Wrong size on UWBP_Menu_NzSkill_SystemWindow_C");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, UberGraphFrame) == 0x000428, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Bg_Black) == 0x000430, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Bg_Black' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Switcher_CostInformation) == 0x000438, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Switcher_CostInformation' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Switcher_SkilIcon) == 0x000440, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Switcher_SkilIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Switcher_WindowTitle) == 0x000448, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Switcher_WindowTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Txt_CostInformation_Get) == 0x000450, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Txt_CostInformation_Get' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Txt_CostInformation_Set) == 0x000458, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Txt_CostInformation_Set' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Txt_TitleName_Get) == 0x000460, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Txt_TitleName_Get' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Txt_TitleName_Remove) == 0x000468, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Txt_TitleName_Remove' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, Txt_TitleName_Set) == 0x000470, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::Txt_TitleName_Set' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, WBP_AdjustWindow_Button_000) == 0x000478, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::WBP_AdjustWindow_Button_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, SkillTextIDs) == 0x000480, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::SkillTextIDs' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NzSkill_SystemWindow_C, TextBlockArray) == 0x000490, "Member 'UWBP_Menu_NzSkill_SystemWindow_C::TextBlockArray' has a wrong offset!");

}

