#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chos_Target

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chos_Target.WBP_Chos_Target_C
// 0x0018 (0x0338 - 0x0320)
class UWBP_Chos_Target_C final : public URCReUiChousaTarget
{
public:
	class UWBP_Chos_TargetIcon_Check_C*           TargetIcon_Check;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_TargetIcon_Def_C*             TargetIcon_Def;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Chos_TargetIcon_Def_On_C*          WBP_Chos_TargetIcon_Def_On;                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Chos_Target_C">();
	}
	static class UWBP_Chos_Target_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chos_Target_C>();
	}
};
static_assert(alignof(UWBP_Chos_Target_C) == 0x000008, "Wrong alignment on UWBP_Chos_Target_C");
static_assert(sizeof(UWBP_Chos_Target_C) == 0x000338, "Wrong size on UWBP_Chos_Target_C");
static_assert(offsetof(UWBP_Chos_Target_C, TargetIcon_Check) == 0x000320, "Member 'UWBP_Chos_Target_C::TargetIcon_Check' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Target_C, TargetIcon_Def) == 0x000328, "Member 'UWBP_Chos_Target_C::TargetIcon_Def' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_Target_C, WBP_Chos_TargetIcon_Def_On) == 0x000330, "Member 'UWBP_Chos_Target_C::WBP_Chos_TargetIcon_Def_On' has a wrong offset!");

}

