#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Skill

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Skill.WBP_Menu_Skill_C
// 0x0018 (0x0330 - 0x0318)
class UWBP_Menu_Skill_C final : public URCUiMenuSkill
{
public:
	class UWBP_Menu_Com_Tab_C*                    Menu_Com_Tab;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NzSkill_C*                    Menu_NzSkill;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Status_C*                     Menu_Status;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Skill_C">();
	}
	static class UWBP_Menu_Skill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Skill_C>();
	}
};
static_assert(alignof(UWBP_Menu_Skill_C) == 0x000008, "Wrong alignment on UWBP_Menu_Skill_C");
static_assert(sizeof(UWBP_Menu_Skill_C) == 0x000330, "Wrong size on UWBP_Menu_Skill_C");
static_assert(offsetof(UWBP_Menu_Skill_C, Menu_Com_Tab) == 0x000318, "Member 'UWBP_Menu_Skill_C::Menu_Com_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Skill_C, Menu_NzSkill) == 0x000320, "Member 'UWBP_Menu_Skill_C::Menu_NzSkill' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Skill_C, Menu_Status) == 0x000328, "Member 'UWBP_Menu_Skill_C::Menu_Status' has a wrong offset!");

}

