#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Quest_ListBar_Close

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Quest_ListBar_Close.WBP_Menu_Quest_ListBar_Close_C
// 0x0040 (0x0398 - 0x0358)
class UWBP_Menu_Quest_ListBar_Close_C final : public URCUiMenuQuestListBar
{
public:
	class UWBP_Menu_Com_Icon_ListNew_C*           Icon_ListNew;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_ListUpdate_C*        Icon_ListUpdate;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Quest_ListBar_Close_Base_C*   ListBar_Base;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Quest_ListBar_Ef_C*           ListBar_Ef;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Quest_ListBar_Close_On_C*     ListBar_On;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Quest_ListIcon_NzClear_C*     ListIcon_NzClear;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Quest_ListIcon_Close_C*       ListIcon_Status;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Quest_ListBar_Cursor;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Quest_ListBar_Close_C">();
	}
	static class UWBP_Menu_Quest_ListBar_Close_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Quest_ListBar_Close_C>();
	}
};
static_assert(alignof(UWBP_Menu_Quest_ListBar_Close_C) == 0x000008, "Wrong alignment on UWBP_Menu_Quest_ListBar_Close_C");
static_assert(sizeof(UWBP_Menu_Quest_ListBar_Close_C) == 0x000398, "Wrong size on UWBP_Menu_Quest_ListBar_Close_C");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, Icon_ListNew) == 0x000358, "Member 'UWBP_Menu_Quest_ListBar_Close_C::Icon_ListNew' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, Icon_ListUpdate) == 0x000360, "Member 'UWBP_Menu_Quest_ListBar_Close_C::Icon_ListUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, ListBar_Base) == 0x000368, "Member 'UWBP_Menu_Quest_ListBar_Close_C::ListBar_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, ListBar_Ef) == 0x000370, "Member 'UWBP_Menu_Quest_ListBar_Close_C::ListBar_Ef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, ListBar_On) == 0x000378, "Member 'UWBP_Menu_Quest_ListBar_Close_C::ListBar_On' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, ListIcon_NzClear) == 0x000380, "Member 'UWBP_Menu_Quest_ListBar_Close_C::ListIcon_NzClear' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, ListIcon_Status) == 0x000388, "Member 'UWBP_Menu_Quest_ListBar_Close_C::ListIcon_Status' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_ListBar_Close_C, Quest_ListBar_Cursor) == 0x000390, "Member 'UWBP_Menu_Quest_ListBar_Close_C::Quest_ListBar_Cursor' has a wrong offset!");

}

