#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tutorial_List

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Tutorial_List.WBP_Menu_Tutorial_List_C
// 0x0048 (0x03D8 - 0x0390)
class UWBP_Menu_Tutorial_List_C final : public URCUiMenuTutorialList
{
public:
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_00;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_01;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_02;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_03;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_04;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_05;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_06;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_07;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Tutorial_ListBar_C*           Tutorial_ListBar_08;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Tutorial_List_C">();
	}
	static class UWBP_Menu_Tutorial_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Tutorial_List_C>();
	}
};
static_assert(alignof(UWBP_Menu_Tutorial_List_C) == 0x000008, "Wrong alignment on UWBP_Menu_Tutorial_List_C");
static_assert(sizeof(UWBP_Menu_Tutorial_List_C) == 0x0003D8, "Wrong size on UWBP_Menu_Tutorial_List_C");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_00) == 0x000390, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_01) == 0x000398, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_02) == 0x0003A0, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_03) == 0x0003A8, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_04) == 0x0003B0, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_05) == 0x0003B8, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_06) == 0x0003C0, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_07) == 0x0003C8, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tutorial_List_C, Tutorial_ListBar_08) == 0x0003D0, "Member 'UWBP_Menu_Tutorial_List_C::Tutorial_ListBar_08' has a wrong offset!");

}

