#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_DRank

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_DRank.WBP_Menu_DRank_C
// 0x0020 (0x0358 - 0x0338)
class UWBP_Menu_DRank_C final : public URCUiMenuDetectiveRank
{
public:
	class UImage*                                 DRank_DR;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DRank_Num_Dummy00;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DRank_Num_Dummy01;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pl_Num;                                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_DRank_C">();
	}
	static class UWBP_Menu_DRank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_DRank_C>();
	}
};
static_assert(alignof(UWBP_Menu_DRank_C) == 0x000008, "Wrong alignment on UWBP_Menu_DRank_C");
static_assert(sizeof(UWBP_Menu_DRank_C) == 0x000358, "Wrong size on UWBP_Menu_DRank_C");
static_assert(offsetof(UWBP_Menu_DRank_C, DRank_DR) == 0x000338, "Member 'UWBP_Menu_DRank_C::DRank_DR' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_DRank_C, DRank_Num_Dummy00) == 0x000340, "Member 'UWBP_Menu_DRank_C::DRank_Num_Dummy00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_DRank_C, DRank_Num_Dummy01) == 0x000348, "Member 'UWBP_Menu_DRank_C::DRank_Num_Dummy01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_DRank_C, Pl_Num) == 0x000350, "Member 'UWBP_Menu_DRank_C::Pl_Num' has a wrong offset!");

}

