#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Kagi_List

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Kagi_List.WBP_Menu_Kagi_List_C
// 0x00B0 (0x0448 - 0x0398)
class UWBP_Menu_Kagi_List_C final : public URCUiMenuKagiList
{
public:
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_10;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_11;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_12;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_13;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_14;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_15;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_16;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_17;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_18;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_19;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_20;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_21;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_00;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_01;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_02;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_03;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_04;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_05;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_06;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_07;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_08;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Kagi_ListBar_C*               Kagi_ListBar_09;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Kagi_List_C">();
	}
	static class UWBP_Menu_Kagi_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Kagi_List_C>();
	}
};
static_assert(alignof(UWBP_Menu_Kagi_List_C) == 0x000008, "Wrong alignment on UWBP_Menu_Kagi_List_C");
static_assert(sizeof(UWBP_Menu_Kagi_List_C) == 0x000448, "Wrong size on UWBP_Menu_Kagi_List_C");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_10) == 0x000398, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_11) == 0x0003A0, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_12) == 0x0003A8, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_12' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_13) == 0x0003B0, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_13' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_14) == 0x0003B8, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_14' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_15) == 0x0003C0, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_16) == 0x0003C8, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_16' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_17) == 0x0003D0, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_17' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_18) == 0x0003D8, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_19) == 0x0003E0, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_20) == 0x0003E8, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_20' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_21) == 0x0003F0, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_21' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_00) == 0x0003F8, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_01) == 0x000400, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_02) == 0x000408, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_03) == 0x000410, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_04) == 0x000418, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_05) == 0x000420, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_06) == 0x000428, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_07) == 0x000430, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_08) == 0x000438, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Kagi_List_C, Kagi_ListBar_09) == 0x000440, "Member 'UWBP_Menu_Kagi_List_C::Kagi_ListBar_09' has a wrong offset!");

}

