#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Int_Talk

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Int_Talk.WBP_Int_Talk_C.ExecuteUbergraph_WBP_Int_Talk
// 0x0028 (0x0028 - 0x0000)
struct WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk) == 0x000008, "Wrong alignment on WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk");
static_assert(sizeof(WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk) == 0x000028, "Wrong size on WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk");
static_assert(offsetof(WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk, EntryPoint) == 0x000000, "Member 'WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'WBP_Int_Talk_C_ExecuteUbergraph_WBP_Int_Talk::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

}

