#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReSubQuest_Start

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReSubQuest_Start.WBP_ReSubQuest_Start_C
// 0x0038 (0x0348 - 0x0310)
class UWBP_ReSubQuest_Start_C final : public URCReSubQuest
{
public:
	class UImage*                                 Img_Base_Main;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Base_Sub;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Deco_1;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Deco_2;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Deco_3;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Deco_4;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Emblem;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReSubQuest_Start_C">();
	}
	static class UWBP_ReSubQuest_Start_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReSubQuest_Start_C>();
	}
};
static_assert(alignof(UWBP_ReSubQuest_Start_C) == 0x000008, "Wrong alignment on UWBP_ReSubQuest_Start_C");
static_assert(sizeof(UWBP_ReSubQuest_Start_C) == 0x000348, "Wrong size on UWBP_ReSubQuest_Start_C");
static_assert(offsetof(UWBP_ReSubQuest_Start_C, Img_Base_Main) == 0x000310, "Member 'UWBP_ReSubQuest_Start_C::Img_Base_Main' has a wrong offset!");
static_assert(offsetof(UWBP_ReSubQuest_Start_C, Img_Base_Sub) == 0x000318, "Member 'UWBP_ReSubQuest_Start_C::Img_Base_Sub' has a wrong offset!");
static_assert(offsetof(UWBP_ReSubQuest_Start_C, Img_Deco_1) == 0x000320, "Member 'UWBP_ReSubQuest_Start_C::Img_Deco_1' has a wrong offset!");
static_assert(offsetof(UWBP_ReSubQuest_Start_C, Img_Deco_2) == 0x000328, "Member 'UWBP_ReSubQuest_Start_C::Img_Deco_2' has a wrong offset!");
static_assert(offsetof(UWBP_ReSubQuest_Start_C, Img_Deco_3) == 0x000330, "Member 'UWBP_ReSubQuest_Start_C::Img_Deco_3' has a wrong offset!");
static_assert(offsetof(UWBP_ReSubQuest_Start_C, Img_Deco_4) == 0x000338, "Member 'UWBP_ReSubQuest_Start_C::Img_Deco_4' has a wrong offset!");
static_assert(offsetof(UWBP_ReSubQuest_Start_C, Img_Emblem) == 0x000340, "Member 'UWBP_ReSubQuest_Start_C::Img_Emblem' has a wrong offset!");

}

