#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReBalloon_Cloud_s

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReBalloon_Cloud_s.WBP_ReBalloon_Cloud_s_C
// 0x0018 (0x0310 - 0x02F8)
class UWBP_ReBalloon_Cloud_s_C final : public URCReUiBalloonIcon
{
public:
	class UImage*                                 T_Cloud_s_dot_000;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_Cloud_s_dot_001;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_Cloud_s_dot_002;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReBalloon_Cloud_s_C">();
	}
	static class UWBP_ReBalloon_Cloud_s_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReBalloon_Cloud_s_C>();
	}
};
static_assert(alignof(UWBP_ReBalloon_Cloud_s_C) == 0x000008, "Wrong alignment on UWBP_ReBalloon_Cloud_s_C");
static_assert(sizeof(UWBP_ReBalloon_Cloud_s_C) == 0x000310, "Wrong size on UWBP_ReBalloon_Cloud_s_C");
static_assert(offsetof(UWBP_ReBalloon_Cloud_s_C, T_Cloud_s_dot_000) == 0x0002F8, "Member 'UWBP_ReBalloon_Cloud_s_C::T_Cloud_s_dot_000' has a wrong offset!");
static_assert(offsetof(UWBP_ReBalloon_Cloud_s_C, T_Cloud_s_dot_001) == 0x000300, "Member 'UWBP_ReBalloon_Cloud_s_C::T_Cloud_s_dot_001' has a wrong offset!");
static_assert(offsetof(UWBP_ReBalloon_Cloud_s_C, T_Cloud_s_dot_002) == 0x000308, "Member 'UWBP_ReBalloon_Cloud_s_C::T_Cloud_s_dot_002' has a wrong offset!");

}

