#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Quest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Quest.WBP_Menu_Quest_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_Menu_Quest_C final : public URCUiMenuMainQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Menu_Quest_Detail_Layout_C*        Quest_Detail_Layout;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Quest_List_C*                 Quest_List;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Quest(int32 EntryPoint);
	void RegistTutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Quest_C">();
	}
	static class UWBP_Menu_Quest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Quest_C>();
	}
};
static_assert(alignof(UWBP_Menu_Quest_C) == 0x000008, "Wrong alignment on UWBP_Menu_Quest_C");
static_assert(sizeof(UWBP_Menu_Quest_C) == 0x000320, "Wrong size on UWBP_Menu_Quest_C");
static_assert(offsetof(UWBP_Menu_Quest_C, UberGraphFrame) == 0x000308, "Member 'UWBP_Menu_Quest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_C, Quest_Detail_Layout) == 0x000310, "Member 'UWBP_Menu_Quest_C::Quest_Detail_Layout' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Quest_C, Quest_List) == 0x000318, "Member 'UWBP_Menu_Quest_C::Quest_List' has a wrong offset!");

}

