#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_KagiSelect_ListBar

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_KagiSelect_ListBar.WBP_Menu_KagiSelect_ListBar_C
// 0x0030 (0x03C8 - 0x0398)
class UWBP_Menu_KagiSelect_ListBar_C final : public URCUiMenuKagiListBar
{
public:
	class UWidgetAnimation*                       AN_Push;                                           // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_ListNew_C*           Icon_ListNew;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_ListUpdate_C*        Icon_ListUpdate;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ListBar_Push;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Kagi_ListBar_Base;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Kagi_ListBar_Cursor;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_KagiSelect_ListBar_C">();
	}
	static class UWBP_Menu_KagiSelect_ListBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_KagiSelect_ListBar_C>();
	}
};
static_assert(alignof(UWBP_Menu_KagiSelect_ListBar_C) == 0x000008, "Wrong alignment on UWBP_Menu_KagiSelect_ListBar_C");
static_assert(sizeof(UWBP_Menu_KagiSelect_ListBar_C) == 0x0003C8, "Wrong size on UWBP_Menu_KagiSelect_ListBar_C");
static_assert(offsetof(UWBP_Menu_KagiSelect_ListBar_C, AN_Push) == 0x000398, "Member 'UWBP_Menu_KagiSelect_ListBar_C::AN_Push' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_ListBar_C, Icon_ListNew) == 0x0003A0, "Member 'UWBP_Menu_KagiSelect_ListBar_C::Icon_ListNew' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_ListBar_C, Icon_ListUpdate) == 0x0003A8, "Member 'UWBP_Menu_KagiSelect_ListBar_C::Icon_ListUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_ListBar_C, Img_ListBar_Push) == 0x0003B0, "Member 'UWBP_Menu_KagiSelect_ListBar_C::Img_ListBar_Push' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_ListBar_C, Kagi_ListBar_Base) == 0x0003B8, "Member 'UWBP_Menu_KagiSelect_ListBar_C::Kagi_ListBar_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_KagiSelect_ListBar_C, Kagi_ListBar_Cursor) == 0x0003C0, "Member 'UWBP_Menu_KagiSelect_ListBar_C::Kagi_ListBar_Cursor' has a wrong offset!");

}

