#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReGetFigure

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReGetFigure.WBP_ReGetFigure_C
// 0x0020 (0x0340 - 0x0320)
class UWBP_ReGetFigure_C final : public URCReUiFigureInformation
{
public:
	class UImage*                                 Img_Panel;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Panel_1;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 M_UI_GetFigure_BackLight;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_GetFigure_txt;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReGetFigure_C">();
	}
	static class UWBP_ReGetFigure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReGetFigure_C>();
	}
};
static_assert(alignof(UWBP_ReGetFigure_C) == 0x000008, "Wrong alignment on UWBP_ReGetFigure_C");
static_assert(sizeof(UWBP_ReGetFigure_C) == 0x000340, "Wrong size on UWBP_ReGetFigure_C");
static_assert(offsetof(UWBP_ReGetFigure_C, Img_Panel) == 0x000320, "Member 'UWBP_ReGetFigure_C::Img_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_ReGetFigure_C, Img_Panel_1) == 0x000328, "Member 'UWBP_ReGetFigure_C::Img_Panel_1' has a wrong offset!");
static_assert(offsetof(UWBP_ReGetFigure_C, M_UI_GetFigure_BackLight) == 0x000330, "Member 'UWBP_ReGetFigure_C::M_UI_GetFigure_BackLight' has a wrong offset!");
static_assert(offsetof(UWBP_ReGetFigure_C, T_UI_GetFigure_txt) == 0x000338, "Member 'UWBP_ReGetFigure_C::T_UI_GetFigure_txt' has a wrong offset!");

}

