#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Character_Layout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Character_Layout.WBP_Menu_Character_Layout_C
// 0x0018 (0x0330 - 0x0318)
class UWBP_Menu_Character_Layout_C final : public URCUiMenuCharacterTop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Menu_Character_Select_C*           Menu_Character_Select;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Character_Viewer_C*           Menu_Character_Viewer;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Character_Layout(int32 EntryPoint);
	void RegistTutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Character_Layout_C">();
	}
	static class UWBP_Menu_Character_Layout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Character_Layout_C>();
	}
};
static_assert(alignof(UWBP_Menu_Character_Layout_C) == 0x000008, "Wrong alignment on UWBP_Menu_Character_Layout_C");
static_assert(sizeof(UWBP_Menu_Character_Layout_C) == 0x000330, "Wrong size on UWBP_Menu_Character_Layout_C");
static_assert(offsetof(UWBP_Menu_Character_Layout_C, UberGraphFrame) == 0x000318, "Member 'UWBP_Menu_Character_Layout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Layout_C, Menu_Character_Select) == 0x000320, "Member 'UWBP_Menu_Character_Layout_C::Menu_Character_Select' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Character_Layout_C, Menu_Character_Viewer) == 0x000328, "Member 'UWBP_Menu_Character_Layout_C::Menu_Character_Viewer' has a wrong offset!");

}

