#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chos_FPS_CameraLimit

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chos_FPS_CameraLimit.WBP_Chos_FPS_CameraLimit_C
// 0x0040 (0x0378 - 0x0338)
class UWBP_Chos_FPS_CameraLimit_C final : public URCReUiChousaFPSCameraLimit
{
public:
	class UImage*                                 Img_Grad_Bottom;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Grad_Left;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Grad_Right;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Grad_Top;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Bottom;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Left;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Right;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Top;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Chos_FPS_CameraLimit_C">();
	}
	static class UWBP_Chos_FPS_CameraLimit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chos_FPS_CameraLimit_C>();
	}
};
static_assert(alignof(UWBP_Chos_FPS_CameraLimit_C) == 0x000008, "Wrong alignment on UWBP_Chos_FPS_CameraLimit_C");
static_assert(sizeof(UWBP_Chos_FPS_CameraLimit_C) == 0x000378, "Wrong size on UWBP_Chos_FPS_CameraLimit_C");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Grad_Bottom) == 0x000338, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Grad_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Grad_Left) == 0x000340, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Grad_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Grad_Right) == 0x000348, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Grad_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Grad_Top) == 0x000350, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Grad_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Icon_Bottom) == 0x000358, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Icon_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Icon_Left) == 0x000360, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Icon_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Icon_Right) == 0x000368, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Icon_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Chos_FPS_CameraLimit_C, Img_Icon_Top) == 0x000370, "Member 'UWBP_Chos_FPS_CameraLimit_C::Img_Icon_Top' has a wrong offset!");

}

