#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReTalkWindow

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReTalkWindow.WBP_ReTalkWindow_C
// 0x0058 (0x04C0 - 0x0468)
class UWBP_ReTalkWindow_C final : public URCReUiMessageWindow
{
public:
	class UWidgetAnimation*                       AN_Subtitles_Finish;                               // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Subtitles_wait;                                 // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Subtitles_Start;                                // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_EffectsArea;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReTalk_Cursor_C*                   ReTalk_Cursor;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReTalk_Face_C*                     ReTalk_Face;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReTalk_NamePL_C*                   ReTalk_NamePL;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Subtitle_01;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Subtitle_02;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Subtitle_Speaker;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TalkWindow_ol;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReTalkWindow_C">();
	}
	static class UWBP_ReTalkWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReTalkWindow_C>();
	}
};
static_assert(alignof(UWBP_ReTalkWindow_C) == 0x000008, "Wrong alignment on UWBP_ReTalkWindow_C");
static_assert(sizeof(UWBP_ReTalkWindow_C) == 0x0004C0, "Wrong size on UWBP_ReTalkWindow_C");
static_assert(offsetof(UWBP_ReTalkWindow_C, AN_Subtitles_Finish) == 0x000468, "Member 'UWBP_ReTalkWindow_C::AN_Subtitles_Finish' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, AN_Subtitles_wait) == 0x000470, "Member 'UWBP_ReTalkWindow_C::AN_Subtitles_wait' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, AN_Subtitles_Start) == 0x000478, "Member 'UWBP_ReTalkWindow_C::AN_Subtitles_Start' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, IMG_EffectsArea) == 0x000480, "Member 'UWBP_ReTalkWindow_C::IMG_EffectsArea' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, ReTalk_Cursor) == 0x000488, "Member 'UWBP_ReTalkWindow_C::ReTalk_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, ReTalk_Face) == 0x000490, "Member 'UWBP_ReTalkWindow_C::ReTalk_Face' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, ReTalk_NamePL) == 0x000498, "Member 'UWBP_ReTalkWindow_C::ReTalk_NamePL' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, Subtitle_01) == 0x0004A0, "Member 'UWBP_ReTalkWindow_C::Subtitle_01' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, Subtitle_02) == 0x0004A8, "Member 'UWBP_ReTalkWindow_C::Subtitle_02' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, Subtitle_Speaker) == 0x0004B0, "Member 'UWBP_ReTalkWindow_C::Subtitle_Speaker' has a wrong offset!");
static_assert(offsetof(UWBP_ReTalkWindow_C, TalkWindow_ol) == 0x0004B8, "Member 'UWBP_ReTalkWindow_C::TalkWindow_ol' has a wrong offset!");

}

