#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WMap_Icon_M07_Disappeared

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_WMap_Icon_M07_Disappeared.WBP_Menu_WMap_Icon_M07_Disappeared_C
// 0x0038 (0x0390 - 0x0358)
class UWBP_Menu_WMap_Icon_M07_Disappeared_C final : public URCUiMenuWorldMapArea
{
public:
	class UImage*                                 Icon_Area_Close;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_BusStop_C*          Icon_BusStop;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_Goal_C*             Icon_Goal;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_Goal_Sub_C*         Icon_Goal_Sub;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_New_C*               Icon_New;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_Player_C*           Icon_Player;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_Subquest_C*         Icon_Subquest;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_WMap_Icon_M07_Disappeared_C">();
	}
	static class UWBP_Menu_WMap_Icon_M07_Disappeared_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_WMap_Icon_M07_Disappeared_C>();
	}
};
static_assert(alignof(UWBP_Menu_WMap_Icon_M07_Disappeared_C) == 0x000008, "Wrong alignment on UWBP_Menu_WMap_Icon_M07_Disappeared_C");
static_assert(sizeof(UWBP_Menu_WMap_Icon_M07_Disappeared_C) == 0x000390, "Wrong size on UWBP_Menu_WMap_Icon_M07_Disappeared_C");
static_assert(offsetof(UWBP_Menu_WMap_Icon_M07_Disappeared_C, Icon_Area_Close) == 0x000358, "Member 'UWBP_Menu_WMap_Icon_M07_Disappeared_C::Icon_Area_Close' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_M07_Disappeared_C, Icon_BusStop) == 0x000360, "Member 'UWBP_Menu_WMap_Icon_M07_Disappeared_C::Icon_BusStop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_M07_Disappeared_C, Icon_Goal) == 0x000368, "Member 'UWBP_Menu_WMap_Icon_M07_Disappeared_C::Icon_Goal' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_M07_Disappeared_C, Icon_Goal_Sub) == 0x000370, "Member 'UWBP_Menu_WMap_Icon_M07_Disappeared_C::Icon_Goal_Sub' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_M07_Disappeared_C, Icon_New) == 0x000378, "Member 'UWBP_Menu_WMap_Icon_M07_Disappeared_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_M07_Disappeared_C, Icon_Player) == 0x000380, "Member 'UWBP_Menu_WMap_Icon_M07_Disappeared_C::Icon_Player' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WMap_Icon_M07_Disappeared_C, Icon_Subquest) == 0x000388, "Member 'UWBP_Menu_WMap_Icon_M07_Disappeared_C::Icon_Subquest' has a wrong offset!");

}

