#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReLocation.WBP_ReLocation_C
// 0x0148 (0x0458 - 0x0310)
class UWBP_ReLocation_C final : public URCReUiLocation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         Text_10;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_11;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_12;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_13;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_14;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_15;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_16;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_17;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_18;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_19;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_20;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_21;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_22;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_23;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_24;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_25;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_26;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_27;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_28;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_29;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_30;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_31;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_32;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_33;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_34;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_35;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_36;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_37;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_38;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_39;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_00;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_01;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_02;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_03;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_04;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_05;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_06;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_07;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_08;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_09;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReLocation(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReLocation_C">();
	}
	static class UWBP_ReLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReLocation_C>();
	}
};
static_assert(alignof(UWBP_ReLocation_C) == 0x000008, "Wrong alignment on UWBP_ReLocation_C");
static_assert(sizeof(UWBP_ReLocation_C) == 0x000458, "Wrong size on UWBP_ReLocation_C");
static_assert(offsetof(UWBP_ReLocation_C, UberGraphFrame) == 0x000310, "Member 'UWBP_ReLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_10) == 0x000318, "Member 'UWBP_ReLocation_C::Text_10' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_11) == 0x000320, "Member 'UWBP_ReLocation_C::Text_11' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_12) == 0x000328, "Member 'UWBP_ReLocation_C::Text_12' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_13) == 0x000330, "Member 'UWBP_ReLocation_C::Text_13' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_14) == 0x000338, "Member 'UWBP_ReLocation_C::Text_14' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_15) == 0x000340, "Member 'UWBP_ReLocation_C::Text_15' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_16) == 0x000348, "Member 'UWBP_ReLocation_C::Text_16' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_17) == 0x000350, "Member 'UWBP_ReLocation_C::Text_17' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_18) == 0x000358, "Member 'UWBP_ReLocation_C::Text_18' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_19) == 0x000360, "Member 'UWBP_ReLocation_C::Text_19' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_20) == 0x000368, "Member 'UWBP_ReLocation_C::Text_20' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_21) == 0x000370, "Member 'UWBP_ReLocation_C::Text_21' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_22) == 0x000378, "Member 'UWBP_ReLocation_C::Text_22' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_23) == 0x000380, "Member 'UWBP_ReLocation_C::Text_23' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_24) == 0x000388, "Member 'UWBP_ReLocation_C::Text_24' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_25) == 0x000390, "Member 'UWBP_ReLocation_C::Text_25' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_26) == 0x000398, "Member 'UWBP_ReLocation_C::Text_26' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_27) == 0x0003A0, "Member 'UWBP_ReLocation_C::Text_27' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_28) == 0x0003A8, "Member 'UWBP_ReLocation_C::Text_28' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_29) == 0x0003B0, "Member 'UWBP_ReLocation_C::Text_29' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_30) == 0x0003B8, "Member 'UWBP_ReLocation_C::Text_30' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_31) == 0x0003C0, "Member 'UWBP_ReLocation_C::Text_31' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_32) == 0x0003C8, "Member 'UWBP_ReLocation_C::Text_32' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_33) == 0x0003D0, "Member 'UWBP_ReLocation_C::Text_33' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_34) == 0x0003D8, "Member 'UWBP_ReLocation_C::Text_34' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_35) == 0x0003E0, "Member 'UWBP_ReLocation_C::Text_35' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_36) == 0x0003E8, "Member 'UWBP_ReLocation_C::Text_36' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_37) == 0x0003F0, "Member 'UWBP_ReLocation_C::Text_37' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_38) == 0x0003F8, "Member 'UWBP_ReLocation_C::Text_38' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_39) == 0x000400, "Member 'UWBP_ReLocation_C::Text_39' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_00) == 0x000408, "Member 'UWBP_ReLocation_C::Text_00' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_01) == 0x000410, "Member 'UWBP_ReLocation_C::Text_01' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_02) == 0x000418, "Member 'UWBP_ReLocation_C::Text_02' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_03) == 0x000420, "Member 'UWBP_ReLocation_C::Text_03' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_04) == 0x000428, "Member 'UWBP_ReLocation_C::Text_04' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_05) == 0x000430, "Member 'UWBP_ReLocation_C::Text_05' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_06) == 0x000438, "Member 'UWBP_ReLocation_C::Text_06' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_07) == 0x000440, "Member 'UWBP_ReLocation_C::Text_07' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_08) == 0x000448, "Member 'UWBP_ReLocation_C::Text_08' has a wrong offset!");
static_assert(offsetof(UWBP_ReLocation_C, Text_09) == 0x000450, "Member 'UWBP_ReLocation_C::Text_09' has a wrong offset!");

}

