#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cutin

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Cutin.WBP_Cutin_C
// 0x0018 (0x0330 - 0x0318)
class UWBP_Cutin_C final : public URCUiCutIn
{
public:
	class UImage*                                 Img_Cutin;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 M_UI_Cutin_Flame_01;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Effects;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Cutin_C">();
	}
	static class UWBP_Cutin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cutin_C>();
	}
};
static_assert(alignof(UWBP_Cutin_C) == 0x000008, "Wrong alignment on UWBP_Cutin_C");
static_assert(sizeof(UWBP_Cutin_C) == 0x000330, "Wrong size on UWBP_Cutin_C");
static_assert(offsetof(UWBP_Cutin_C, Img_Cutin) == 0x000318, "Member 'UWBP_Cutin_C::Img_Cutin' has a wrong offset!");
static_assert(offsetof(UWBP_Cutin_C, M_UI_Cutin_Flame_01) == 0x000320, "Member 'UWBP_Cutin_C::M_UI_Cutin_Flame_01' has a wrong offset!");
static_assert(offsetof(UWBP_Cutin_C, RetainerBox_Effects) == 0x000328, "Member 'UWBP_Cutin_C::RetainerBox_Effects' has a wrong offset!");

}

