#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdjustWindow_000

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AdjustWindow_000.WBP_AdjustWindow_000_C
// 0x0018 (0x03A0 - 0x0388)
class UWBP_AdjustWindow_000_C final : public URCUiGenericWindow
{
public:
	class UImage*                                 Bg_Black;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Base;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AdjustWindow_Button_000_C*         Select_Button;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AdjustWindow_000_C">();
	}
	static class UWBP_AdjustWindow_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AdjustWindow_000_C>();
	}
};
static_assert(alignof(UWBP_AdjustWindow_000_C) == 0x000008, "Wrong alignment on UWBP_AdjustWindow_000_C");
static_assert(sizeof(UWBP_AdjustWindow_000_C) == 0x0003A0, "Wrong size on UWBP_AdjustWindow_000_C");
static_assert(offsetof(UWBP_AdjustWindow_000_C, Bg_Black) == 0x000388, "Member 'UWBP_AdjustWindow_000_C::Bg_Black' has a wrong offset!");
static_assert(offsetof(UWBP_AdjustWindow_000_C, Img_Base) == 0x000390, "Member 'UWBP_AdjustWindow_000_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UWBP_AdjustWindow_000_C, Select_Button) == 0x000398, "Member 'UWBP_AdjustWindow_000_C::Select_Button' has a wrong offset!");

}

