#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BTNGuide_Layout_R_Line1

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BTNGuide_Layout_R_Line1.WBP_BTNGuide_Layout_R_Line1_C
// 0x0028 (0x0338 - 0x0310)
class UWBP_BTNGuide_Layout_R_Line1_C final : public URCUiButtonGuide
{
public:
	class UImage*                                 BTNGuidePL;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     WBP_ButtonGuide;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     WBP_ButtonGuide_1;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     WBP_ButtonGuide_2;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonGuide_C*                     WBP_ButtonGuide_3;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BTNGuide_Layout_R_Line1_C">();
	}
	static class UWBP_BTNGuide_Layout_R_Line1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BTNGuide_Layout_R_Line1_C>();
	}
};
static_assert(alignof(UWBP_BTNGuide_Layout_R_Line1_C) == 0x000008, "Wrong alignment on UWBP_BTNGuide_Layout_R_Line1_C");
static_assert(sizeof(UWBP_BTNGuide_Layout_R_Line1_C) == 0x000338, "Wrong size on UWBP_BTNGuide_Layout_R_Line1_C");
static_assert(offsetof(UWBP_BTNGuide_Layout_R_Line1_C, BTNGuidePL) == 0x000310, "Member 'UWBP_BTNGuide_Layout_R_Line1_C::BTNGuidePL' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_R_Line1_C, WBP_ButtonGuide) == 0x000318, "Member 'UWBP_BTNGuide_Layout_R_Line1_C::WBP_ButtonGuide' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_R_Line1_C, WBP_ButtonGuide_1) == 0x000320, "Member 'UWBP_BTNGuide_Layout_R_Line1_C::WBP_ButtonGuide_1' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_R_Line1_C, WBP_ButtonGuide_2) == 0x000328, "Member 'UWBP_BTNGuide_Layout_R_Line1_C::WBP_ButtonGuide_2' has a wrong offset!");
static_assert(offsetof(UWBP_BTNGuide_Layout_R_Line1_C, WBP_ButtonGuide_3) == 0x000330, "Member 'UWBP_BTNGuide_Layout_R_Line1_C::WBP_ButtonGuide_3' has a wrong offset!");

}

