#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_Re

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_WorldMap_Re.WBP_Menu_WorldMap_Re_C
// 0x0130 (0x0608 - 0x04D8)
class UWBP_Menu_WorldMap_Re_C final : public URCUiMenuWorldMap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Menu_WMap_Icon_M01_C*              Area_Icon_M01;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M02_C*              Area_Icon_M02;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M03_C*              Area_Icon_M03;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M03_Flood_C*        Area_Icon_M03_Flood;                               // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M04_C*              Area_Icon_M04;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M05_C*              Area_Icon_M05;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M06_C*              Area_Icon_M06;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M07_C*              Area_Icon_M07;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M07_Disappeared_C*  Area_Icon_M07_Disappeared;                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M08_C*              Area_Icon_M08;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M09_C*              Area_Icon_M09;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M10_C*              Area_Icon_M10;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M11_C*              Area_Icon_M11;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M12_C*              Area_Icon_M12;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M13_C*              Area_Icon_M13;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M14_C*              Area_Icon_M14;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Icon_M15_C*              Area_Icon_M15;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_BusStop_Guide_C*         BusStop_Guide;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Cloud_L1;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Cloud_L2;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Cloud_R1;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Cloud_R2;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Rain_1;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Rain_2;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M01_M02_C*         Joint_M01_M02;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M01_M03_C*         Joint_M01_M03;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M01_M07_C*         Joint_M01_M07;                                     // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M01_M08_C*         Joint_M01_M08;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M01_M13_C*         Joint_M01_M13;                                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M02_M09_C*         Joint_M02_M09;                                     // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M02_M10_C*         Joint_M02_M10;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M02_M11_C*         Joint_M02_M11;                                     // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M02_M12_C*         Joint_M02_M12;                                     // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M02_M14_C*         Joint_M02_M14;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M02_M15_C*         Joint_M02_M15;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Joint_M04_M07_C*         Joint_M04_M07;                                     // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WMap_Ground_C*                WMap_Ground;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RegistTutorial();
	void ExecuteUbergraph_WBP_Menu_WorldMap_Re(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_WorldMap_Re_C">();
	}
	static class UWBP_Menu_WorldMap_Re_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_WorldMap_Re_C>();
	}
};
static_assert(alignof(UWBP_Menu_WorldMap_Re_C) == 0x000008, "Wrong alignment on UWBP_Menu_WorldMap_Re_C");
static_assert(sizeof(UWBP_Menu_WorldMap_Re_C) == 0x000608, "Wrong size on UWBP_Menu_WorldMap_Re_C");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_Menu_WorldMap_Re_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M01) == 0x0004E0, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M02) == 0x0004E8, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M03) == 0x0004F0, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M03_Flood) == 0x0004F8, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M03_Flood' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M04) == 0x000500, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M05) == 0x000508, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M06) == 0x000510, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M07) == 0x000518, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M07_Disappeared) == 0x000520, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M07_Disappeared' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M08) == 0x000528, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M09) == 0x000530, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M09' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M10) == 0x000538, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M11) == 0x000540, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M12) == 0x000548, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M12' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M13) == 0x000550, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M13' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M14) == 0x000558, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M14' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Area_Icon_M15) == 0x000560, "Member 'UWBP_Menu_WorldMap_Re_C::Area_Icon_M15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, BusStop_Guide) == 0x000568, "Member 'UWBP_Menu_WorldMap_Re_C::BusStop_Guide' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Img_Cloud_L1) == 0x000570, "Member 'UWBP_Menu_WorldMap_Re_C::Img_Cloud_L1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Img_Cloud_L2) == 0x000578, "Member 'UWBP_Menu_WorldMap_Re_C::Img_Cloud_L2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Img_Cloud_R1) == 0x000580, "Member 'UWBP_Menu_WorldMap_Re_C::Img_Cloud_R1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Img_Cloud_R2) == 0x000588, "Member 'UWBP_Menu_WorldMap_Re_C::Img_Cloud_R2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Img_Rain_1) == 0x000590, "Member 'UWBP_Menu_WorldMap_Re_C::Img_Rain_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Img_Rain_2) == 0x000598, "Member 'UWBP_Menu_WorldMap_Re_C::Img_Rain_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M01_M02) == 0x0005A0, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M01_M02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M01_M03) == 0x0005A8, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M01_M03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M01_M07) == 0x0005B0, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M01_M07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M01_M08) == 0x0005B8, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M01_M08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M01_M13) == 0x0005C0, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M01_M13' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M02_M09) == 0x0005C8, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M02_M09' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M02_M10) == 0x0005D0, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M02_M10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M02_M11) == 0x0005D8, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M02_M11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M02_M12) == 0x0005E0, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M02_M12' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M02_M14) == 0x0005E8, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M02_M14' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M02_M15) == 0x0005F0, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M02_M15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, Joint_M04_M07) == 0x0005F8, "Member 'UWBP_Menu_WorldMap_Re_C::Joint_M04_M07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_Re_C, WMap_Ground) == 0x000600, "Member 'UWBP_Menu_WorldMap_Re_C::WMap_Ground' has a wrong offset!");

}

