#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Chara_Sele_Lay_002

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Chara_Sele_Lay_002.WBP_Menu_Chara_Sele_Lay_002_C.ButtonNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation) == 0x000008, "Wrong alignment on WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation");
static_assert(sizeof(WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation) == 0x000018, "Wrong size on WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation");
static_assert(offsetof(WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation, Navigation_0) == 0x000000, "Member 'WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation, ReturnValue) == 0x000008, "Member 'WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_Menu_Chara_Sele_Lay_002_C_ButtonNavigation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

}

