#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Chara_View_Model

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Chara_View_Model.WBP_Menu_Chara_View_Model_C
// 0x0050 (0x03E8 - 0x0398)
class UWBP_Menu_Chara_View_Model_C final : public URCUiMenuCharacterViewerModel
{
public:
	class UWBP_Menu_Chara_View_Model_000_C*       Chara_Model_000;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_View_Model_000_C*       Chara_Model_001;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_View_Model_000_C*       Chara_Model_002;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_View_Model_000_C*       Chara_Model_Dummy_000;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_View_Model_000_C*       Chara_Model_Dummy_001;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Chara_View_Model_000_C*       Chara_Model_Dummy_002;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_New_C*               Icon_New;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_New_C*               Icon_NewDummy;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_Update_C*            Icon_Update;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Com_Icon_Update_C*            Icon_Update_Dummy;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Chara_View_Model_C">();
	}
	static class UWBP_Menu_Chara_View_Model_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Chara_View_Model_C>();
	}
};
static_assert(alignof(UWBP_Menu_Chara_View_Model_C) == 0x000008, "Wrong alignment on UWBP_Menu_Chara_View_Model_C");
static_assert(sizeof(UWBP_Menu_Chara_View_Model_C) == 0x0003E8, "Wrong size on UWBP_Menu_Chara_View_Model_C");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Chara_Model_000) == 0x000398, "Member 'UWBP_Menu_Chara_View_Model_C::Chara_Model_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Chara_Model_001) == 0x0003A0, "Member 'UWBP_Menu_Chara_View_Model_C::Chara_Model_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Chara_Model_002) == 0x0003A8, "Member 'UWBP_Menu_Chara_View_Model_C::Chara_Model_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Chara_Model_Dummy_000) == 0x0003B0, "Member 'UWBP_Menu_Chara_View_Model_C::Chara_Model_Dummy_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Chara_Model_Dummy_001) == 0x0003B8, "Member 'UWBP_Menu_Chara_View_Model_C::Chara_Model_Dummy_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Chara_Model_Dummy_002) == 0x0003C0, "Member 'UWBP_Menu_Chara_View_Model_C::Chara_Model_Dummy_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Icon_New) == 0x0003C8, "Member 'UWBP_Menu_Chara_View_Model_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Icon_NewDummy) == 0x0003D0, "Member 'UWBP_Menu_Chara_View_Model_C::Icon_NewDummy' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Icon_Update) == 0x0003D8, "Member 'UWBP_Menu_Chara_View_Model_C::Icon_Update' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Chara_View_Model_C, Icon_Update_Dummy) == 0x0003E0, "Member 'UWBP_Menu_Chara_View_Model_C::Icon_Update_Dummy' has a wrong offset!");

}

