#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_ScoreDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_ScoreDetails.WBP_Result_ScoreDetails_C
// 0x0058 (0x0360 - 0x0308)
class UWBP_Result_ScoreDetails_C final : public URCNzResultScoreDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_BackPlate;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SpaceController;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Number;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Rank;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_ScoreDetails_Content_C*     WBP_Result_ScoreDetails_Content;                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextBlockArray;                                    // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FName>                           ResultTextIDs;                                     // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Result_ScoreDetails(int32 EntryPoint);
	void Construct();
	void SetTextID(TArray<class FName>& TextID, TArray<class UTextBlock*>& TextBlock);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_ScoreDetails_C">();
	}
	static class UWBP_Result_ScoreDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_ScoreDetails_C>();
	}
};
static_assert(alignof(UWBP_Result_ScoreDetails_C) == 0x000008, "Wrong alignment on UWBP_Result_ScoreDetails_C");
static_assert(sizeof(UWBP_Result_ScoreDetails_C) == 0x000360, "Wrong size on UWBP_Result_ScoreDetails_C");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, UberGraphFrame) == 0x000308, "Member 'UWBP_Result_ScoreDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, Img_BackPlate) == 0x000310, "Member 'UWBP_Result_ScoreDetails_C::Img_BackPlate' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, Img_SpaceController) == 0x000318, "Member 'UWBP_Result_ScoreDetails_C::Img_SpaceController' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, Text_Name) == 0x000320, "Member 'UWBP_Result_ScoreDetails_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, Text_Number) == 0x000328, "Member 'UWBP_Result_ScoreDetails_C::Text_Number' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, Text_Rank) == 0x000330, "Member 'UWBP_Result_ScoreDetails_C::Text_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, WBP_Result_ScoreDetails_Content) == 0x000338, "Member 'UWBP_Result_ScoreDetails_C::WBP_Result_ScoreDetails_Content' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, TextBlockArray) == 0x000340, "Member 'UWBP_Result_ScoreDetails_C::TextBlockArray' has a wrong offset!");
static_assert(offsetof(UWBP_Result_ScoreDetails_C, ResultTextIDs) == 0x000350, "Member 'UWBP_Result_ScoreDetails_C::ResultTextIDs' has a wrong offset!");

}

