#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Status

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Status.WBP_Menu_Status_C
// 0x0138 (0x0590 - 0x0458)
class UWBP_Menu_Status_C final : public URCUiMenuStatus
{
public:
	class UImage*                                 ActiveSkill_BG;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_Line;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_Line_1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_NotSetSkill;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Attack_000;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Attack_001;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Attack_002;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Attack_003;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Attack_004;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Speed_000;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Speed_001;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Speed_002;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Speed_003;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Check_C*                  Check_Speed_004;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Com_Icon_Slash_HP;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Com_Icon_Slash_Memory;                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Icon_Attack_C*            Icon_Attack;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Icon_HP_C*                Icon_HP;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Icon_Memory_C*            Icon_Memory;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_Icon_Speed_C*             Icon_Speed;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_000;                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_001;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_002;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_003;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_004;                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_005;                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_006;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_007;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_008;                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Sts_List_Bar_C*               Skill_List_Bar_009;                                // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_ActiveSkill;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_Attack;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_HP;                                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_Memory;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_Next;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_SkillPoint;                                   // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_Speed;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TRank_BG_1;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Status_C">();
	}
	static class UWBP_Menu_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Status_C>();
	}
};
static_assert(alignof(UWBP_Menu_Status_C) == 0x000008, "Wrong alignment on UWBP_Menu_Status_C");
static_assert(sizeof(UWBP_Menu_Status_C) == 0x000590, "Wrong size on UWBP_Menu_Status_C");
static_assert(offsetof(UWBP_Menu_Status_C, ActiveSkill_BG) == 0x000458, "Member 'UWBP_Menu_Status_C::ActiveSkill_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Bar_Line) == 0x000460, "Member 'UWBP_Menu_Status_C::Bar_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Bar_Line_1) == 0x000468, "Member 'UWBP_Menu_Status_C::Bar_Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Canvas_NotSetSkill) == 0x000470, "Member 'UWBP_Menu_Status_C::Canvas_NotSetSkill' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Attack_000) == 0x000478, "Member 'UWBP_Menu_Status_C::Check_Attack_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Attack_001) == 0x000480, "Member 'UWBP_Menu_Status_C::Check_Attack_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Attack_002) == 0x000488, "Member 'UWBP_Menu_Status_C::Check_Attack_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Attack_003) == 0x000490, "Member 'UWBP_Menu_Status_C::Check_Attack_003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Attack_004) == 0x000498, "Member 'UWBP_Menu_Status_C::Check_Attack_004' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Speed_000) == 0x0004A0, "Member 'UWBP_Menu_Status_C::Check_Speed_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Speed_001) == 0x0004A8, "Member 'UWBP_Menu_Status_C::Check_Speed_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Speed_002) == 0x0004B0, "Member 'UWBP_Menu_Status_C::Check_Speed_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Speed_003) == 0x0004B8, "Member 'UWBP_Menu_Status_C::Check_Speed_003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Check_Speed_004) == 0x0004C0, "Member 'UWBP_Menu_Status_C::Check_Speed_004' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Com_Icon_Slash_HP) == 0x0004C8, "Member 'UWBP_Menu_Status_C::Com_Icon_Slash_HP' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Com_Icon_Slash_Memory) == 0x0004D0, "Member 'UWBP_Menu_Status_C::Com_Icon_Slash_Memory' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Icon_Attack) == 0x0004D8, "Member 'UWBP_Menu_Status_C::Icon_Attack' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Icon_HP) == 0x0004E0, "Member 'UWBP_Menu_Status_C::Icon_HP' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Icon_Memory) == 0x0004E8, "Member 'UWBP_Menu_Status_C::Icon_Memory' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Icon_Speed) == 0x0004F0, "Member 'UWBP_Menu_Status_C::Icon_Speed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Image_18) == 0x0004F8, "Member 'UWBP_Menu_Status_C::Image_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_000) == 0x000500, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_001) == 0x000508, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_002) == 0x000510, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_003) == 0x000518, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_004) == 0x000520, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_004' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_005) == 0x000528, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_005' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_006) == 0x000530, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_007) == 0x000538, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_008) == 0x000540, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_008' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Skill_List_Bar_009) == 0x000548, "Member 'UWBP_Menu_Status_C::Skill_List_Bar_009' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Text_ActiveSkill) == 0x000550, "Member 'UWBP_Menu_Status_C::Text_ActiveSkill' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Text_Attack) == 0x000558, "Member 'UWBP_Menu_Status_C::Text_Attack' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Text_HP) == 0x000560, "Member 'UWBP_Menu_Status_C::Text_HP' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Text_Memory) == 0x000568, "Member 'UWBP_Menu_Status_C::Text_Memory' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Text_Next) == 0x000570, "Member 'UWBP_Menu_Status_C::Text_Next' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Text_SkillPoint) == 0x000578, "Member 'UWBP_Menu_Status_C::Text_SkillPoint' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, Text_Speed) == 0x000580, "Member 'UWBP_Menu_Status_C::Text_Speed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Status_C, TRank_BG_1) == 0x000588, "Member 'UWBP_Menu_Status_C::TRank_BG_1' has a wrong offset!");

}

