#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Gallery_Sound_ListBar

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Gallery_Sound_ListBar.WBP_Gallery_Sound_ListBar_C
// 0x0038 (0x03E0 - 0x03A8)
class UWBP_Gallery_Sound_ListBar_C final : public URCTitleGalleryBGMListBar
{
public:
	class UWBP_Menu_Com_Icon_ListNew_C*           Icon_ListNew;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_69;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ListBar_Push;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ListBar_Grp;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tutorial_ListBar_Cursor;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Gallery_Sound_ListBar_C">();
	}
	static class UWBP_Gallery_Sound_ListBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Gallery_Sound_ListBar_C>();
	}
};
static_assert(alignof(UWBP_Gallery_Sound_ListBar_C) == 0x000008, "Wrong alignment on UWBP_Gallery_Sound_ListBar_C");
static_assert(sizeof(UWBP_Gallery_Sound_ListBar_C) == 0x0003E0, "Wrong size on UWBP_Gallery_Sound_ListBar_C");
static_assert(offsetof(UWBP_Gallery_Sound_ListBar_C, Icon_ListNew) == 0x0003A8, "Member 'UWBP_Gallery_Sound_ListBar_C::Icon_ListNew' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_ListBar_C, Image_0) == 0x0003B0, "Member 'UWBP_Gallery_Sound_ListBar_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_ListBar_C, Image_1) == 0x0003B8, "Member 'UWBP_Gallery_Sound_ListBar_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_ListBar_C, Image_69) == 0x0003C0, "Member 'UWBP_Gallery_Sound_ListBar_C::Image_69' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_ListBar_C, Img_ListBar_Push) == 0x0003C8, "Member 'UWBP_Gallery_Sound_ListBar_C::Img_ListBar_Push' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_ListBar_C, ListBar_Grp) == 0x0003D0, "Member 'UWBP_Gallery_Sound_ListBar_C::ListBar_Grp' has a wrong offset!");
static_assert(offsetof(UWBP_Gallery_Sound_ListBar_C, Tutorial_ListBar_Cursor) == 0x0003D8, "Member 'UWBP_Gallery_Sound_ListBar_C::Tutorial_ListBar_Cursor' has a wrong offset!");

}

