#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_NextTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_NextTarget.WBP_Menu_NextTarget_C
// 0x0038 (0x0330 - 0x02F8)
class UWBP_Menu_NextTarget_C final : public URCUiMenuNextTarget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AN_Finish;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Wait;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AN_Start;                                          // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Headline_JA;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NextTarget_Base;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NextTarget_Grp;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnShowStarted();
	void OnShowFinished();
	void OnHideStarted();
	void ExecuteUbergraph_WBP_Menu_NextTarget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_NextTarget_C">();
	}
	static class UWBP_Menu_NextTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_NextTarget_C>();
	}
};
static_assert(alignof(UWBP_Menu_NextTarget_C) == 0x000008, "Wrong alignment on UWBP_Menu_NextTarget_C");
static_assert(sizeof(UWBP_Menu_NextTarget_C) == 0x000330, "Wrong size on UWBP_Menu_NextTarget_C");
static_assert(offsetof(UWBP_Menu_NextTarget_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_Menu_NextTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NextTarget_C, AN_Finish) == 0x000300, "Member 'UWBP_Menu_NextTarget_C::AN_Finish' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NextTarget_C, AN_Wait) == 0x000308, "Member 'UWBP_Menu_NextTarget_C::AN_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NextTarget_C, AN_Start) == 0x000310, "Member 'UWBP_Menu_NextTarget_C::AN_Start' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NextTarget_C, Image_Headline_JA) == 0x000318, "Member 'UWBP_Menu_NextTarget_C::Image_Headline_JA' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NextTarget_C, Image_NextTarget_Base) == 0x000320, "Member 'UWBP_Menu_NextTarget_C::Image_NextTarget_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_NextTarget_C, Overlay_NextTarget_Grp) == 0x000328, "Member 'UWBP_Menu_NextTarget_C::Overlay_NextTarget_Grp' has a wrong offset!");

}

