#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_AMap_Facility

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_AMap_Facility.WBP_Menu_AMap_Facility_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_Menu_AMap_Facility_C final : public URCUiMenuAreaMapIcon
{
public:
	class UImage*                                 Img_Icon_Facility;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Facility_Disable;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Nomark;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Facility;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_AMap_Facility_C">();
	}
	static class UWBP_Menu_AMap_Facility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_AMap_Facility_C>();
	}
};
static_assert(alignof(UWBP_Menu_AMap_Facility_C) == 0x000008, "Wrong alignment on UWBP_Menu_AMap_Facility_C");
static_assert(sizeof(UWBP_Menu_AMap_Facility_C) == 0x000300, "Wrong size on UWBP_Menu_AMap_Facility_C");
static_assert(offsetof(UWBP_Menu_AMap_Facility_C, Img_Icon_Facility) == 0x0002E0, "Member 'UWBP_Menu_AMap_Facility_C::Img_Icon_Facility' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_Facility_C, Img_Icon_Facility_Disable) == 0x0002E8, "Member 'UWBP_Menu_AMap_Facility_C::Img_Icon_Facility_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_Facility_C, Img_Icon_Nomark) == 0x0002F0, "Member 'UWBP_Menu_AMap_Facility_C::Img_Icon_Nomark' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_AMap_Facility_C, WidgetSwitcher_Facility) == 0x0002F8, "Member 'UWBP_Menu_AMap_Facility_C::WidgetSwitcher_Facility' has a wrong offset!");

}

