#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Layout

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Layout.WBP_Menu_Layout_C
// 0x0048 (0x03A8 - 0x0360)
class UWBP_Menu_Layout_C final : public URCTopMenu
{
public:
	class UWBP_Menu_BackGround_C*                 Menu_BackGround;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Contents_C*                   Menu_Contents;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_DPoint_C*                     Menu_DPoint;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_DRank_C*                      Menu_DRank;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_NextTarget_C*                 Menu_NextTarget;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_TitleName_C*                  Menu_TitleName;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_Lost_C*              Menu_WorldMap_Lost;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_Re_C*                Menu_WorldMap_Re;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_Train_C*             Menu_WorldMap_Train;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Layout_C">();
	}
	static class UWBP_Menu_Layout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Layout_C>();
	}
};
static_assert(alignof(UWBP_Menu_Layout_C) == 0x000008, "Wrong alignment on UWBP_Menu_Layout_C");
static_assert(sizeof(UWBP_Menu_Layout_C) == 0x0003A8, "Wrong size on UWBP_Menu_Layout_C");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_BackGround) == 0x000360, "Member 'UWBP_Menu_Layout_C::Menu_BackGround' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_Contents) == 0x000368, "Member 'UWBP_Menu_Layout_C::Menu_Contents' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_DPoint) == 0x000370, "Member 'UWBP_Menu_Layout_C::Menu_DPoint' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_DRank) == 0x000378, "Member 'UWBP_Menu_Layout_C::Menu_DRank' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_NextTarget) == 0x000380, "Member 'UWBP_Menu_Layout_C::Menu_NextTarget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_TitleName) == 0x000388, "Member 'UWBP_Menu_Layout_C::Menu_TitleName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_WorldMap_Lost) == 0x000390, "Member 'UWBP_Menu_Layout_C::Menu_WorldMap_Lost' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_WorldMap_Re) == 0x000398, "Member 'UWBP_Menu_Layout_C::Menu_WorldMap_Re' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Layout_C, Menu_WorldMap_Train) == 0x0003A0, "Member 'UWBP_Menu_Layout_C::Menu_WorldMap_Train' has a wrong offset!");

}

