#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReSelectEyeTracking

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ReSelectEyeTracking.WBP_ReSelectEyeTracking_C.ExecuteUbergraph_WBP_ReSelectEyeTracking
// 0x0004 (0x0004 - 0x0000)
struct WBP_ReSelectEyeTracking_C_ExecuteUbergraph_WBP_ReSelectEyeTracking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReSelectEyeTracking_C_ExecuteUbergraph_WBP_ReSelectEyeTracking) == 0x000004, "Wrong alignment on WBP_ReSelectEyeTracking_C_ExecuteUbergraph_WBP_ReSelectEyeTracking");
static_assert(sizeof(WBP_ReSelectEyeTracking_C_ExecuteUbergraph_WBP_ReSelectEyeTracking) == 0x000004, "Wrong size on WBP_ReSelectEyeTracking_C_ExecuteUbergraph_WBP_ReSelectEyeTracking");
static_assert(offsetof(WBP_ReSelectEyeTracking_C_ExecuteUbergraph_WBP_ReSelectEyeTracking, EntryPoint) == 0x000000, "Member 'WBP_ReSelectEyeTracking_C_ExecuteUbergraph_WBP_ReSelectEyeTracking::EntryPoint' has a wrong offset!");

// Function WBP_ReSelectEyeTracking.WBP_ReSelectEyeTracking_C.CustomNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_ReSelectEyeTracking_C_CustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReSelectEyeTracking_C_CustomNavigation) == 0x000008, "Wrong alignment on WBP_ReSelectEyeTracking_C_CustomNavigation");
static_assert(sizeof(WBP_ReSelectEyeTracking_C_CustomNavigation) == 0x000018, "Wrong size on WBP_ReSelectEyeTracking_C_CustomNavigation");
static_assert(offsetof(WBP_ReSelectEyeTracking_C_CustomNavigation, Navigation_0) == 0x000000, "Member 'WBP_ReSelectEyeTracking_C_CustomNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectEyeTracking_C_CustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_ReSelectEyeTracking_C_CustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReSelectEyeTracking_C_CustomNavigation, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_ReSelectEyeTracking_C_CustomNavigation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

}

