#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReBalloon_Far

#include "Basic.hpp"

#include "RC_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReBalloon_Far.WBP_ReBalloon_Far_C
// 0x0020 (0x0328 - 0x0308)
class UWBP_ReBalloon_Far_C final : public URCReUiBalloonFar
{
public:
	class UWBP_ReBalloon_Cloud_s_C*               WBP_ReBalloon_Cloud_s;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReBalloon_Heart_s_C*               WBP_ReBalloon_Heart_s;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReBalloon_s_Base_C*                WBP_ReBalloon_s_Base;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReBalloon_Spikey_s_C*              WBP_ReBalloon_Spikey_s;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ReBalloon_Far_C">();
	}
	static class UWBP_ReBalloon_Far_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReBalloon_Far_C>();
	}
};
static_assert(alignof(UWBP_ReBalloon_Far_C) == 0x000008, "Wrong alignment on UWBP_ReBalloon_Far_C");
static_assert(sizeof(UWBP_ReBalloon_Far_C) == 0x000328, "Wrong size on UWBP_ReBalloon_Far_C");
static_assert(offsetof(UWBP_ReBalloon_Far_C, WBP_ReBalloon_Cloud_s) == 0x000308, "Member 'UWBP_ReBalloon_Far_C::WBP_ReBalloon_Cloud_s' has a wrong offset!");
static_assert(offsetof(UWBP_ReBalloon_Far_C, WBP_ReBalloon_Heart_s) == 0x000310, "Member 'UWBP_ReBalloon_Far_C::WBP_ReBalloon_Heart_s' has a wrong offset!");
static_assert(offsetof(UWBP_ReBalloon_Far_C, WBP_ReBalloon_s_Base) == 0x000318, "Member 'UWBP_ReBalloon_Far_C::WBP_ReBalloon_s_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ReBalloon_Far_C, WBP_ReBalloon_Spikey_s) == 0x000320, "Member 'UWBP_ReBalloon_Far_C::WBP_ReBalloon_Spikey_s' has a wrong offset!");

}

