#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero0_0030_M0000_EVENT_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 00_0030_M0000_EVENT_000.00_0030_M0000_EVENT_000_C
// 0x01F0 (0x0440 - 0x0250)
class AZero0_0030_M0000_EVENT_000_C final : public ARCRealEventSubLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         m_______Track_0_AD35DCA94175136D0B458AA2723221FC;  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            m______Direction_AD35DCA94175136D0B458AA2723221FC; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     m______________;                                   // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class AActor*>              AllCharaMap;                                       // 0x0268(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class AActor*, class FName>              InitTPMap;                                         // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         TextIndex;                                         // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextEndIndex;                                      // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkSetIndex;                                      // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RCcinecamera_C*                     CurrentCamera;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CmnEventRoot_C*                     EventRoot;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                SpkExIdle1;                                        // 0x0328(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FName>                SpkExIdle2;                                        // 0x0378(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 TimelineList;                                      // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  TimelineStatelList;                                // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          m_______________0;                                 // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APointLight*                            PointLight;                                        // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           In_Glossary_ID;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 In_Phase;                                          // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Wait;                                              // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LookTarget_C*                       look1_1_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LS_Chr00000_portrait_2_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty; // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CmnEventRoot_C*                     EVENT_000_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMovieBP_C*                             MovieBP2_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_00_0030_M0000_EVENT_000(int32 EntryPoint);
	void EventSkip();
	void EventLoadEnd();
	void Event_000();
	void TalkEnd();
	void EventEnd();
	void EventStart();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void TalkSetAtoB();
	void TalkSetA2(int32 TalkIndex);
	void TalkSetA1(int32 TalkIndex);
	void TalkSetBtoC();
	void TalkSetB1(int32 TalkIndex);
	void TalkSetCtoD();
	void TalkSetC2(int32 TalkIndex);
	void TalkSetC1(int32 TalkIndex);
	void TalkSetDtoE();
	void TalkSetD1(int32 TalkIndex);
	void TalkSetEtoF();
	void TalkSetE1(int32 TalkIndex);
	void TalkSetToFinish();
	void AllTalkFinish();
	void TalkStart();
	void CustomEvent_3();
	void TalkSetF1(int32 TalkIndex);
	void SE_DropBookHeadThenGround();
	void ENV_SoundStart();
	void SoundStart();
	void m________________UpdateFunc();
	void m________________FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"00_0030_M0000_EVENT_000_C">();
	}
	static class AZero0_0030_M0000_EVENT_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero0_0030_M0000_EVENT_000_C>();
	}
};
static_assert(alignof(AZero0_0030_M0000_EVENT_000_C) == 0x000008, "Wrong alignment on AZero0_0030_M0000_EVENT_000_C");
static_assert(sizeof(AZero0_0030_M0000_EVENT_000_C) == 0x000440, "Wrong size on AZero0_0030_M0000_EVENT_000_C");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, UberGraphFrame) == 0x000250, "Member 'AZero0_0030_M0000_EVENT_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, m_______Track_0_AD35DCA94175136D0B458AA2723221FC) == 0x000258, "Member 'AZero0_0030_M0000_EVENT_000_C::m_______Track_0_AD35DCA94175136D0B458AA2723221FC' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, m______Direction_AD35DCA94175136D0B458AA2723221FC) == 0x00025C, "Member 'AZero0_0030_M0000_EVENT_000_C::m______Direction_AD35DCA94175136D0B458AA2723221FC' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, m______________) == 0x000260, "Member 'AZero0_0030_M0000_EVENT_000_C::m______________' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, AllCharaMap) == 0x000268, "Member 'AZero0_0030_M0000_EVENT_000_C::AllCharaMap' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, InitTPMap) == 0x0002B8, "Member 'AZero0_0030_M0000_EVENT_000_C::InitTPMap' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, TextIndex) == 0x000308, "Member 'AZero0_0030_M0000_EVENT_000_C::TextIndex' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, TextEndIndex) == 0x00030C, "Member 'AZero0_0030_M0000_EVENT_000_C::TextEndIndex' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, TalkSetIndex) == 0x000310, "Member 'AZero0_0030_M0000_EVENT_000_C::TalkSetIndex' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, CurrentCamera) == 0x000318, "Member 'AZero0_0030_M0000_EVENT_000_C::CurrentCamera' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, EventRoot) == 0x000320, "Member 'AZero0_0030_M0000_EVENT_000_C::EventRoot' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, SpkExIdle1) == 0x000328, "Member 'AZero0_0030_M0000_EVENT_000_C::SpkExIdle1' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, SpkExIdle2) == 0x000378, "Member 'AZero0_0030_M0000_EVENT_000_C::SpkExIdle2' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, TimelineList) == 0x0003C8, "Member 'AZero0_0030_M0000_EVENT_000_C::TimelineList' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, TimelineStatelList) == 0x0003D8, "Member 'AZero0_0030_M0000_EVENT_000_C::TimelineStatelList' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, m_______________0) == 0x0003E8, "Member 'AZero0_0030_M0000_EVENT_000_C::m_______________0' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, PointLight) == 0x0003F0, "Member 'AZero0_0030_M0000_EVENT_000_C::PointLight' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, In_Glossary_ID) == 0x0003F8, "Member 'AZero0_0030_M0000_EVENT_000_C::In_Glossary_ID' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, In_Phase) == 0x000408, "Member 'AZero0_0030_M0000_EVENT_000_C::In_Phase' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, Wait) == 0x000418, "Member 'AZero0_0030_M0000_EVENT_000_C::Wait' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, look1_1_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty) == 0x000420, "Member 'AZero0_0030_M0000_EVENT_000_C::look1_1_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, LS_Chr00000_portrait_2_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty) == 0x000428, "Member 'AZero0_0030_M0000_EVENT_000_C::LS_Chr00000_portrait_2_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, EVENT_000_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty) == 0x000430, "Member 'AZero0_0030_M0000_EVENT_000_C::EVENT_000_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_EVENT_000_C, MovieBP2_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty) == 0x000438, "Member 'AZero0_0030_M0000_EVENT_000_C::MovieBP2_ExecuteUbergraph_00_0030_M0000_EVENT_000_RefProperty' has a wrong offset!");

}

