#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero0_0030_M0000_CHECK_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RC_structs.hpp"
#include "RC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 00_0030_M0000_CHECK_000.00_0030_M0000_CHECK_000_C
// 0x0040 (0x02B0 - 0x0270)
class AZero0_0030_M0000_CHECK_000_C final : public ARCRealEventCheckSubLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   m___________;                                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 m_________________;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_RCcinecamera_C*>             Camera;                                            // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class FName>                           m______________;                                   // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Start_Closed;                                      // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_00_0030_M0000_CHECK_000(int32 EntryPoint);
	void Search_0042();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"00_0030_M0000_CHECK_000_C">();
	}
	static class AZero0_0030_M0000_CHECK_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero0_0030_M0000_CHECK_000_C>();
	}
};
static_assert(alignof(AZero0_0030_M0000_CHECK_000_C) == 0x000008, "Wrong alignment on AZero0_0030_M0000_CHECK_000_C");
static_assert(sizeof(AZero0_0030_M0000_CHECK_000_C) == 0x0002B0, "Wrong size on AZero0_0030_M0000_CHECK_000_C");
static_assert(offsetof(AZero0_0030_M0000_CHECK_000_C, UberGraphFrame) == 0x000270, "Member 'AZero0_0030_M0000_CHECK_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_CHECK_000_C, m___________) == 0x000278, "Member 'AZero0_0030_M0000_CHECK_000_C::m___________' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_CHECK_000_C, m_________________) == 0x000280, "Member 'AZero0_0030_M0000_CHECK_000_C::m_________________' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_CHECK_000_C, Camera) == 0x000288, "Member 'AZero0_0030_M0000_CHECK_000_C::Camera' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_CHECK_000_C, m______________) == 0x000298, "Member 'AZero0_0030_M0000_CHECK_000_C::m______________' has a wrong offset!");
static_assert(offsetof(AZero0_0030_M0000_CHECK_000_C, Start_Closed) == 0x0002A8, "Member 'AZero0_0030_M0000_CHECK_000_C::Start_Closed' has a wrong offset!");

}

